<?php
//////////////////////////////////////////////////////////////////////////////
// ·î¼¡Â»±×´Ø·¸ ·î¼¡ Âß¼ÚÂÐ¾ÈÉ½                                             //
// Copyright(C) 2003-2020 Kazuhiro.Kobayashi tnksys@nitto-kohki.co.jp       //
// Changed history                                                          //
// 2003/02/13 Created   profit_loss_bs_act.php                              //
// 2003/02/23 date("Y/m/d H:m:s") ¢ª H:i:s ¤Î¥ß¥¹½¤Àµ                       //
// 2003/02/27 ¥»¥Ã¥·¥ç¥óÊÑ¿ô¤ÎÃ±°Ì¤ò keihi_tani ¢ª taisyaku_tani ¤Ø         //
// 2003/02/28 ¾®¿ôÅÀ°Ê²¼·å¿ô¤ò 0/3/6/1/2/4/5 ¤Ø ÊÑ¹¹                        //
// 2003/03/04 Ê¸»ú¥µ¥¤¥º¤ò¥Ö¥é¥¦¥¶¡¼¤ÇÊÑ¹¹¤Ç¤­¤Ê¤¯¤·¤¿ title_font Åù        //
// 2003/03/10 $kisyu_month $kisyu_rows ¤¬ $ppmonth Åù¤Ë¤Ê¤Ã¤Æ¤¤¤¿ ¥ß¥¹      //
// 2003/03/11 Location: http ¢ª Location $url_referer ¤ËÊÑ¹¹                //
//            ¥á¥Ã¥»¡¼¥¸¤ò½ÐÎÏ¤¹¤ë¤¿¤á site_index site_id ¤ò¥³¥á¥ó¥È        //
//            ¤Ë¤· parent.menu_site.¤òÍ­¸ú¤ËÊÑ¹¹                            //
// 2003/05/01 ¹©¾ìÄ¹¤«¤é¤Î»Ø¼¨¤ÇÇ§¾Ú¤òAccount_group¤«¤éÄÌ¾ï¤ØÊÑ¹¹           //
// 2003/06/03 Ì¤¼ý¾ÃÈñÀÇ¤Ë¶â³Û¤¬¤¢¤ë¾ì¹ç¤¬Ç¯£²²ó¤¢¤ë¤¿¤á½¤Àµ£³·î¤È£´·î      //
// 2003/08/05 ¤½¤ÎÂ¾¤Î²ÊÌÜ¤Ë²¾¼õ¶â¤¬È¯À¸¤·¤¿¤¿¤á t_row=44 ¤ËÀßÄê¤·½¤Àµ      //
// 2003/12/04 ÉéºÄ¤ÎÉô¤Ç²¾ Ê§ ¾Ã Èñ ÀÇ ¢ª ²¾ ¼õ ¾Ã Èñ ÀÇ ¤ËÄûÀµ             //
// 2003/12/11 Ì¤¼ý¾ÃÈñÀÇ¤Ç 2003/02 °ÊÁ°¤ÏÌ¤ÂÐ±þ¤Î¤¿¤á¶¯À©Åª¤Ë0¤Ç½é´ü²½      //
// 2004/05/11 º¸Â¦¤Î¥µ¥¤¥È¥á¥Ë¥å¡¼¤Î¥ª¥ó¡¦¥ª¥Õ ¥Ü¥¿¥ó¤òÄÉ²Ã                 //
// 2004/07/05 Ìµ·Á¸ÇÄê»ñ»º¤Î²ÊÌÜ »ÜÀßÍøÍÑ¸¢(F45)WAPLBSL=F45(2440) ¤òÄÉ²Ã    //
//                                  Âß¼ÚÂÐ¾ÈÉ½¤Î²ÊÌÜ¤ÎÄÉ²Ã¤ÏÈ¾Æü¤«¤«¤ê¤Þ¤¹¡£//
// 2005/04/14 Î®Æ°»ñ»º¤Î²ÊÌÜ Ì¤¼ýË¡¿ÍÀÇÅù(F46)WAPLBSL=F46(1475) ¤òÄÉ²Ã      //
// 2005/10/27 MenuHeader class ¤ò»ÈÍÑ¤·¤Æ¶¦ÄÌ¥á¥Ë¥å¡¼²½µÚ¤ÓÇ§¾ÚÊý¼°¤ØÊÑ¹¹   //
// 2006/06/07 »ñËÜ¤ÎÉô¢ª½ã»ñ»º¤ÎÉô¤Ø ¿·²ñ¼ÒË¡¤Ë¤è¤ëÌ¾¾ÎÊÑ¹¹                 //
// 2009/04/15 ¿·µ¬²ÊÌÜ¡Ê5²ÊÌÜ¡ËÄÉ²Ã ÃùÂ¢ÉÊ(F47)WAPLBSL=F47(1270)¡¢          //
//            ¥ê¡¼¥¹»ñ»º(F48)WAPLBSL=F48(2211)¡¢¥ê¡¼¥¹ºÄÌ³(Ã»´ü)(F49)       //
//            WAPLBSL=F49(4161)¡¢¥ê¡¼¥¹ºÄÌ³(Ä¹´ü)(F50)WAPLBSL=F50(5180)¡¢   //
//            Ä¹´üÌ¤Ê§¶âWAPLBSL=F51(5190) ¾¦ÉÊµÚ¤ÓÀ½ÉÊWAPLBSL=F53(1230)     //
//            ¿·µ¬²ÊÌÜÈ¯À¸¤Î¾ì¹ç¤ÏAS¤Ë¥À¥ß¡¼¤Î¥Ç¡¼¥¿¤òºîÀ®¤¹¤ë¤³¤È¡£        //
//            F52¡Á¡¢ºÇ¸å¤ËÄÉ²Ã¤·¤Ê¤¤¤È¥×¥í¥°¥é¥à¤¬½çÈÖ»ØÄê¤Ê¤Î¤Ç¤º¤ì¤ëÂçÃ« //
// 2009/06/16 ¿·µ¬²ÊÌÜ ÄÉ²Ã »ñËÜ½àÈ÷¶â(F52) WAPLBSL=F52(7210)               //
//            ¿·µ¬²ÊÌÜÈ¯À¸¤Î¾ì¹ç¤ÏWAPLBSL¤Ë¥À¥ß¡¼¤Î¥Ç¡¼¥¿¤òºîÀ®¤¹¤ë¤³¤È¡£   //
//            ºÇ¸å¤ËÄÉ²Ã¤·¤Ê¤¤¤È¥×¥í¥°¥é¥à¤¬½çÈÖ»ØÄê¤Ê¤Î¤Ç¤º¤ì¤ë       ÂçÃ« //
// 2009/07/10 Ãª²·»ñ»º¤Î¾¦Ë¡²ÊÌÜÊÑ¹¹¡¦ÄÉ²Ã¤ËÈ¼¤¤Ãª²·¤ò¤Þ¤È¤á¤ëÉôÊ¬¤òÊÑ¹¹    //
//            Ãª²·ÉôÊ¬¤Î$r¤ÏF¡û¤ÎÃÍ¤ÈÆ±¤¸¤Ê¤Î¤ÇÃí°Õ                         //
//            ¾¦ÉÊµÚ¤ÓÀ½ÉÊ(F53)WAPLBSL=F53(1230)                       ÂçÃ« //
// 2009/08/20 ²ñ¼ÒË¡¤Ë¤¢¤ï¤»Âß¼ÚÂÐ¾ÈÉ½¤Î¹½À®ÊÑ¹¹µÚ¤Ó¿·µ¬²ÊÌÜÄÉ²Ã            //
//            ¤½¤ÎÂ¾»ñËÜ¾êÍ¾¶â(F54)WAPLBSL=F54(7215)                        //
//            ¤½¤ÎÂ¾Íø±×¾êÍ¾¶â(F55)WAPLBSL=F55(7225)                   ÂçÃ« //
// 2010/10/06 11´ü¾å´üÊ¬¤ÎÆÃÃí(00222)Çä¾å¹â¤òÄ´À°¤¹¤ë°Ù                     //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2010/11/05 11´ü10·îÊ¬¤ÎÆÃÃí(00222)Çä¾å¹â¤òÄ´À°¤¹¤ë°Ù                     //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2010/12/03 11´ü11·îÊ¬¤ÎÆÃÃí(00222)Çä¾å¹â¤òÄ´À°¤¹¤ë°Ù                     //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2011/01/11 11´ü11·îÊ¬¤ÎÆÃÃí(00222)Çä¾å¹â¤òÄ´À°¤¹¤ë°Ù                     //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2011/04/06 11´ü¤ÎÆÃÃí(00222)Çä¾å¹â¤òÄ´À°¤¹¤ë°Ù                           //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2011/04/20 11´ü¤Î¶â·¿¼£¹©¶ñ¤ò²¾Ê§¶â¤«¤éÃª²·»ñ»º¤Ø¤ÎÄ´À°                  //
//            ²¾Ê§¶â(9)¢ªÃª²·»ñ»º(2) 15,278,200±ß                      ÂçÃ« //
// 2011/07/06 12´ü6·î¤Î¾¦´ÉÇä¾å¹â¤òÄ´À°¤¹¤ë°Ù(+300,000)                     //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2011/08/03 12´ü7·î¤Î¾¦´ÉÇä¾å¹â¤òÄ´À°¤¹¤ë°Ù(-100,000)                     //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2011/09/05 12´ü8·î¤Î¾¦´ÉÇä¾å¹â¤òÄ´À°¤¹¤ë°Ù(-100,000)                     //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2011/10/08 12´ü9·î¤Î¾¦´ÉÇä¾å¹â¤òÄ´À°¤¹¤ë°Ù(+100,000)                     //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2011/10/18 12´ü¾å´ü(4·î¡Á9·î¤Ï15278200¡¢9·î¤Ï20205550)¤ò                 //
//            ²¾Ê§¶â(9)¢ªÃª²·»ñ»º(2)¤ËÄ´À°(ÃùÂ¢ÉÊ)                     ÂçÃ« //
// 2011/11/04 12´ü10·î¤Î¾¦´ÉÇä¾å¹â¤òÄ´À°¤¹¤ë°Ù(+300,000)                    //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2011/12/05 12´ü11·î¤Î¾¦´ÉÇä¾å¹â¤òÄ´À°¤¹¤ë°Ù(-300,000)                    //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2012/01/24 ·ÐÎò¤Î¥Ç¡¼¥¿ÊÝ´É¤òÄÉ²Ã¡Ê£²´üÈæ³ÓÉ½¤Ç»ÈÍÑ¡Ë               ÂçÃ« //
// 2012/02/03 12´ü1·î¤Î¾¦´ÉÇä¾å¹â¤òÄ´À°¤¹¤ë°Ù(100,000)                      //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2012/02/28 2012Ç¯1·î ¶ÈÌ³°ÑÂ÷Èñ Ä´À° ¥ê¥Ë¥¢À½Â¤·ÐÈñ +1,156,130±ß    ÂçÃ« //
//            Ì¤Ê§¶â(28)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°                         ÂçÃ« //
//             ¢¨ Ê¿½Ð²£ÀîÇÉ¸¯ÎÁ 2·î¤ËµÕÄ´À°¤ò¹Ô¤¦¤³¤È                      //
// 2012/03/05 12´ü1·î¤Î¾¦´ÉÇä¾å¹â¤òÄ´À°¤¹¤ë°Ù(100,000)                      //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°               //
//            2012Ç¯1·î ¶ÈÌ³°ÑÂ÷Èñ Ä´À° ¥ê¥Ë¥¢À½Â¤·ÐÈñ -1,156,130±ß Ìá¤·    //
//            Ì¤Ê§¶â(28)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°                         ÂçÃ« //
// 2012/04/02 03/05¤Î¾¦´ÉÄ´À°¤ò100,000±ß¤«¤é200,000±ß¤ËÊÑ¹¹            ÂçÃ« //
// 2012/04/04 12´ü3·î¤Î¾¦´ÉÇä¾å¹â¤òÄ´À°¤¹¤ë°Ù(+100,000)                     //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2012/04/10 ²¾¼õ¾ÃÈñÀÇ(34)¤ÎÄ´À°¤òÌ¤Ê§¾ÃÈñÀÇ(29)¤ËÊÑ¹¹¤·¤¿¤¬Ìá¤·¤¿   ÂçÃ« //
// 2012/05/07 13´ü4·î¤Î¾¦´ÉÇä¾å¹â¤òÄ´À°¤¹¤ë°Ù(-200,000)                     //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2012/06/05 13´ü5·î¤Î¾¦´ÉÇä¾å¹â¤òÄ´À°¤¹¤ë°Ù(+300,000)                     //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2012/07/05 13´ü6·î¤Î¾¦´ÉÇä¾å¹â¤òÄ´À°¤¹¤ë°Ù(-100,000)                     //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2012/07/11 Âè£±»ÍÈ¾´ü¤ÎÄ´À°¤òÄÉ²Ã                                   ÂçÃ« //
// 2012/08/03 13´ü7·î¤Î¥ê¥Ë¥¢£²½Å·×¾å(2,440,675±ß)¤òÄ´À°               ÂçÃ« //
// 2012/09/05 ·«±ÛÍø±×¾êÍ¾¶â¤ÎÄ´À°¤òÄÉ²Ã¡ÊÃæ´Öor´üËö¤Þ¤Ç¡©¡Ë           ÂçÃ« //
// 2012/10/01 ²ñ¼ÒË¡¤Ë¤¢¤ï¤»Âß¼ÚÂÐ¾ÈÉ½¤Î¹½À®ÊÑ¹¹µÚ¤Ó¿·µ¬²ÊÌÜÄÉ²Ã¡©          //
//            ¤½¤ÎÂ¾¤Î±Ä¶È³°ÈñÍÑ(9310)                                 ÂçÃ« //
// 2012/10/03 »ÃÄêÍÑ¤ËÃùÂ¢ÉÊ¤ÎÄ´À°¤òÄÉ²Ã                               ÂçÃ« //
// 2012/10/09 ÃùÂ¢ÉÊ¤ÎÄ´À°¤ò³ÎÄêÈÇ¤ËÊÑ¹¹                               ÂçÃ« //
// 2012/11/05 13´ü¤Î¾¦´ÉÇä¾å¹â(´ü¼ó»Ä¹â)(-100,000)¤È                        //
//            13´ü7·î¤Î¥ê¥Ë¥¢£²½Å·×¾å(-2,440,675±ß)¤òÄ´À°¤¹¤ë¤¿¤á           //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2012/12/05 13´ü¤Î¾¦´ÉÇä¾å¹â(´ü¼ó»Ä¹â)(-100,000)¤È                        //
//            13´ü7·î¤Î¥ê¥Ë¥¢£²½Å·×¾å(-2,440,675±ß)¤òÄ´À°¤¹¤ë¤¿¤á           //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2013/01/11 13´ü¤Î¾¦´ÉÇä¾å¹â(´ü¼ó»Ä¹â)(-100,000)¤È                        //
//            13´ü7·î¤Î¥ê¥Ë¥¢£²½Å·×¾å(-2,440,675±ß)¤òÄ´À°¤¹¤ë¤¿¤á           //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2013/01/12 ¾¦´ÉÇä¾å¹â(´ü¼ó»Ä¹â)(-100,000)¤ÎÄ´À°¤Ï£±£²·î°Ê¹ß¹Ô¤ï¤Ê¤¯¤¤¤¤  //
//            ·è»»»þ¤ËÅö´ü½ãÍø±×¤È·«±ÛÍø±×¾êÍ¾¶â¤Î¿¶ÂØ¤Î¾ò·ï¤òÊÑ¤¨¤ë»ö ÂçÃ« //
//            ¤Þ¤¿¡¢¥ê¥Ë¥¢£²½Å·×¾å¤Ï£±·î¤ËÅÁÉ¼¤òÆþ¤ì¤ë¤Î¤Ç¤½¤³¤«¤éÌµ¤·¤Ç    //
//            ¤½¤ÎºÝ¡¢²¾¼õ¾ÃÈñÀÇ¤ËÄ´À°¤òÅÁÉ¼¤ÇÆþ¤ì¤ë¤Î¤Ç·è»»¤Þ¤Ç¤Ï²¾¼õ¤«¤é  //
//            Ì¤Ê§¾ÃÈñÀÇ¤Ë¿¶ÂØ¤¨¤ëÄ´À°¤òÆþ¤ì¤ëÉ¬Í×¤¬¤¢¤ë¡£                  //
// 2013/01/18 £±·î¤Ë¥ê¥Ë¥¢£²½Å·×¾å(-2,440,675±ß¡Ë¤ÎÄ´À°ÅÁÉ¼¤òÆþ¤ì¤ë¤¬       //
//            ·è»»»þ¤Î¾ÃÈñÀÇ¡¦Åö´ü½ãÍø±×¤Î¿¶ÂØ½èÍý¤¬½ª¤ï¤é¤Ê¤¤¤ÈÀµ¤·¤¤¿ô»ú¤Ë//
//            ¤Ê¤é¤Ê¤¤°ÙÄ´À°¤òÄÉ²Ã¡££³·î¿¶ÂØ´°Î»»þ¤ËËº¤ì¤º¤Ë¥×¥í¥°¥é¥à¤Î    //
//            ÊÑ¹¹¤ò¹Ô¤¦¤³¤È¡£IF¾ò·ï±¦Â¦201303¤ò201302¤ØÊÑ¹¹           ÂçÃ« //
// 2013/03/05 £²·î¤Ë»ÅÀÚÃ±²ÁÅÐÏ¿¥ß¥¹È¯À¸¡££²·î¤ËÄ´À°ÄÉ²Ã¡Ê5,518,600¡Ë       //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2013/04/08 13´ü3·î °µÂ¤¹©¶ñºß¸Ë³ÎÄê¤Î°Ù¡¢³ÎÄêÈÇ¤È14´ü¤ÎÄ´À°¤òÄÉ²Ã   ÂçÃ« //
// 2013/04/09 13´ü3·î Åö´ü½ãÍø±×¡¦¾ÃÈñÀÇ¿¶ÂØ´°Î»¤Î°ÙÄ´À°ÆüÉÕ¤òÊÑ¹¹     ÂçÃ« //
// 2013/05/28 2013/05¤è¤êÃùÂ¢ÉÊ£±ÅÀÄÉ²Ã ¥ä¥Þ¥ÏÃ±¼´¥í¥Ü¥Ã¥È 336,600±ß   ÂçÃ« //
// 2013/10/03 »ÃÄêÍÑ¤ËÃùÂ¢ÉÊ¤ÎÄ´À°¤òÄÉ²Ã                               ÂçÃ« //
// 2013/10/08 14´ü9·î °µÂ¤¹©¶ñºß¸Ë³ÎÄê¤Î°Ù¡¢³ÎÄê¤È13´ü²¼´ü¤ÎÄ´À°¤òÄÉ²Ã ÂçÃ« //
// 2013/10/10 14´ü9·î Ì¤Ê§¾ÃÈñÀÇ[29] ¤ò Ì¤¼ý¾ÃÈñÀÇÅù¤Ø¿¶ÂØ             ÂçÃ« //
// 2013/11/06 14´ü10·î¤Î¾¦´ÉÇä¾å¹â¤òÄ´À°¤¹¤ë°Ù(+100,000)                    //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2013/12/04 14´ü10·î¤Î¾¦´ÉÇä¾å¹âÄ´À°¤ÎÌá¤·¤Î°Ù¡¢14´ü11·î¤òÄ´À°(-100,000)  //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
//            ¢¬¤Ï¤¤¤é¤Ê¤«¤Ã¤¿¤Î¤Çºï½ü                                 ÂçÃ« //
// 2014/01/10 14´ü12·î¤Î¾¦´ÉÇä¾å¹â¤òÄ´À°¤¹¤ë°Ù(+100,000)                    //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2014/02/05 14´ü1·î¤Î¾¦´ÉÇä¾å¹â¤òÄ´À°¤¹¤ë°Ù(+400,000)                     //
//            (12·îÊ¬¤ÎÌá¤·-100,000±ß¤È1·îÊ¬¤ÎÄ´À°+500,000±ß¤Î·×+400,000±ß) //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2014/03/05 14´ü2·î¤Î¾¦´ÉÇä¾å¹â¤òÄ´À°¤¹¤ë°Ù(+300,000)                     //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2014/04/08 ÃùÂ¢ÉÊ¤ÎÄ´À°¤Î³ÎÄêÈÇ¤òÄÉ²Ã                               ÂçÃ« //
// 2014/06/04 14´ü5·î¤Î¾¦´ÉÇä¾å¹â¤òÄ´À°¤·Ëº¤ì¤¿°Ù(-500,000)                 //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2014/06/12 15´ü¾å´ü¤Î°µÂ¤¹©¶ñ¿¶ÂØ¤òËº¤ì¤Æ¤¤¤¿¤Î¤ÇÄÉ²Ã               ÂçÃ« //
// 2014/10/06 9·î¤Î»ÃÄê°µÂ¤¹©¶ñ¿¶ÂØ¤È³ÎÄê¤Î¿ô»ú¤òÄÉ²Ã¡£³ÎÄêºîÀ®»þ¤Ë         //
//            ÊÑ¹¹¤¹¤ë»ö                                               ÂçÃ« //
// 2014/10/08 °µÂ¤¹©¶ñ¤Î¿¶ÂØ¹â¤ò³ÎÄê¤ËÊÑ¹¹                             ÂçÃ« //
// 2015/04/07 »ÃÄêÍÑ¤ËÃùÂ¢ÉÊ¤ÎÄ´À°¤òÄÉ²Ã                               ÂçÃ« //
// 2015/04/09 ÃùÂ¢ÉÊ¤Î¿¶ÂØ¤ò»ÃÄê¤«¤é³ÎÄê¤ËÊÑ¹¹                         ÂçÃ« //
// 2015/05/08 Á°·î¡¦Á°¡¹·îÊ¬¤ÎÃùÂ¢ÉÊÄ´À°¤òÄÉ²Ã                         ÂçÃ« //
//            ¾¦´ÉÄ´À°¥ß¥¹¤Ë¤è¤êÄ´À°-200,000±ß¡ÊÍè·î¤ÏµÕ¡©¡Ë           ÂçÃ« //
// 2015/09/04 16´ü8·î¤ÎMT¸ÄÊÌÇä¾å¤òÄ´À°¤¹¤ë°Ù(+193,970)                     //
//            Çä³Ý¶â(1)¡¢²¾¼õ¾ÃÈñÀÇ(34)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°          ÂçÃ« //
// 2015/10/06 9·î¤Î»ÃÄê°µÂ¤¹©¶ñ¿¶ÂØ¤È³ÎÄê¤Î¿ô»ú¤òÄÉ²Ã¡£³ÎÄêºîÀ®»þ¤Ë         //
//            ÊÑ¹¹¤¹¤ë»ö                                               ÂçÃ« //
// 2015/10/07 ÃùÂ¢ÉÊ¤Î¿¶ÂØ¤ò»ÃÄê¤«¤é³ÎÄê¤ËÊÑ¹¹                         ÂçÃ« //
// 2015/11/02 ¥ä¥Þ¥ÏÃ±¼´¥í¥Ü¥Ã¥ÈÃùÂ¢ÉÊ»ÈÍÑ¡Ê336,600±ß¡Ë¢ª                   //
//            ÃùÂ¢ÉÊ¤È¤·¤ÆÃ±¼´¥í¥Ü¥Ã¥ÈºÆ¹ØÆþ¡Ê416,700±ß¡Ë              ÂçÃ« //
// 2016/04/08 ÃùÂ¢ÉÊ¤Î¿¶ÂØ¤òºÇ¿·¤ËÊÑ¹¹                                 ÂçÃ« //
// 2016/05/09 17´ü4·î¤Î¾¦´ÉÇä¾å¹â¤òÄ´À°ÅÁÉ¼¥ß¥¹¤Î°Ù(-600,000)               //
//            Çä³Ý¶â(1)¡¢Åö´ü½ãÍø±×(41)¤ËÄ´À°(¾ÃÈñÀÇ¤Ï¹ç¤Ã¤Æ¤¿¤Î¤Ç¤Ê¤·)ÂçÃ« //
// 2016/10/05 9·î¤Î»ÃÄê°µÂ¤¹©¶ñ¿¶ÂØ¤È³ÎÄê¤Î¿ô»ú¤òÄÉ²Ã¡£³ÎÄêºîÀ®»þ¤Ë         //
//            ÊÑ¹¹¤¹¤ë»ö                                               ÂçÃ« //
// 2016/10/06 ÃùÂ¢ÉÊ¤Î¿¶ÂØ¤òºÇ¿·¤ËÊÑ¹¹                                 ÂçÃ« //
// 2016/10/13 ÃùÂ¢ÉÊ¥ä¥Þ¥ÏÃ±¼´¥í¥Ü¥Ã¥È¤Î¶â³Û¤òÄûÀµ                     ÂçÃ« //
// 2016/11/29 11·î¤è¤êÃùÂ¢ÉÊ¤ËAC¥µ¡¼¥Ü¥â¡¼¥¿¡¼ÄÉ²Ã¡Ê66,500±ß¡Ë         ÂçÃ« //
// 2016/12/21 12·î¤è¤êÃùÂ¢ÉÊ¤ËAC¥µ¡¼¥Ü¥â¡¼¥¿¡¼ÄÉ²Ã¡Ê58,000±ß¡Ë         ÂçÃ« //
// 2017/03/03 ¥ä¥Þ¥ÏÃ±¼´¥í¥Ü¥Ã¥ÈÃùÂ¢ÉÊ»ÈÍÑ¡Ê416,700±ß¡Ë                ÂçÃ« //
//            ¿·µ¬ÃùÂ¢ÉÊ¤Ï¸½ºß¹ØÆþ¼êÇÛÃæ                                    //
// 2017/04/06 ¿·µ¬²ÊÌÜÄÉ²Ã Ì¤¼ý¼ý±×(F56)WAPLBSL=F56(1430)              ÂçÃ« //
//            BS¤ÎºÆ°õºþ¤ÇWAPLBSL¤¬¹¹¿·¤µ¤ì¤ë(WAPLBSP¤ò¹¹¿·¤·¤¿)            //
// 2017/04/07 3·î¤Î»ÃÄê°µÂ¤¹©¶ñ¿¶ÂØ¤È³ÎÄê¤Î¿ô»ú¤òÄÉ²Ã¡£³ÎÄêºîÀ®»þ¤Ë         //
//            ÊÑ¹¹¤¹¤ë»ö                                               ÂçÃ« //
// 2017/04/11 ÃùÂ¢ÉÊ¤Î¿¶ÂØ¤òºÇ¿·¤ËÊÑ¹¹                                 ÂçÃ« //
// 2017/04/13 Ì¤¼ý¼ý±×¤Î¥Ç¡¼¥¿ÊÝ´É¤¬´Ö°ã¤Ã¤Æ¤¤¤¿¤Î¤Ç½¤Àµ               ÂçÃ« //
// 2017/08/03 ¿·µ¬²ÊÌÜÄÉ²Ã Á°Ê§¾ÃÈñÀÇ(F57)WAPLBSL=F57(1495)            ÂçÃ« //
//            BS¤ÎºÆ°õºþ¤ÇWAPLBSL¤¬¹¹¿·¤µ¤ì¤ë(WAPLBSP¤ò¹¹¿·¤·¤¿)            //
// 2017/10/04 9·î¤Î»ÃÄê°µÂ¤¹©¶ñ¿¶ÂØ¤È³ÎÄê¤Î¿ô»ú¤òÄÉ²Ã¡£³ÎÄêºîÀ®»þ¤Ë         //
//            ÊÑ¹¹¤¹¤ë»ö                                               ÂçÃ« //
// 2018/03/29 ¥ä¥Þ¥ÏÃ±¼´¥í¥Ü¥Ã¥ÈÃùÂ¢ÉÊÄÉ²Ã¡Ê477,500±ß¡Ë                ÂçÃ« //
// 2018/04/06 ³ÎÄêÈÇ¤ËÊÑ¹¹                                             ÂçÃ« //
// 2018/07/05 19´ü¾å´üÍÑ¤Î¿¶ÂØ¤¬¤Ê¤«¤Ã¤¿¤Î¤ÇÄÉ²Ã                       ÂçÃ« //
// 2018/09/05 8·î¤è¤êÃùÂ¢ÉÊ¤Ë¥·¥ó¥¯¥í¥¿¥Ã¥ÑÄÉ²Ã¡Ê348,000±ß¡Ë           ÂçÃ« //
// 2018/10/04 °µÂ¤¹©¶ñ¤Îºß¸Ë¤ò¹¹¿·                                     ÂçÃ« //
// 2018/10/17 ´ü¼ó¤Ë9·î¤òÆþ¤ì¤Æ¤¤¤¿¤Î¤Çºï½ü                            ÂçÃ« //
// 2019/04/05 ÃùÂ¢ÉÊAC¥µ¡¼¥Ü¥â¡¼¥¿¡¼66,500ºï½ü¡¢¥Ü¡¼¥ë¥Í¥¸39,800¡ß5¤ò       //
//            ¤òÄÉ²Ã¡£»ÃÄêÈÇ¡£³ÎÄê¤Ç¤Ï°µÂ¤¹©¶ñ¤òÄ¾¤¹¡£                 ÂçÃ« //
// 2019/04/09 °µÂ¤¹©¶ñ¤¬27,332,900±ß¤ËÊÑ¹¹¡£³ÎÄê¤ËÄûÀµ                 ÂçÃ« //
// 2019/10/07 °µÂ¤¹©¶ñ¤¬29,030,400±ß¤ËÊÑ¹¹¡£³ÎÄê¤ËÄûÀµ                 ÂçÃ« //
// 2020/04/03 ÃùÂ¢ÉÊAC¥µ¡¼¥Ü¥â¡¼¥¿¡¼58,000±ß¤òºï½ü¡£                        //
//            »ÃÄêÈÇ¡£³ÎÄê¤Ç¤Ï°µÂ¤¹©¶ñ¤òÄ¾¤¹¡£                         ÂçÃ« //
// 2020/04/06 °µÂ¤¹©¶ñ³ÎÄêÆþÂØ ËÜÈÖ¤Ï³ÎÄê»þ¤ËÊÑ¹¹                      ÂçÃ« //
// 2020/07/08 ÃùÂ¢ÉÊ¥×¥í¡¼¥Ö2,590,000±ß¤òÄÉ²Ã                          ÂçÃ« //
// 2021/04/07 °µÂ¤¹©¶ñ¤¬29,988,800±ß¤ËÊÑ¹¹¡£³ÎÄê¤ËÄûÀµ                 ÂçÃ« //
//////////////////////////////////////////////////////////////////////////////
ini_set('error_reporting', E_STRICT);       // E_STRICT=2048(php5) E_ALL=2047 debug ÍÑ
// ini_set('error_reporting',E_ALL);           // E_ALL='2047' debug ÍÑ
// ini_set('display_errors','1');              // Error É½¼¨ ON debug ÍÑ ¥ê¥ê¡¼¥¹¸å¥³¥á¥ó¥È
session_start();                            // ini_set()¤Î¼¡¤Ë»ØÄê¤¹¤ë¤³¤È Script ºÇ¾å¹Ô

require_once ('../function.php');           // define.php ¤È pgsql.php ¤ò require_once ¤·¤Æ¤¤¤ë
require_once ('../tnk_func.php');           // TNK ¤Ë°ÍÂ¸¤¹¤ëÉôÊ¬¤Î´Ø¿ô¤ò require_once ¤·¤Æ¤¤¤ë
require_once ('../MenuHeader.php');         // TNK Á´¶¦ÄÌ menu class
access_log();                               // Script Name ¤Ï¼«Æ°¼èÆÀ

///// TNK ¶¦ÍÑ¥á¥Ë¥å¡¼¥¯¥é¥¹¤Î¥¤¥ó¥¹¥¿¥ó¥¹¤òºîÀ®
$menu = new MenuHeader(0);                  // Ç§¾Ú¥Á¥§¥Ã¥¯0=°ìÈÌ°Ê¾å Ìá¤êÀè=TOP_MENU ¥¿¥¤¥È¥ëÌ¤ÀßÄê
    // ¼ÂºÝ¤ÎÇ§¾Ú¤Ïprofit_loss_submit.php¤Ç¹Ô¤Ã¤Æ¤¤¤ëaccount_group_check()¤ò»ÈÍÑ

////////////// ¥µ¥¤¥ÈÀßÄê
// $menu->set_site(10, 7);                     // site_index=10(Â»±×¥á¥Ë¥å¡¼) site_id=7(·î¼¡Â»±×)
//////////// É½Âê¤ÎÀßÄê
$menu->set_caption('ÆÊÌÚÆüÅì¹©´ï(³ô)');
//////////// ¸Æ½ÐÀè¤ÎactionÌ¾¤È¥¢¥É¥ì¥¹ÀßÄê
// $menu->set_action('Ãê¾Ý²½Ì¾',   PL . 'address.php');

$url_referer     = $_SESSION['pl_referer'];     // ¸Æ½Ð¤â¤È¤Î URL ¤ò¼èÆÀ

///// ´ü¡¦·î¤Î¼èÆÀ
$ki = Ym_to_tnk($_SESSION['pl_ym']);
$tuki = substr($_SESSION['pl_ym'],4,2);

//////////// ¥¿¥¤¥È¥ëÌ¾(¥½¡¼¥¹¤Î¥¿¥¤¥È¥ëÌ¾¤È¥Õ¥©¡¼¥à¤Î¥¿¥¤¥È¥ëÌ¾)
$menu->set_title("Âè {$ki} ´ü¡¡{$tuki} ·îÅÙ¡¡¡¡Âß¡¡¼Ú¡¡ÂÐ¡¡¾È¡¡É½");

///// ÂÐ¾ÝÅö·î
$yyyymm = $_SESSION['pl_ym'];
///// ÂÐ¾ÝÁ°·î
if (substr($yyyymm,4,2)!=01) {
    $p1_ym = $yyyymm - 1;
} else {
    $p1_ym = $yyyymm - 100;
    $p1_ym = $p1_ym + 11;
}
///// ÂÐ¾ÝÁ°¡¹·î
if (substr($p1_ym,4,2)!=01) {
    $p2_ym = $p1_ym - 1;
} else {
    $p2_ym = $p1_ym - 100;
    $p2_ym = $p2_ym + 11;
}
///// Á°´üËö Ç¯·î¤Î»»½Ð
$yyyy = substr($yyyymm, 0,4);
$mm   = substr($yyyymm, 4,2);
if (($mm >= 1) && ($mm <= 3)) {
    $yyyy = ($yyyy - 1);
}
$pre_end_ym = $yyyy . "03";     // ´ü½éÇ¯·î

///// É½¼¨Ã±°Ì¤òÀßÄê¼èÆÀ
if (isset($_POST['taisyaku_tani'])) {
    $_SESSION['taisyaku_tani'] = $_POST['taisyaku_tani'];
    $tani = $_SESSION['taisyaku_tani'];
} elseif (isset($_SESSION['taisyaku_tani'])) {
    $tani = $_SESSION['taisyaku_tani'];
} else {
    $tani = 1000000;        // ½é´üÃÍ É½¼¨Ã±°Ì Àé±ß
    $_SESSION['taisyaku_tani'] = $tani;
}
///// É½¼¨ ¾®¿ôÉô·å¿ô ÀßÄê¼èÆÀ
if (isset($_POST['keihi_keta'])) {
    $_SESSION['keihi_keta'] = $_POST['keihi_keta'];
    $keta = $_SESSION['keihi_keta'];
} elseif (isset($_SESSION['keihi_keta'])) {
    $keta = $_SESSION['keihi_keta'];
} else {
    $keta = 0;          // ½é´üÃÍ ¾®¿ôÅÀ°Ê²¼·å¿ô
    $_SESSION['keihi_keta'] = $keta;
}
///// pl_bs_summary ¤è¤ê¥Ç¡¼¥¿¼èÆÀ
    ///// Åö·î
$month = array();
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d order by t_row ASC", $yyyymm);
if (($rows = getResult2($query, $month)) <= 0) {
    $_SESSION['s_sysmsg'] .= sprintf("Âß¼ÚÂÐ¾ÈÉ½¤Î¥Ç¡¼¥¿¤¬¤Ê¤¤<br>Âè %d´ü %d·î",$ki,$tuki);
    header("Location: $url_referer");
    exit();
}
// 2010/10/06 ÄÉ²Ã
if ($yyyymm == 201009) {
    $month[1][0]  += 6562097;
    $month[29][0] += 312481;
    $month[41][0] += 6249616;
}
// 2010/11/05 ÄÉ²Ã
if ($yyyymm == 201010) {
    $month[1][0]  += 6562097;
    $month[29][0] += 312481;
    $month[41][0] += 6249616;
    $month[1][0]  += 796423;
    $month[34][0] += 37925;
    $month[41][0] += 758498;
}
// 2010/12/03 ÄÉ²Ã
if (($yyyymm >= 201011) && ($yyyymm <= 201103)) {
    $month[1][0]  += 6562097;
    $month[29][0] += 312481;
    $month[41][0] += 6249616;
    $month[1][0]  += 796423;
    $month[34][0] += 37925;
    $month[41][0] += 758498;
    $month[1][0]  += 1817925;
    $month[34][0] += 86568;
    $month[41][0] += 1731357;
}
// 2011/04/06 ÄÉ²Ã
if ($yyyymm == 201103) {
    $month[1][0]  -= 6562097;
    $month[29][0] -= 312481;
    $month[41][0] -= 6249616;
    $month[1][0]  -= 796423;
    $month[34][0] -= 37925;
    $month[41][0] -= 758498;
    $month[1][0]  -= 1817925;
    $month[34][0] -= 86568;
    $month[41][0] -= 1731357;
    // 2011/04/20 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡Ê¸¶ºàÎÁµÚ¤ÓÃùÂ¢ÉÊ¡Ë
    $month[2][0]  += 15278200;
    $month[9][0]  -= 15278200;
}
// 2011/10/18 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
if ($yyyymm >= 201104 && $yyyymm <= 201108) {
    $month[2][0]  += 15278200;
    $month[9][0]  -= 15278200;
}
// 2011/07/06 ÄÉ²Ã
if ($yyyymm == 201106) {
    $month[1][0]  += 315000;
    $month[34][0] += 15000;
    $month[41][0] += 300000;
}
// 2011/08/03 ÄÉ²Ã
if ($yyyymm == 201107) {
    $month[1][0]  -= 105000;
    $month[34][0] -= 5000;
    $month[41][0] -= 100000;
}
// 2011/09/05 ÄÉ²Ã
if ($yyyymm == 201108) {
    $month[1][0]  -= 105000;
    $month[34][0] -= 5000;
    $month[41][0] -= 100000;
}
// 2011/10/05 ÄÉ²Ã
if ($yyyymm == 201109) {
    $month[1][0]  += 210000;
    $month[34][0] += 10000;
    $month[41][0] += 200000;
    // 2011/10/18 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
    $month[2][0]  += 20205550;
    $month[9][0]  -= 20205550;
}
// 2012/04/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
if ($yyyymm == 201110) {
    $month[2][0]  += 20205550;
    $month[9][0]  -= 20205550;
}
// 2012/04/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
if ($yyyymm >= 201111 && $yyyymm <= 201112) {
    $month[2][0]  += 20331550;
    $month[9][0]  -= 20331550;
}
// 2012/04/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
if ($yyyymm >= 201201 && $yyyymm <= 201202) {
    $month[2][0]  += 20518550;
    $month[9][0]  -= 20518550;
}
// 2011/11/04 ÄÉ²Ã
if ($yyyymm == 201110) {
    $month[1][0]  += 315000;
    $month[34][0] += 15000;
    $month[41][0] += 300000;
}
// 2011/12/05 ÄÉ²Ã
if ($yyyymm == 201111) {
    $month[1][0]  -= 315000;
    $month[34][0] -= 15000;
    $month[41][0] -= 300000;
}
// 2012/02/03 ÄÉ²Ã
if ($yyyymm == 201201) {
    $month[1][0]  += 105000;
    $month[34][0] += 5000;
    $month[41][0] += 100000;
    // 2012/02/08 ÄÉ²Ã 2012Ç¯1·îÅÙ ¶ÈÌ³°ÑÂ÷Èñ¡ÊÊ¿½Ð²£ÀîÇÉ¸¯ÎÁ¡ËÄ´À°
    $month[28][0] += 1156130;   // Ì¤Ê§¶â
    $month[41][0] -= 1156130;   // ½ãÍø±×
}
// 2012/03/05 ÄÉ²Ã
if ($yyyymm == 201202) {
    $month[1][0]  += 210000;
    $month[34][0] += 10000;
    $month[41][0] += 200000;
    // 2012Ç¯1·îÅÙ ¶ÈÌ³°ÑÂ÷Èñ¡ÊÊ¿½Ð²£ÀîÇÉ¸¯ÎÁ¡ËÄ´À° Ìá¤·
    //$month[28][0] -= 1156130;   // Ì¤Ê§¶â
    //$month[41][0] += 1156130;   // ½ãÍø±×
}
// 2012/04/04 ÄÉ²Ã
if ($yyyymm == 201203) {
    $month[1][0]  += 105000;
    $month[34][0] += 5000;
    $month[41][0] += 100000;
    //$month[1][0]  -= 2562709;
    //$month[34][0] -= 122034;
    //$month[41][0] -= 2440675;
    // 2012/04/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡Ê¸¶ºàÎÁµÚ¤ÓÃùÂ¢ÉÊ¡Ë
    $month[2][0]  += 19777150;  // °µÂ¤¹©¶ñ 19,017,150±ß ÃùÂ¢ÉÊ £³ÅÀ 760,000±ß
    $month[9][0]  -= 19777150;
}
// 2012/04/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
if ($yyyymm >= 201204 && $yyyymm <= 201208) {
    $month[2][0]  += 19777150;
    $month[9][0]  -= 19777150;
}
// 2012/05/07 ÄÉ²Ã
if ($yyyymm == 201204) {
    $month[1][0]  -= 210000;
    $month[34][0] -= 10000;
    $month[41][0] -= 200000;
}
// 2012/06/05 ÄÉ²Ã
if ($yyyymm == 201205) {
    $month[1][0]  += 315000;
    $month[34][0] += 15000;
    $month[41][0] += 300000;
}
// 2012/07/04 ÄÉ²Ã
if ($yyyymm == 201206) {
    $month[1][0]  -= 105000;
    $month[34][0] -= 5000;
    $month[41][0] -= 100000;
}
// 2012/07/11 ÄÉ²Ã
//if ($yyyymm >= 201204 && $yyyymm <= 201303) {
if ($yyyymm >= 201204 && $yyyymm <= 201211) {
    //Á°´üÊ¬
    $month[1][0]  += 105000;
    $month[34][0] += 5000;
    $month[41][0] += 100000;
}
// 2012/08/03 ÄÉ²Ã
if ($yyyymm == 201207) {
    $month[1][0]  -= 2562709;
    $month[34][0] -= 122034;
    $month[41][0] -= 2440675;
    $month[1][0]  -= 105000;
    $month[34][0] -= 5000;
    $month[41][0] -= 100000;
}
// 2012/09/05 ÄÉ²Ã
if ($yyyymm == 201208) {
    $month[1][0]  -= 105000;
    $month[34][0] -= 5000;
    $month[41][0] -= 100000;
}
// 2012/10/04 ÄÉ²Ã
if ($yyyymm == 201209) {
    $month[1][0]  -= 105000;
    $month[34][0] -= 5000;
    $month[41][0] -= 100000;
    $month[1][0]  -= 2562709;
    $month[29][0] -= 122034;
    $month[41][0] -= 2440675;
    //$month[2][0]  += 19615350;  // »ÃÄêÍÑ °µÂ¤¹©¶ñ 19,017,150±ß ÃùÂ¢ÉÊ £²ÅÀ 598,200±ß¡Ê151,200±ß¤È447,000±ß¡Ë
    //$month[9][0]  -= 19615350;  // »ÃÄêÍÑ
    $month[2][0]  += 17516725;    // ³ÎÄê °µÂ¤¹©¶ñ 16,918,525±ß ÃùÂ¢ÉÊ £²ÅÀ 598,200±ß¡Ê151,200±ß¤È447,000±ß¡Ë
    $month[9][0]  -= 17516725;    // ³ÎÄê
}
// 2012/10/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
if ($yyyymm >= 201210 && $yyyymm <= 201302) {
    $month[2][0]  += 17516725;
    $month[9][0]  -= 17516725;
}
// 2012/11/05 ÄÉ²Ã
if ($yyyymm == 201210) {
    $month[1][0]  -= 105000;
    $month[34][0] -= 5000;
    $month[41][0] -= 100000;
    $month[1][0]  -= 2562709;
    $month[29][0] -= 122034;
    $month[41][0] -= 2440675;
}
// 2012/12/05 ÄÉ²Ã
if ($yyyymm == 201211) {
    $month[1][0]  -= 105000;
    $month[34][0] -= 5000;
    $month[41][0] -= 100000;
    $month[1][0]  -= 2562709;
    $month[29][0] -= 122034;
    $month[41][0] -= 2440675;
}
// 2013/01/11 ÄÉ²Ã
if ($yyyymm == 201212) {
    //$month[1][0]  -= 105000;
    //$month[34][0] -= 5000;
    //$month[41][0] -= 100000;
    $month[1][0]  -= 2562709;
    $month[29][0] -= 122034;
    $month[41][0] -= 2440675;
}
// 2013/02/05 ÄÉ²Ã
// ·è»»»þ(³ÎÄê»þ)¤Ë¾ÃÈñÀÇ¤Î¿¶ÂØ½èÍý¤¬¹Ô¤ï¤ì¤¿ºÝ¤Ë
// IF¤Î¾ò·ïÆüÉÕ±¦Â¦¤ò201303¤«¤é201302¤ØÊÑ¹¹¤¹¤ë¤³¤È
if ($yyyymm >= 201301 && $yyyymm <= 201302) {
    //Ì¤Ê§¾ÃÈñÀÇ[29] ²¾¼õ¾ÃÈñÀÇ[34] Ä´À°
    $month[29][0] -= 122034;
    $month[34][0] += 122034;
}
// ·è»»»þ(³ÎÄê»þ)¤ËÅö´ü½ãÍø±×¤¬·«±ÛÍø±×¾êÍ¾¶â¤Ë¿¶¤êÂØ¤¨¤é¤ì¤¿ºÝ¤Ë
// IF¤Î¾ò·ïÆüÉÕ±¦Â¦¤ò201303¤«¤é201302¤ØÊÑ¹¹¤¹¤ë¤³¤È
if ($yyyymm >= 201204 && $yyyymm <= 201302) {
    //·«±ÛÍø±×¾êÍ¾¶â[40] Åö´ü½ãÍø±×[41] Ä´À°
    $month[41][0] -= 100000;
    $month[40][0] += 100000;
}
// 2013/03/05 ÄÉ²Ã
if ($yyyymm == 201302) {
    $month[1][0]  -= 5794530;
    $month[34][0] -= 275930;
    $month[41][0] -= 5518600;
}
// 2013/03/05 ÄÉ²Ã
if ($yyyymm == 201303) {
    //$month[1][0]  += 5794530;
    //$month[34][0] += 275930;
    //$month[41][0] += 5518600;
    //$month[2][0]  += 17516725;  // »ÃÄêÍÑ °µÂ¤¹©¶ñ 16,918,525±ß ÃùÂ¢ÉÊ £²ÅÀ 598,200±ß¡Ê151,200±ß¤È447,000±ß¡Ë
    //$month[9][0]  -= 17516725;  // »ÃÄêÍÑ
    $month[2][0]  += 18517075;    // ³ÎÄê °µÂ¤¹©¶ñ 17,918,875±ß ÃùÂ¢ÉÊ £²ÅÀ 598,200±ß¡Ê151,200±ß¤È447,000±ß¡Ë
    $month[9][0]  -= 18517075;    // ³ÎÄê
}
// 2013/04/08 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
if ($yyyymm >= 201304 && $yyyymm <= 201304) {
    $month[2][0]  += 18517075;  // ³ÎÄê °µÂ¤¹©¶ñ 17,918,875±ß ÃùÂ¢ÉÊ £²ÅÀ 598,200±ß¡Ê151,200±ß¤È447,000±ß¡Ë
    $month[9][0]  -= 18517075;  // ³ÎÄê
}
// 2013/05/28 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡ËÃùÂ¢ÉÊ£±ÅÀÄÉ²Ã(¥ä¥Þ¥ÏÃ±¼´¥í¥Ü¥Ã¥È 336,600±ß)
if ($yyyymm >= 201305 && $yyyymm <= 201308) {
    $month[2][0]  += 18853675;  // ³ÎÄê °µÂ¤¹©¶ñ 17,918,875±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $month[9][0]  -= 18853675;  // ³ÎÄê
}
// 2013/10/03 ÄÉ²Ã
if ($yyyymm == 201309) {
    //$month[2][0]  += 18853675;    // »ÃÄêÍÑ °µÂ¤¹©¶ñ 17,918,875±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    //$month[9][0]  -= 18853675;    // »ÃÄêÍÑ
    $month[2][0]  += 19326300;    // ³ÎÄê °µÂ¤¹©¶ñ 18,391,500±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $month[9][0]  -= 19326300;    // ³ÎÄê
    //Ì¤Ê§¾ÃÈñÀÇ[29] ¤ò Ì¤¼ý¾ÃÈñÀÇÅù¤Ø¿¶ÂØ Ì¤Ê§ 5,269,700 ¢ª 0 Ì¤¼ý 9,622,964-5,269,700=4,353,264
    $month[29][0] -= 5269700;
    $month[42][0] -= 5269700;
}
// 2013/10/08 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
if ($yyyymm >= 201310 && $yyyymm <= 201402) {
    $month[2][0]  += 19326300;    // ³ÎÄê °µÂ¤¹©¶ñ 18,391,500±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $month[9][0]  -= 19326300;    // ³ÎÄê
}
// 2013/11/06 ÄÉ²Ã
if ($yyyymm == 201310) {
    $month[1][0]  += 105000;
    $month[34][0] += 5000;
    $month[41][0] += 100000;
}
// 2014/01/10 ÄÉ²Ã
if ($yyyymm == 201312) {
    $month[1][0]  += 105000;
    $month[34][0] += 5000;
    $month[41][0] += 100000;
}
// 2014/02/05 ÄÉ²Ã
if ($yyyymm == 201401) {
    $month[1][0]  += 525000;
    $month[34][0] += 25000;
    $month[41][0] += 500000;
}
// 2014/03/05 ÄÉ²Ã
if ($yyyymm == 201402) {
    $month[1][0]  += 315000;
    $month[34][0] += 15000;
    $month[41][0] += 300000;
}
// 2014/04/03 ÄÉ²Ã
if ($yyyymm == 201403) {
    //$month[2][0]  += 19326300;    // »ÃÄêÍÑ °µÂ¤¹©¶ñ 18,391,500±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    //$month[9][0]  -= 19326300;    // »ÃÄêÍÑ
    
    // Ä¾ÀÜ¾¦´É¤ÎÄ´À°¤òAS¤ËÆþÎÏ¤¹¤ë¤è¤¦¤Ë¤Ê¤Ã¤¿°Ù¡¢Ä´À°¤ò²ò½ü
    //$month[1][0]  -= 105000;
    //$month[34][0] -= 5000;
    //$month[41][0] -= 100000;
    // ´üËö¤Î¾ÃÈñÀÇ¿¶ÂØ¤Ë¤è¤ê¡¢²¾¼õ¾ÃÈñÀÇ[34] ¤Î-5,000±ß¤¬Ì¤¼ý¾ÃÈñÀÇ¤Ë°Ü¤ë°Ù Î¾Êý¤Ë+5,000±ß¤ò¹Ô¤¦
    //$month[34][0] += 5000;
    //$month[42][0] += 5000;
    // ¤³¤³¤Þ¤Ç
    
    $month[2][0]  += 21957050;    // ³ÎÄê °µÂ¤¹©¶ñ 21,022,250±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $month[9][0]  -= 21957050;    // ³ÎÄê
}

// 2014/06/12 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($yyyymm >= 201404 && $yyyymm <= 201408) {
    $month[2][0]  += 21957050;    // ³ÎÄê °µÂ¤¹©¶ñ 21,022,250±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $month[9][0]  -= 21957050;    // ³ÎÄê
}

// 2014/06/04 ÄÉ²Ã
if ($yyyymm == 201405) {
    $month[1][0]  -= 540000;
    $month[34][0] -= 40000;
    $month[41][0] -= 500000;
}
// 2014/10/06 ÄÉ²Ã
if ($yyyymm == 201409) {
    //$month[2][0]  += 21957050;    // »ÃÄêÍÑ °µÂ¤¹©¶ñ 21,022,250±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    ///$month[9][0]  -= 21957050;    // »ÃÄêÍÑ
    
    $month[2][0]  += 21647825;    // ³ÎÄê °µÂ¤¹©¶ñ 20,713,025±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $month[9][0]  -= 21647825;    // ³ÎÄê
}
// 2014/10/06 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($yyyymm >= 201410 && $yyyymm <= 201502) {
    $month[2][0]  += 21647825;    // ³ÎÄê °µÂ¤¹©¶ñ 20,713,025±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $month[9][0]  -= 21647825;    // ³ÎÄê
}
// 2015/04/07 ÄÉ²Ã
if ($yyyymm == 201503) {
    //$month[2][0]  += 21647825;    // »ÃÄê °µÂ¤¹©¶ñ 20,713,025±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    //$month[9][0]  -= 21647825;    // »ÃÄê
    
    $month[2][0]  += 22512650;    // ³ÎÄê °µÂ¤¹©¶ñ 21,577,850±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $month[9][0]  -= 22512650;    // ³ÎÄê
}
// 2015/04/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($yyyymm >= 201504 && $yyyymm <= 201508) {
    $month[2][0]  += 22512650;    // ³ÎÄê °µÂ¤¹©¶ñ 21,577,850±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $month[9][0]  -= 22512650;    // ³ÎÄê
}
// 2015/05/08 ÄÉ²Ã
if ($yyyymm == 201504) {
    $month[1][0]  -= 215000;
    $month[34][0] -= 15000;
    $month[41][0] -= 200000;
}
// 2015/09/04 ÄÉ²Ã
if ($yyyymm == 201508) {
    $month[1][0]  += 209488;
    $month[34][0] += 15518;
    $month[41][0] += 193970;
}
// 2015/10/07 ÄÉ²Ã
if ($yyyymm == 201509) {
    //$month[2][0]  += 22512650;    // »ÃÄê °µÂ¤¹©¶ñ 21,577,850±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    //$month[9][0]  -= 22512650;    // »ÃÄê
    
    $month[2][0]  += 21948500;    // ³ÎÄê °µÂ¤¹©¶ñ 21,013,700±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $month[9][0]  -= 21948500;    // ³ÎÄê
}
// 2015/10/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($yyyymm >= 201510 && $yyyymm <= 201602) {
    //$month[2][0]  += 21948500;    // ³ÎÄê °µÂ¤¹©¶ñ 21,013,700±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    //$month[9][0]  -= 21948500;    // ³ÎÄê
    // 20151021¤Ë¥ä¥Þ¥ÏÃ±¼´¥í¥Ü¥Ã¥ÈÃùÂ¢ÉÊ»ÈÍÑ¡Ê336,600±ß¡Ë¢ª ÃùÂ¢ÉÊ¤È¤·¤ÆÃ±¼´¥í¥Ü¥Ã¥ÈºÆ¹ØÆþ¡Ê416,700±ß¡Ë
    $month[2][0]  += 22028600;    // ³ÎÄê °µÂ¤¹©¶ñ 21,013,700±ß ÃùÂ¢ÉÊ £³ÅÀ 1,014,900,800±ß¡Ê151,200±ß¤È447,000±ß¤È416,700±ß¡Ë
    $month[9][0]  -= 22028600;    // ³ÎÄê
}
// 2016/04/07 ÄÉ²Ã
if ($yyyymm == 201603) {
    //$month[2][0]  += 21948500;    // »ÃÄê °µÂ¤¹©¶ñ 21,013,700±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    //$month[9][0]  -= 21948500;    // »ÃÄê
    
    $month[2][0]  += 22443100;    // ³ÎÄê °µÂ¤¹©¶ñ 21,508,300±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $month[9][0]  -= 22443100;    // ³ÎÄê
}
// 2016/04/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($yyyymm >= 201604 && $yyyymm <= 201608) {
    $month[2][0]  += 22443100;    // ³ÎÄê °µÂ¤¹©¶ñ 21,508,300±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $month[9][0]  -= 22443100;    // ³ÎÄê
}
// 2016/05/09 ÄÉ²Ã
if ($yyyymm == 201604) {
    $month[1][0]  -= 600000;
    //$month[34][0] -= 48000;
    $month[41][0] -= 600000;
}
// 2016/10/05 ÄÉ²Ã
if ($yyyymm == 201609) {
    //$month[2][0]  += 22443100;    // »ÃÄê °µÂ¤¹©¶ñ 21,508,300±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    //$month[9][0]  -= 22443100;    // »ÃÄê
    
    $month[2][0]  += 27994100;    // ³ÎÄê °µÂ¤¹©¶ñ 26,979,200±ß ÃùÂ¢ÉÊ £³ÅÀ 1,014,800±ß¡Ê151,200±ß¤È447,000±ß¤È416,700±ß¡Ë
    $month[9][0]  -= 27994100;    // ³ÎÄê
}
// 2016/10/06 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($yyyymm >= 201610 && $yyyymm <= 201610) {
    $month[2][0]  += 27994100;    // ³ÎÄê °µÂ¤¹©¶ñ 26,979,200±ß ÃùÂ¢ÉÊ £³ÅÀ 1,014,800±ß¡Ê151,200±ß¤È447,000±ß¤È416,700±ß¡Ë
    $month[9][0]  -= 27994100;    // ³ÎÄê
}
// 2016/11/29 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡Ê11·î¤è¤êAC¥µ¡¼¥Ü¥â¡¼¥¿¡¼Ê¬ 66,500±ßÄÉ²Ã¡Ë
if ($yyyymm >= 201611 && $yyyymm <= 201611) {
    $month[2][0]  += 28060500;    // ³ÎÄê °µÂ¤¹©¶ñ 26,979,200±ß ÃùÂ¢ÉÊ £´ÅÀ 1,081,300±ß¡Ê151,200±ß¤È447,000±ß¤È416,700±ß¤È66,500±ß¡Ë
    $month[9][0]  -= 28060500;    // ³ÎÄê
}
// 2016/12/21 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡Ê12·î¤è¤êAC¥µ¡¼¥Ü¥â¡¼¥¿¡¼Ê¬ 58,000±ßÄÉ²Ã¡Ë
if ($yyyymm >= 201612 && $yyyymm <= 201701) {
    $month[2][0]  += 28118600;    // ³ÎÄê °µÂ¤¹©¶ñ 26,979,200±ß ÃùÂ¢ÉÊ £µÅÀ 1,139,400±ß¡Ê151,200±ß¤È447,000±ß¤È416,700±ß¤È66,500±ß¤È58,000±ß¡Ë
    $month[9][0]  -= 28118600;    // ³ÎÄê
}
// 2017/03/03 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡Ê2·î¤Ë¥ä¥Þ¥ÏÃ±¼´¥í¥Ü¥Ã¥È 416,700±ß»ÈÍÑ¡Ë
if ($yyyymm >= 201702 && $yyyymm <= 201702) {
    $month[2][0]  += 27701900;    // ³ÎÄê °µÂ¤¹©¶ñ 26,979,200±ß ÃùÂ¢ÉÊ £´ÅÀ 722,700±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¡Ë
    $month[9][0]  -= 27701900;    // ³ÎÄê
}
// 2017/04/07 ÄÉ²Ã
if ($yyyymm == 201703) {
    //$month[2][0]  += 27701900;    // »ÃÄê °µÂ¤¹©¶ñ 26,979,200±ß ÃùÂ¢ÉÊ £´ÅÀ 722,700±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¡Ë
    //$month[9][0]  -= 27701900;    // »ÃÄê
    
    $month[2][0]  += 27170800;    // ³ÎÄê °µÂ¤¹©¶ñ 26,448,100±ß ÃùÂ¢ÉÊ £´ÅÀ 722,700±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¡Ë
    $month[9][0]  -= 27170800;    // ³ÎÄê
}
// 2017/04/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($yyyymm >= 201704 && $yyyymm <= 201708) {
    $month[2][0]  += 27170800;    // ³ÎÄê °µÂ¤¹©¶ñ 26,448,100±ß ÃùÂ¢ÉÊ £´ÅÀ 722,700±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¡Ë
    $month[9][0]  -= 27170800;    // ³ÎÄê
}
// 2017/10/04 ÄÉ²Ã
if ($yyyymm == 201709) {
    //$month[2][0]  += 27170800;    // »ÃÄê °µÂ¤¹©¶ñ 26,448,100±ß ÃùÂ¢ÉÊ £´ÅÀ 722,700±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¡Ë
    //$month[9][0]  -= 27170800;    // »ÃÄê
    
    $month[2][0]  += 31331800;    // ³ÎÄê °µÂ¤¹©¶ñ 30,609,100±ß ÃùÂ¢ÉÊ £´ÅÀ 722,700±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¡Ë
    $month[9][0]  -= 31331800;    // ³ÎÄê
}
// 2017/10/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($yyyymm >= 201710 && $yyyymm <= 201802) {
    $month[2][0]  += 31331800;    // ³ÎÄê °µÂ¤¹©¶ñ 30,609,100±ß ÃùÂ¢ÉÊ £´ÅÀ 722,700±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¡Ë
    $month[9][0]  -= 31331800;    // ³ÎÄê
}
// 2018/03/29 ÄÉ²Ã
if ($yyyymm == 201803) {
    //$month[2][0]  += 31809300;    // »ÃÄê °µÂ¤¹©¶ñ 30,609,100±ß ÃùÂ¢ÉÊ £µÅÀ 1,200,200±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¤È477,500±ß¡Ë
    //$month[9][0]  -= 31809300;    // »ÃÄê
    
    $month[2][0]  += 30723300;    // ³ÎÄê °µÂ¤¹©¶ñ 29,523,100±ß ÃùÂ¢ÉÊ £µÅÀ 1,200,200±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¤È477,500±ß¡Ë
    $month[9][0]  -= 30723300;    // ³ÎÄê
}
// 2018/07/05 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($yyyymm >= 201804 && $yyyymm <= 201807) {
    $month[2][0]  += 30723300;    // ³ÎÄê °µÂ¤¹©¶ñ 29,523,100±ß ÃùÂ¢ÉÊ £µÅÀ 1,200,200±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¤È477,500±ß¡Ë
    $month[9][0]  -= 30723300;    // ³ÎÄê
}
// 2018/09/05 ÄÉ²Ã ÃùÂ¢ÉÊ¥·¥ó¥¯¥í¥¿¥Ã¥ÑÄÉ²Ã 348,000±ß
if ($yyyymm == 201808) {
    $month[2][0]  += 31071300;    // ³ÎÄê °µÂ¤¹©¶ñ 29,523,100±ß ÃùÂ¢ÉÊ £µÅÀ 1,548,200±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¡Ë
    $month[9][0]  -= 31071300;    // ³ÎÄê
}
// 2018/10/04 ÄÉ²Ã
if ($yyyymm == 201809) {
    //$month[2][0]  += 31071300;    // »ÃÄê °µÂ¤¹©¶ñ 29,523,100±ß ÃùÂ¢ÉÊ £µÅÀ 1,548,200±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¡Ë
    //$month[9][0]  -= 31071300;    // »ÃÄê
    
    $month[2][0]  += 31076300;    // ³ÎÄê °µÂ¤¹©¶ñ 29,528,100±ß ÃùÂ¢ÉÊ £µÅÀ 1,548,200±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¡Ë
    $month[9][0]  -= 31076300;    // ³ÎÄê
}
// 2018/10/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($yyyymm >= 201810 && $yyyymm <= 201902) {
    $month[2][0]  += 31076300;    // ³ÎÄê °µÂ¤¹©¶ñ 29,528,100±ß ÃùÂ¢ÉÊ £µÅÀ 1,548,200±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¡Ë
    $month[9][0]  -= 31076300;    // ³ÎÄê
}
// 2019/04/05 ÄÉ²Ã
if ($yyyymm == 201903) {
    //$month[2][0]  += 31208800;    // »ÃÄê °µÂ¤¹©¶ñ 29,528,100±ß ÃùÂ¢ÉÊ £±£°ÅÀ 1,680,700±ß¡Ê151,200±ß¤È447,000±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¡Ë
    //$month[9][0]  -= 31208800;    // »ÃÄê
    
    $month[2][0]  += 29013600;    // ³ÎÄê °µÂ¤¹©¶ñ 27,332,900±ß ÃùÂ¢ÉÊ £±£°ÅÀ 1,680,700±ß¡Ê151,200±ß¤È447,000±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¡Ë
    $month[9][0]  -= 29013600;    // ³ÎÄê
}
// 2019/04/08 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($yyyymm >= 201904 && $yyyymm <= 201908) {
    $month[2][0]  += 29013600;    // ³ÎÄê °µÂ¤¹©¶ñ 27,332,900±ß ÃùÂ¢ÉÊ £±£°ÅÀ 1,680,700±ß¡Ê151,200±ß¤È447,000±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¡Ë
    $month[9][0]  -= 29013600;    // ³ÎÄê
}
// 2019/10/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($yyyymm >= 201909 && $yyyymm <= 202002) {
    $month[2][0]  += 30711100;    // ³ÎÄê °µÂ¤¹©¶ñ 29,030,400±ß ÃùÂ¢ÉÊ £±£°ÅÀ 1,680,700±ß¡Ê151,200±ß¤È447,000±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¡Ë
    $month[9][0]  -= 30711100;    // ³ÎÄê
}
// 2019/04/05 ÄÉ²Ã
if ($yyyymm == 202003) {
    //$month[2][0]  += 30653100;    // »ÃÄê °µÂ¤¹©¶ñ 29,030,400±ß ÃùÂ¢ÉÊ £¹ÅÀ 1,622,700±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¡Ë
    //$month[9][0]  -= 30653100;    // »ÃÄê
    
    $month[2][0]  += 31847700;    // ³ÎÄê °µÂ¤¹©¶ñ 30,225,000±ß ÃùÂ¢ÉÊ £¹ÅÀ 1,622,700±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¡Ë
    $month[9][0]  -= 31847700;    // ³ÎÄê
}
// 2020/04/06 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($yyyymm >= 202004 && $yyyymm <= 202005) {
    $month[2][0]  += 31847700;    // ³ÎÄê °µÂ¤¹©¶ñ 30,225,000±ß ÃùÂ¢ÉÊ £¹ÅÀ 1,622,700±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¡Ë
    $month[9][0]  -= 31847700;    // ³ÎÄê
}
// 2020/07/08 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($yyyymm >= 202006 && $yyyymm <= 202008) {
    $month[2][0]  += 34437700;    // ³ÎÄê °µÂ¤¹©¶ñ 30,225,000±ß ÃùÂ¢ÉÊ £¹ÅÀ 4,212,700±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¤È2,590,000±ß¡Ë
    $month[9][0]  -= 34437700;    // ³ÎÄê
}
// 2020/10/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($yyyymm >= 202009 && $yyyymm <= 202102) {
    $month[2][0]  += 35225500;    // ³ÎÄê °µÂ¤¹©¶ñ 31,012,800±ß ÃùÂ¢ÉÊ £¹ÅÀ 4,212,700±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¤È2,590,000±ß¡Ë
    $month[9][0]  -= 35225500;    // ³ÎÄê
}
// 2021/04/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($yyyymm >= 202103 && $yyyymm <= 202105) {
    $month[2][0]  += 34201500;    // ³ÎÄê °µÂ¤¹©¶ñ 29,988,800±ß ÃùÂ¢ÉÊ £¹ÅÀ 4,212,700±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¤È2,590,000±ß¡Ë
    $month[9][0]  -= 34201500;    // ³ÎÄê
}
// 2021/07/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($yyyymm >= 202106 && $yyyymm <= 202108) {
    $month[2][0]  += 34390591;    // ³ÎÄê °µÂ¤¹©¶ñ 29,988,800±ß ÃùÂ¢ÉÊ £¹ÅÀ 4,401,791±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¤È2,590,000±ß¤È189,091±ß¡Ë
    $month[9][0]  -= 34390591;    // ³ÎÄê
}
// 2021/10/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($yyyymm >= 202109 && $yyyymm <= 202202) {
    $month[2][0]  += 35918291;    // ³ÎÄê °µÂ¤¹©¶ñ 31,516,500±ß ÃùÂ¢ÉÊ £¹ÅÀ 4,401,791±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¤È2,590,000±ß¤È189,091±ß¡Ë
    $month[9][0]  -= 35918291;    // ³ÎÄê
}
///// ¤½¤ÎÂ¾¤Î²ÊÌÜ¤Ë¶â³Û¤¬¤¢¤ë¤«¤É¤¦¤«¥Á¥§¥Ã¥¯
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and actcod=9999 and pl_bs_ym=%d order by t_row ASC", $yyyymm);
getUniResult($query, $other);
if ($other !=0) {
    $fother = number_format($other);
    $_SESSION['s_sysmsg'] .= sprintf("¤½¤ÎÂ¾¤Î²ÊÌÜ¤Ë¶â³Û¤¬¤¢¤ê¤Þ¤¹<br>Âè %d´ü %d·î ¶â³Û=%s",$ki,$tuki, $fother);
}

    ///// Åö·î¤Î²¾¼õ¶â¥Á¥§¥Ã¥¯
$month_kari = array();
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d and t_row=44 order by t_row ASC", $yyyymm);
if ((getResult2($query, $month_kari)) > 0) {
    $month[32][0] += $month_kari[0][0];         // ¤½¤ÎÂ¾Î®Æ°ÉéºÄ¤Ë²Ã»»
}
    ///// Åö·î¤Î»ÜÀßÍøÍÑ¸¢¥Á¥§¥Ã¥¯F45(2440)
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d and t_row=45 order by t_row ASC", $yyyymm);
if ((getUniResult($query, $month_sisetu)) <= 0) {
    $month_sisetu = 0;
}
    ///// Åö·î¤ÎÌ¤¼ýË¡¿ÍÀÇÅù¥Á¥§¥Ã¥¯F46(1475) ¾¦Ë¡²ÊÌÜ¤Ç¤¢¤ë¤³¤È¤ËÃí°Õ ¼ÒÆâ²ÊÌÜ¤Ï1518 2005/04/14
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d and t_row=46 order by t_row ASC", $yyyymm);
if ((getUniResult($query, $month_mihojin)) <= 0) {
    $month_mihojin = 0;
}

///////// Á°·î
$pmonth = array();
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d order by t_row ASC", $p1_ym);
$prows = getResult2($query, $pmonth);
// 2010/10/06 ÄÉ²Ã
if ($p1_ym == 201009) {
    $pmonth[1][0]  += 6562097;
    $pmonth[29][0] += 312481;
    $pmonth[41][0] += 6249616;
}
// 2010/11/05 ÄÉ²Ã
if ($p1_ym == 201010) {
    $pmonth[1][0]  += 6562097;
    $pmonth[29][0] += 312481;
    $pmonth[41][0] += 6249616;
    $pmonth[1][0]  += 796423;
    $pmonth[34][0] += 37925;
    $pmonth[41][0] += 758498;
}
// 2010/12/03 ÄÉ²Ã
if (($p1_ym >= 201011) && ($p1_ym <= 201103)) {
    $pmonth[1][0]  += 6562097;
    $pmonth[29][0] += 312481;
    $pmonth[41][0] += 6249616;
    $pmonth[1][0]  += 796423;
    $pmonth[34][0] += 37925;
    $pmonth[41][0] += 758498;
    $pmonth[1][0]  += 1817925;
    $pmonth[34][0] += 86568;
    $pmonth[41][0] += 1731357;
}
// 2011/04/06 ÄÉ²Ã
if ($p1_ym == 201103) {
    $pmonth[1][0]  -= 6562097;
    $pmonth[29][0] -= 312481;
    $pmonth[41][0] -= 6249616;
    $pmonth[1][0]  -= 796423;
    $pmonth[34][0] -= 37925;
    $pmonth[41][0] -= 758498;
    $pmonth[1][0]  -= 1817925;
    $pmonth[34][0] -= 86568;
    $pmonth[41][0] -= 1731357;
    // 2011/04/20 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡Ê¸¶ºàÎÁµÚ¤ÓÃùÂ¢ÉÊ¡Ë
    $pmonth[2][0]  += 15278200;
    $pmonth[9][0]  -= 15278200;
}
// 2011/10/18 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
if ($p1_ym >= 201104 && $p1_ym <= 201108) {
    $pmonth[2][0]  += 15278200;
    $pmonth[9][0]  -= 15278200;
}
// 2011/07/06 ÄÉ²Ã
if ($p1_ym == 201106) {
    $pmonth[1][0]  += 315000;
    $pmonth[34][0] += 15000;
    $pmonth[41][0] += 300000;
}
// 2011/08/03 ÄÉ²Ã
if ($p1_ym == 201107) {
    $pmonth[1][0]  -= 105000;
    $pmonth[34][0] -= 5000;
    $pmonth[41][0] -= 100000;
}
// 2011/09/05 ÄÉ²Ã
if ($p1_ym == 201108) {
    $pmonth[1][0]  -= 105000;
    $pmonth[34][0] -= 5000;
    $pmonth[41][0] -= 100000;
}
// 2011/10/05 ÄÉ²Ã
if ($p1_ym == 201109) {
    $pmonth[1][0]  += 210000;
    $pmonth[34][0] += 10000;
    $pmonth[41][0] += 200000;
    // 2011/10/18 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
    $pmonth[2][0]  += 20205550;
    $pmonth[9][0]  -= 20205550;
}
// 2012/04/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
if ($p1_ym == 201110) {
    $pmonth[2][0]  += 20205550;
    $pmonth[9][0]  -= 20205550;
}
// 2012/04/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
if ($p1_ym >= 201111 && $p1_ym <= 201112) {
    $pmonth[2][0]  += 20331550;
    $pmonth[9][0]  -= 20331550;
}
// 2012/04/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
if ($p1_ym >= 201201 && $p1_ym <= 201202) {
    $pmonth[2][0]  += 20518550;
    $pmonth[9][0]  -= 20518550;
}
// 2011/11/04 ÄÉ²Ã
if ($p1_ym == 201110) {
    $pmonth[1][0]  += 315000;
    $pmonth[34][0] += 15000;
    $pmonth[41][0] += 300000;
}
// 2011/12/05 ÄÉ²Ã
if ($p1_ym == 201111) {
    $pmonth[1][0]  -= 315000;
    $pmonth[34][0] -= 15000;
    $pmonth[41][0] -= 300000;
}
// 2012/02/03 ÄÉ²Ã
if ($p1_ym == 201201) {
    $pmonth[1][0]  += 105000;
    $pmonth[34][0] += 5000;
    $pmonth[41][0] += 100000;
    // 2012/02/08 ÄÉ²Ã 2012Ç¯1·îÅÙ ¶ÈÌ³°ÑÂ÷Èñ¡ÊÊ¿½Ð²£ÀîÇÉ¸¯ÎÁ¡ËÄ´À°
    $pmonth[28][0] += 1156130;   // Ì¤Ê§¶â
    $pmonth[41][0] -= 1156130;   // ½ãÍø±×
}
// 2012/02/03 ÄÉ²Ã
if ($p1_ym == 201202) {
    $pmonth[1][0]  += 210000;
    $pmonth[34][0] += 10000;
    $pmonth[41][0] += 200000;
    // 2012Ç¯1·îÅÙ ¶ÈÌ³°ÑÂ÷Èñ¡ÊÊ¿½Ð²£ÀîÇÉ¸¯ÎÁ¡ËÄ´À° Ìá¤·
    //$pmonth[28][0] -= 1156130;   // Ì¤Ê§¶â
    //$pmonth[41][0] += 1156130;   // ½ãÍø±×
}
// 2012/04/04 ÄÉ²Ã
if ($p1_ym == 201203) {
    $pmonth[1][0]  += 105000;
    $pmonth[34][0] += 5000;
    $pmonth[41][0] += 100000;
    //$pmonth[1][0]  -= 2562709;
    //$pmonth[34][0] -= 122034;
    //$pmonth[41][0] -= 2440675;
    // 2012/04/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡Ê¸¶ºàÎÁµÚ¤ÓÃùÂ¢ÉÊ¡Ë
    $pmonth[2][0]  += 19777150;
    $pmonth[9][0]  -= 19777150;
}
// 2012/04/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
if ($p1_ym >= 201204 && $p1_ym <= 201208) {
    $pmonth[2][0]  += 19777150;
    $pmonth[9][0]  -= 19777150;
}
// 2012/05/07 ÄÉ²Ã
if ($p1_ym == 201204) {
    $pmonth[1][0]  -= 210000;
    $pmonth[34][0] -= 10000;
    $pmonth[41][0] -= 200000;
}
// 2012/06/05 ÄÉ²Ã
if ($p1_ym == 201205) {
    $pmonth[1][0]  += 315000;
    $pmonth[34][0] += 15000;
    $pmonth[41][0] += 300000;
}
// 2012/07/04 ÄÉ²Ã
if ($p1_ym == 201206) {
    $pmonth[1][0]  -= 105000;
    $pmonth[34][0] -= 5000;
    $pmonth[41][0] -= 100000;
}
// 2012/07/11 ÄÉ²Ã
if ($p1_ym >= 201204 && $p1_ym <= 201211) {
    //Á°´üÊ¬
    $pmonth[1][0]  += 105000;
    $pmonth[34][0] += 5000;
    $pmonth[41][0] += 100000;
}
// 2012/08/03 ÄÉ²Ã
if ($p1_ym == 201207) {
    $pmonth[1][0]  -= 2562709;
    $pmonth[34][0] -= 122034;
    $pmonth[41][0] -= 2440675;
    $pmonth[1][0]  -= 105000;
    $pmonth[34][0] -= 5000;
    $pmonth[41][0] -= 100000;
}
// 2012/09/05 ÄÉ²Ã
if ($p1_ym == 201208) {
    $pmonth[1][0]  -= 105000;
    $pmonth[34][0] -= 5000;
    $pmonth[41][0] -= 100000;
}

// 2012/10/04 ÄÉ²Ã
if ($p1_ym == 201209) {
    $pmonth[1][0]  -= 105000;
    $pmonth[34][0] -= 5000;
    $pmonth[41][0] -= 100000;
    $pmonth[1][0]  -= 2562709;
    $pmonth[29][0] -= 122034;
    $pmonth[41][0] -= 2440675;
    //$pmonth[2][0]  += 19615350;  // »ÃÄêÍÑ °µÂ¤¹©¶ñ 19,017,150±ß ÃùÂ¢ÉÊ £²ÅÀ 598,200±ß¡Ê151,200±ß¤È447,000±ß¡Ë
    //$pmonth[9][0]  -= 19615350;  // »ÃÄêÍÑ
    $pmonth[2][0]  += 17516725;    // ³ÎÄê °µÂ¤¹©¶ñ 16,918,525±ß ÃùÂ¢ÉÊ £²ÅÀ 598,200±ß¡Ê151,200±ß¤È447,000±ß¡Ë
    $pmonth[9][0]  -= 17516725;    // ³ÎÄê
}
// 2012/10/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
if ($p1_ym >= 201210 && $p1_ym <= 201302) {
    $pmonth[2][0]  += 17516725;
    $pmonth[9][0]  -= 17516725;
}
// 2012/11/05 ÄÉ²Ã
if ($p1_ym == 201210) {
    $pmonth[1][0]  -= 105000;
    $pmonth[34][0] -= 5000;
    $pmonth[41][0] -= 100000;
    $pmonth[1][0]  -= 2562709;
    $pmonth[29][0] -= 122034;
    $pmonth[41][0] -= 2440675;
}
// 2012/12/05 ÄÉ²Ã
if ($p1_ym == 201211) {
    $pmonth[1][0]  -= 105000;
    $pmonth[34][0] -= 5000;
    $pmonth[41][0] -= 100000;
    $pmonth[1][0]  -= 2562709;
    $pmonth[29][0] -= 122034;
    $pmonth[41][0] -= 2440675;
}
// 2013/01/11 ÄÉ²Ã
if ($p1_ym == 201212) {
    //$pmonth[1][0]  -= 105000;
    //$pmonth[34][0] -= 5000;
    //$pmonth[41][0] -= 100000;
    $pmonth[1][0]  -= 2562709;
    $pmonth[29][0] -= 122034;
    $pmonth[41][0] -= 2440675;
}
// 2013/02/05 ÄÉ²Ã
// ·è»»»þ(³ÎÄê»þ)¤Ë¾ÃÈñÀÇ¤Î¿¶ÂØ½èÍý¤¬¹Ô¤ï¤ì¤¿ºÝ¤Ë
// IF¤Î¾ò·ïÆüÉÕ±¦Â¦¤ò201303¤«¤é201302¤ØÊÑ¹¹¤¹¤ë¤³¤È
if ($p1_ym >= 201301 && $p1_ym <= 201302) {
    //Ì¤Ê§¾ÃÈñÀÇ[29] ²¾¼õ¾ÃÈñÀÇ[34] Ä´À°
    $pmonth[29][0] -= 122034;
    $pmonth[34][0] += 122034;
}
// ·è»»»þ(³ÎÄê»þ)¤ËÅö´ü½ãÍø±×¤¬·«±ÛÍø±×¾êÍ¾¶â¤Ë¿¶¤êÊÖ¤é¤ì¤¿ºÝ¤Ë
// IF¤Î¾ò·ïÆüÉÕ±¦Â¦¤ò201303¤«¤é201302¤ØÊÑ¹¹¤¹¤ë¤³¤È
if ($p1_ym >= 201204 && $p1_ym <= 201302) {
    //·«±ÛÍø±×¾êÍ¾¶â[40] Åö´ü½ãÍø±×[41] Ä´À°
    $pmonth[41][0] -= 100000;
    $pmonth[40][0] += 100000;
}
// 2013/03/05 ÄÉ²Ã
if ($p1_ym == 201302) {
    $pmonth[1][0]  -= 5794530;
    $pmonth[34][0] -= 275930;
    $pmonth[41][0] -= 5518600;
}
// 2013/03/05 ÄÉ²Ã
if ($p1_ym == 201303) {
    //$pmonth[1][0]  += 5794530;
    //$pmonth[34][0] += 275930;
    //$pmonth[41][0] += 5518600;
    //$pmonth[2][0]  += 17516725;  // »ÃÄêÍÑ °µÂ¤¹©¶ñ 16,918,525±ß ÃùÂ¢ÉÊ £²ÅÀ 598,200±ß¡Ê151,200±ß¤È447,000±ß¡Ë
    //$pmonth[9][0]  -= 17516725;  // »ÃÄêÍÑ
    $pmonth[2][0]  += 18517075;    // ³ÎÄê °µÂ¤¹©¶ñ 17,918,875±ß ÃùÂ¢ÉÊ £²ÅÀ 598,200±ß¡Ê151,200±ß¤È447,000±ß¡Ë
    $pmonth[9][0]  -= 18517075;    // ³ÎÄê
}
// 2013/04/08 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
if ($p1_ym >= 201304 && $p1_ym <= 201304) {
    $pmonth[2][0]  += 18517075; // ³ÎÄê °µÂ¤¹©¶ñ 17,918,875±ß ÃùÂ¢ÉÊ £²ÅÀ 598,200±ß¡Ê151,200±ß¤È447,000±ß¡Ë
    $pmonth[9][0]  -= 18517075; // ³ÎÄê
}
// 2013/05/28 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡ËÃùÂ¢ÉÊ£±ÅÀÄÉ²Ã(¥ä¥Þ¥ÏÃ±¼´¥í¥Ü¥Ã¥È 336,600±ß)
if ($p1_ym >= 201305 && $p1_ym <= 201308) {
    $pmonth[2][0]  += 18853675;  // ³ÎÄê °µÂ¤¹©¶ñ 17,918,875±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $pmonth[9][0]  -= 18853675;  // ³ÎÄê
}
// 2013/10/10 ÄÉ²Ã Ì¤Ê§¾ÃÈñÀÇ[29] ¤ò Ì¤¼ý¾ÃÈñÀÇÅù¤Ø¿¶ÂØ Ì¤Ê§ 5,269,700 ¢ª 0 Ì¤¼ý 9,622,964-5,269,700=4,353,264
if ($p1_ym == 201309) {
    $pmonth[29][0] -= 5269700;
    $pmonth[42][0] -= 5269700;
}
// 2013/10/08 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
if ($p1_ym >= 201309 && $p1_ym <= 201402) {
    $pmonth[2][0]  += 19326300;    // ³ÎÄê °µÂ¤¹©¶ñ 18,391,500±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $pmonth[9][0]  -= 19326300;    // ³ÎÄê
}
// 2013/11/06 ÄÉ²Ã
if ($p1_ym == 201310) {
    $pmonth[1][0]  += 105000;
    $pmonth[34][0] += 5000;
    $pmonth[41][0] += 100000;
}
// 2014/01/10 ÄÉ²Ã
if ($p1_ym == 201312) {
    $pmonth[1][0]  += 105000;
    $pmonth[34][0] += 5000;
    $pmonth[41][0] += 100000;
}
// 2014/02/05 ÄÉ²Ã
if ($p1_ym == 201401) {
    $pmonth[1][0]  += 525000;
    $pmonth[34][0] += 25000;
    $pmonth[41][0] += 500000;
}
// 2014/03/05 ÄÉ²Ã
if ($p1_ym == 201402) {
    $pmonth[1][0]  += 315000;
    $pmonth[34][0] += 15000;
    $pmonth[41][0] += 300000;
}
// 2014/04/03 ÄÉ²Ã
if ($p1_ym == 201403) {
    //$pmonth[2][0]  += 19326300;    // »ÃÄêÍÑ °µÂ¤¹©¶ñ 18,391,500±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    //$pmonth[9][0]  -= 19326300;    // »ÃÄêÍÑ
    // Ä¾ÀÜ¾¦´É¤ÎÄ´À°¤òAS¤ËÆþÎÏ¤¹¤ë¤è¤¦¤Ë¤Ê¤Ã¤¿°Ù¡¢Ä´À°¤ò²ò½ü
    //$pmonth[1][0]  -= 105000;
    //$pmonth[34][0] -= 5000;
    //$pmonth[41][0] -= 100000;
    $pmonth[2][0]  += 21957050;    // ³ÎÄê °µÂ¤¹©¶ñ 21,022,250±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $pmonth[9][0]  -= 21957050;    // ³ÎÄê
    //Ì¤Ê§¾ÃÈñÀÇ[29] ¤ò Ì¤¼ý¾ÃÈñÀÇÅù¤Ø¿¶ÂØ Ì¤Ê§ 5,269,700 ¢ª 0 Ì¤¼ý 9,622,964-5,269,700=4,353,264
    //$pmonth[29][0] -= 5269700;
    //$pmonth[42][0] -= 5269700;
}
// 2014/06/12 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p1_ym >= 201404 && $p1_ym <= 201408) {
    $pmonth[2][0]  += 21957050;    // ³ÎÄê °µÂ¤¹©¶ñ 21,022,250±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $pmonth[9][0]  -= 21957050;    // ³ÎÄê
}

// 2014/06/04 ÄÉ²Ã
if ($p1_ym == 201405) {
    $pmonth[1][0]  -= 540000;
    $pmonth[34][0] -= 40000;
    $pmonth[41][0] -= 500000;
}
// 2014/10/06 ÄÉ²Ã
if ($p1_ym == 201409) {
    //$pmonth[2][0]  += 21957050;    // »ÃÄêÍÑ °µÂ¤¹©¶ñ 21,022,250±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    //$pmonth[9][0]  -= 21957050;    // »ÃÄêÍÑ
    
    $pmonth[2][0]  += 21647825;    // ³ÎÄê °µÂ¤¹©¶ñ 20,713,025±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $pmonth[9][0]  -= 21647825;    // ³ÎÄê
}
// 2014/10/06 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p1_ym >= 201410 && $p1_ym <= 201502) {
    $pmonth[2][0]  += 21647825;    // ³ÎÄê °µÂ¤¹©¶ñ 20,713,025±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $pmonth[9][0]  -= 21647825;    // ³ÎÄê
}

// 2015/04/07 ÄÉ²Ã
if ($p1_ym == 201503) {
    //$pmonth[2][0]  += 21647825;    // »ÃÄê °µÂ¤¹©¶ñ 20,713,025±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    //$pmonth[9][0]  -= 21647825;    // »ÃÄê
    
    $pmonth[2][0]  += 22512650;    // ³ÎÄê °µÂ¤¹©¶ñ 21,577,850±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $pmonth[9][0]  -= 22512650;    // ³ÎÄê
}
// 2015/04/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p1_ym >= 201504 && $p1_ym <= 201508) {
    $pmonth[2][0]  += 22512650;    // ³ÎÄê °µÂ¤¹©¶ñ 21,577,850±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $pmonth[9][0]  -= 22512650;    // ³ÎÄê
}
// 2015/05/08 ÄÉ²Ã
if ($p1_ym == 201504) {
    $pmonth[1][0]  -= 215000;
    $pmonth[34][0] -= 15000;
    $pmonth[41][0] -= 200000;
}
// 2015/09/04 ÄÉ²Ã
if ($p1_ym == 201508) {
    $pmonth[1][0]  += 209488;
    $pmonth[34][0] += 15518;
    $pmonth[41][0] += 193970;
}
// 2015/10/07 ÄÉ²Ã
if ($p1_ym == 201409) {
    //$pmonth[2][0]  += 22512650;    // »ÃÄê °µÂ¤¹©¶ñ 21,577,850±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    //$pmonth[9][0]  -= 22512650;    // »ÃÄê
    
    $pmonth[2][0]  += 21948500;    // ³ÎÄê °µÂ¤¹©¶ñ 21,013,700±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $pmonth[9][0]  -= 21948500;    // ³ÎÄê
}
// 2015/10/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p1_ym >= 201510 && $p1_ym <= 201602) {
    //$pmonth[2][0]  += 21948500;    // ³ÎÄê °µÂ¤¹©¶ñ 21,013,700±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    //$pmonth[9][0]  -= 21948500;    // ³ÎÄê
    // 20151021¤Ë¥ä¥Þ¥ÏÃ±¼´¥í¥Ü¥Ã¥ÈÃùÂ¢ÉÊ»ÈÍÑ¡Ê336,600±ß¡Ë¢ª ÃùÂ¢ÉÊ¤È¤·¤ÆÃ±¼´¥í¥Ü¥Ã¥ÈºÆ¹ØÆþ¡Ê416,700±ß¡Ë
    $pmonth[2][0]  += 22028600;    // ³ÎÄê °µÂ¤¹©¶ñ 21,013,700±ß ÃùÂ¢ÉÊ £³ÅÀ 1,014,900,800±ß¡Ê151,200±ß¤È447,000±ß¤È416,700±ß¡Ë
    $pmonth[9][0]  -= 22028600;    // ³ÎÄê
}
// 2016/04/07 ÄÉ²Ã
if ($p1_ym == 201603) {
    $pmonth[2][0]  += 22443100;    // ³ÎÄê °µÂ¤¹©¶ñ 21,508,300±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $pmonth[9][0]  -= 22443100;    // ³ÎÄê
}
// 2016/04/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p1_ym >= 201604 && $p1_ym <= 201608) {
    $pmonth[2][0]  += 22443100;    // ³ÎÄê °µÂ¤¹©¶ñ 21,508,300±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $pmonth[9][0]  -= 22443100;    // ³ÎÄê
}
// 2016/05/09 ÄÉ²Ã
if ($p1_ym == 201604) {
    $pmonth[1][0]  -= 600000;
    //$month[34][0] -= 48000;
    $pmonth[41][0] -= 600000;
}
    //$month[2][0]  += 27914000;    // ³ÎÄê °µÂ¤¹©¶ñ 26,979,200±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    //$month[9][0]  -= 27914000;    // ³ÎÄê

// 2016/10/06 ÄÉ²Ã
if ($p1_ym == 201609) {
    $pmonth[2][0]  += 27994100;    // ³ÎÄê °µÂ¤¹©¶ñ 26,979,200±ß ÃùÂ¢ÉÊ £³ÅÀ 1,014,800±ß¡Ê151,200±ß¤È447,000±ß¤È416,700±ß¡Ë
    $pmonth[9][0]  -= 27994100;    // ³ÎÄê
}
// 2016/10/06 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p1_ym >= 201610 && $p1_ym <= 201610) {
    $pmonth[2][0]  += 27994100;    // ³ÎÄê °µÂ¤¹©¶ñ 26,979,200±ß ÃùÂ¢ÉÊ £³ÅÀ 1,014,800±ß¡Ê151,200±ß¤È447,000±ß¤È416,700±ß¡Ë
    $pmonth[9][0]  -= 27994100;    // ³ÎÄê
}
// 2016/11/29 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡Ê11·î¤è¤êAC¥µ¡¼¥Ü¥â¡¼¥¿¡¼Ê¬ 66,500±ßÄÉ²Ã¡Ë
if ($p1_ym >= 201611 && $p1_ym <= 201611) {
    $pmonth[2][0]  += 28060500;    // ³ÎÄê °µÂ¤¹©¶ñ 26,979,200±ß ÃùÂ¢ÉÊ £´ÅÀ 1,081,300±ß¡Ê151,200±ß¤È447,000±ß¤È416,700±ß¤È66,500±ß¡Ë
    $pmonth[9][0]  -= 28060500;    // ³ÎÄê
}
// 2016/12/21 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡Ê12·î¤è¤êAC¥µ¡¼¥Ü¥â¡¼¥¿¡¼Ê¬ 58,000±ßÄÉ²Ã¡Ë
if ($p1_ym >= 201612 && $p1_ym <= 201701) {
    $pmonth[2][0]  += 28118600;    // ³ÎÄê °µÂ¤¹©¶ñ 26,979,200±ß ÃùÂ¢ÉÊ £´ÅÀ 1,139,400±ß¡Ê151,200±ß¤È447,000±ß¤È416,700±ß¤È66,500±ß¤È58,000±ß¡Ë
    $pmonth[9][0]  -= 28118600;    // ³ÎÄê
}
// 2017/03/03 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡Ê2·î¤Ë¥ä¥Þ¥ÏÃ±¼´¥í¥Ü¥Ã¥È 416,700±ß»ÈÍÑ¡Ë
if ($p1_ym >= 201702 && $p1_ym <= 201702) {
    $pmonth[2][0]  += 27701900;    // ³ÎÄê °µÂ¤¹©¶ñ 26,979,200±ß ÃùÂ¢ÉÊ £´ÅÀ 722,700±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¡Ë
    $pmonth[9][0]  -= 27701900;    // ³ÎÄê
}
// 2017/04/07 ÄÉ²Ã
if ($p1_ym == 201703) {
    //$pmonth[2][0]  += 27701900;    // »ÃÄê °µÂ¤¹©¶ñ 26,979,200±ß ÃùÂ¢ÉÊ £´ÅÀ 722,700±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¡Ë
    //$pmonth[9][0]  -= 27701900;    // »ÃÄê
    
    $pmonth[2][0]  += 27170800;    // ³ÎÄê °µÂ¤¹©¶ñ 26,448,100±ß ÃùÂ¢ÉÊ £´ÅÀ 722,700±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¡Ë
    $pmonth[9][0]  -= 27170800;    // ³ÎÄê
}
// 2017/04/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p1_ym >= 201704 && $p1_ym <= 201708) {
    $pmonth[2][0]  += 27170800;    // ³ÎÄê °µÂ¤¹©¶ñ 26,448,100±ß ÃùÂ¢ÉÊ £´ÅÀ 722,700±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¡Ë
    $pmonth[9][0]  -= 27170800;    // ³ÎÄê
}
// 2017/10/04 ÄÉ²Ã
if ($p1_ym == 201709) {
    //$pmonth[2][0]  += 27170800;    // »ÃÄê °µÂ¤¹©¶ñ 26,448,100±ß ÃùÂ¢ÉÊ £´ÅÀ 722,700±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¡Ë
    //$pmonth[9][0]  -= 27170800;    // »ÃÄê
    
    $pmonth[2][0]  += 31331800;    // ³ÎÄê °µÂ¤¹©¶ñ 30,609,100±ß ÃùÂ¢ÉÊ £´ÅÀ 722,700±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¡Ë
    $pmonth[9][0]  -= 31331800;    // ³ÎÄê
}
// 2017/10/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p1_ym >= 201710 && $p1_ym <= 201802) {
    $pmonth[2][0]  += 31331800;    // ³ÎÄê °µÂ¤¹©¶ñ 30,609,100±ß ÃùÂ¢ÉÊ £´ÅÀ 722,700±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¡Ë
    $pmonth[9][0]  -= 31331800;    // ³ÎÄê
}
// 2018/03/29 ÄÉ²Ã
if ($p1_ym == 201803) {
    //$pmonth[2][0]  += 31809300;    // »ÃÄê °µÂ¤¹©¶ñ 30,609,100±ß ÃùÂ¢ÉÊ £µÅÀ 1,200,200±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¤È477,500±ß¡Ë
    //$pmonth[9][0]  -= 31809300;    // »ÃÄê
    
    $pmonth[2][0]  += 30723300;    // ³ÎÄê °µÂ¤¹©¶ñ 29,523,100±ß ÃùÂ¢ÉÊ £µÅÀ 1,200,200±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¤È477,500±ß¡Ë
    $pmonth[9][0]  -= 30723300;    // ³ÎÄê
}

// 2018/07/05 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p1_ym >= 201804 && $p1_ym <= 201807) {
    $pmonth[2][0]  += 30723300;    // ³ÎÄê °µÂ¤¹©¶ñ 29,523,100±ß ÃùÂ¢ÉÊ £µÅÀ 1,200,200±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¤È477,500±ß¡Ë
    $pmonth[9][0]  -= 30723300;    // ³ÎÄê
}
// 2018/09/05 ÄÉ²Ã ÃùÂ¢ÉÊ¥·¥ó¥¯¥í¥¿¥Ã¥ÑÄÉ²Ã 348,000±ß
if ($p1_ym == 201808) {
    $pmonth[2][0]  += 31071300;    // ³ÎÄê °µÂ¤¹©¶ñ 29,523,100±ß ÃùÂ¢ÉÊ £µÅÀ 1,548,200±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¡Ë
    $pmonth[9][0]  -= 31071300;    // ³ÎÄê
}
// 2018/10/04 ÄÉ²Ã
if ($p1_ym == 201809) {
    //$pmonth[2][0]  += 31071300;    // »ÃÄê °µÂ¤¹©¶ñ 29,523,100±ß ÃùÂ¢ÉÊ £µÅÀ 1,548,200±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¡Ë
    //$pmonth[9][0]  -= 31071300;    // »ÃÄê
    
    $pmonth[2][0]  += 31076300;    // ³ÎÄê °µÂ¤¹©¶ñ 29,528,100±ß ÃùÂ¢ÉÊ £µÅÀ 1,548,200±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¡Ë
    $pmonth[9][0]  -= 31076300;    // ³ÎÄê
}
// 2018/10/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p1_ym >= 201810 && $p1_ym <= 201902) {
    $pmonth[2][0]  += 31076300;    // ³ÎÄê °µÂ¤¹©¶ñ 29,528,100±ß ÃùÂ¢ÉÊ £µÅÀ 1,548,200±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¡Ë
    $pmonth[9][0]  -= 31076300;    // ³ÎÄê
}
// 2019/04/05 ÄÉ²Ã
if ($p1_ym == 201903) {
    //$pmonth[2][0]  += 31208800;    // »ÃÄê °µÂ¤¹©¶ñ 29,528,100±ß ÃùÂ¢ÉÊ £±£°ÅÀ 1,680,700±ß¡Ê151,200±ß¤È447,000±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¡Ë
    //$pmonth[9][0]  -= 31208800;    // »ÃÄê
    
    $pmonth[2][0]  += 29013600;    // ³ÎÄê °µÂ¤¹©¶ñ 27,332,900±ß ÃùÂ¢ÉÊ £±£°ÅÀ 1,680,700±ß¡Ê151,200±ß¤È447,000±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¡Ë
    $pmonth[9][0]  -= 29013600;    // ³ÎÄê
}
// 2019/04/08 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p1_ym >= 201904 && $p1_ym <= 201908) {
    $pmonth[2][0]  += 29013600;    // ³ÎÄê °µÂ¤¹©¶ñ 27,332,900±ß ÃùÂ¢ÉÊ £±£°ÅÀ 1,680,700±ß¡Ê151,200±ß¤È447,000±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¡Ë
    $pmonth[9][0]  -= 29013600;    // ³ÎÄê
}
// 2019/10/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p1_ym >= 201909 && $p1_ym <= 202002) {
    $pmonth[2][0]  += 30711100;    // ³ÎÄê °µÂ¤¹©¶ñ 29,030,400±ß ÃùÂ¢ÉÊ £±£°ÅÀ 1,680,700±ß¡Ê151,200±ß¤È447,000±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¡Ë
    $pmonth[9][0]  -= 30711100;    // ³ÎÄê
}
// 2020/04/06 ÄÉ²Ã
if ($p1_ym == 202003) {
    //$pmonth[2][0]  += 30653100;    // »ÃÄê °µÂ¤¹©¶ñ 29,030,400±ß ÃùÂ¢ÉÊ £¹ÅÀ 1,622,700±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¡Ë
    //$pmonth[9][0]  -= 30653100;    // »ÃÄê
    
    $pmonth[2][0]  += 31847700;    // ³ÎÄê °µÂ¤¹©¶ñ 30,225,000±ß ÃùÂ¢ÉÊ £¹ÅÀ 1,622,700±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¡Ë
    $pmonth[9][0]  -= 31847700;    // ³ÎÄê
}
// 2020/04/06 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p1_ym >= 202004 && $p1_ym <= 202005) {
    $pmonth[2][0]  += 31847700;    // ³ÎÄê °µÂ¤¹©¶ñ 30,225,000±ß ÃùÂ¢ÉÊ £¹ÅÀ 1,622,700±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¡Ë
    $pmonth[9][0]  -= 31847700;    // ³ÎÄê
}
// 2020/07/08 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p1_ym >= 202006 && $p1_ym <= 202008) {
    $pmonth[2][0]  += 34437700;    // // ³ÎÄê °µÂ¤¹©¶ñ 30,225,000±ß ÃùÂ¢ÉÊ £¹ÅÀ 4,212,700±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¤È2,590,000±ß¡Ë
    $pmonth[9][0]  -= 34437700;    // ³ÎÄê
}
// 2020/10/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p1_ym >= 202009 && $p1_ym <= 202102) {
    $pmonth[2][0]  += 35225500;    // ³ÎÄê °µÂ¤¹©¶ñ 31,012,800±ß ÃùÂ¢ÉÊ £¹ÅÀ 4,212,700±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¤È2,590,000±ß¡Ë
    $pmonth[9][0]  -= 35225500;    // ³ÎÄê
}
// 2021/04/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p1_ym >= 202103 && $p1_ym <= 202105) {
    $pmonth[2][0]  += 34201500;    // ³ÎÄê °µÂ¤¹©¶ñ 29,988,800±ß ÃùÂ¢ÉÊ £¹ÅÀ 4,212,700±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¤È2,590,000±ß¡Ë
    $pmonth[9][0]  -= 34201500;    // ³ÎÄê
}
// 2021/07/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p1_ym >= 202106 && $p1_ym <= 202108) {
    $pmonth[2][0]  += 34390591;    // ³ÎÄê °µÂ¤¹©¶ñ 29,988,800±ß ÃùÂ¢ÉÊ £¹ÅÀ 4,401,791±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¤È2,590,000±ß¤È189,091±ß¡Ë
    $pmonth[9][0]  -= 34390591;    // ³ÎÄê
}
// 2021/10/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p1_ym >= 202109 && $p1_ym <= 202202) {
    $pmonth[2][0]  += 35918291;    // ³ÎÄê °µÂ¤¹©¶ñ 31,516,500±ß ÃùÂ¢ÉÊ £¹ÅÀ 4,401,791±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¤È2,590,000±ß¤È189,091±ß¡Ë
    $pmonth[9][0]  -= 35918291;    // ³ÎÄê
}
    ///// Á°·î¤Î²¾¼õ¶â¥Á¥§¥Ã¥¯
$pmonth_kari = array();
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d and t_row=44 order by t_row ASC", $p1_ym);
if ((getResult2($query, $pmonth_kari)) > 0) {
    $pmonth[32][0] += $pmonth_kari[0][0];         // ¤½¤ÎÂ¾Î®Æ°ÉéºÄ¤Ë²Ã»»
}
    ///// Á°·î¤Î»ÜÀßÍøÍÑ¸¢¥Á¥§¥Ã¥¯F45(2440)
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d and t_row=45 order by t_row ASC", $p1_ym);
if ((getUniResult($query, $pmonth_sisetu)) <= 0) {
    $pmonth_sisetu = 0;
}
    ///// Á°·î¤Î»ÜÀßÍøÍÑ¸¢¥Á¥§¥Ã¥¯F46(1475) ¾¦Ë¡²ÊÌÜ¤Ç¤¢¤ë¤³¤È¤ËÃí°Õ ¼ÒÆâ²ÊÌÜ¤Ï1518
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d and t_row=46 order by t_row ASC", $p1_ym);
if ((getUniResult($query, $pmonth_mihojin)) <= 0) {
    $pmonth_mihojin = 0;
}

///////// Á°¡¹·î
$ppmonth = array();
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d order by t_row ASC", $p2_ym);
$pprows = getResult2($query, $ppmonth);

// 2010/10/06 ÄÉ²Ã
if ($p2_ym == 201009) {
    $ppmonth[1][0]  += 6562097;
    $ppmonth[29][0] += 312481;
    $ppmonth[41][0] += 6249616;
}
// 2010/11/05 ÄÉ²Ã
if ($p2_ym == 201010) {
    $ppmonth[1][0]  += 6562097;
    $ppmonth[29][0] += 312481;
    $ppmonth[41][0] += 6249616;
    $ppmonth[1][0]  += 796423;
    $ppmonth[34][0] += 37925;
    $ppmonth[41][0] += 758498;
}
// 2010/12/03 ÄÉ²Ã
if (($p2_ym >= 201011) && ($p2_ym <= 201103)) {
    $ppmonth[1][0]  += 6562097;
    $ppmonth[29][0] += 312481;
    $ppmonth[41][0] += 6249616;
    $ppmonth[1][0]  += 796423;
    $ppmonth[34][0] += 37925;
    $ppmonth[41][0] += 758498;
    $ppmonth[1][0]  += 1817925;
    $ppmonth[34][0] += 86568;
    $ppmonth[41][0] += 1731357;
}
// 2011/04/06 ÄÉ²Ã
if ($p2_ym == 201103) {
    $ppmonth[1][0]  -= 6562097;
    $ppmonth[29][0] -= 312481;
    $ppmonth[41][0] -= 6249616;
    $ppmonth[1][0]  -= 796423;
    $ppmonth[34][0] -= 37925;
    $ppmonth[41][0] -= 758498;
    $ppmonth[1][0]  -= 1817925;
    $ppmonth[34][0] -= 86568;
    $ppmonth[41][0] -= 1731357;
    // 2011/04/20 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡Ê¸¶ºàÎÁµÚ¤ÓÃùÂ¢ÉÊ¡Ë
    $ppmonth[2][0]  += 15278200;
    $ppmonth[9][0]  -= 15278200;
}
// 2011/10/18 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
if ($p2_ym >= 201104 && $p2_ym <= 201108) {
    $ppmonth[2][0]  += 15278200;
    $ppmonth[9][0]  -= 15278200;
}
// 2011/07/06 ÄÉ²Ã
if ($p2_ym == 201106) {
    $ppmonth[1][0]  += 315000;
    $ppmonth[34][0] += 15000;
    $ppmonth[41][0] += 300000;
}
// 2011/08/03 ÄÉ²Ã
if ($p2_ym == 201107) {
    $ppmonth[1][0]  -= 105000;
    $ppmonth[34][0] -= 5000;
    $ppmonth[41][0] -= 100000;
}
// 2011/09/05 ÄÉ²Ã
if ($p2_ym == 201108) {
    $ppmonth[1][0]  -= 105000;
    $ppmonth[34][0] -= 5000;
    $ppmonth[41][0] -= 100000;
}
// 2011/10/05 ÄÉ²Ã
if ($p2_ym == 201109) {
    $ppmonth[1][0]  += 210000;
    $ppmonth[34][0] += 10000;
    $ppmonth[41][0] += 200000;
    // 2011/10/18 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
    $ppmonth[2][0]  += 20205550;
    $ppmonth[9][0]  -= 20205550;
}
// 2012/04/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
if ($p2_ym == 201110) {
    $ppmonth[2][0]  += 20205550;
    $ppmonth[9][0]  -= 20205550;
}
// 2012/04/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
if ($p2_ym >= 201111 && $p2_ym <= 201112) {
    $ppmonth[2][0]  += 20331550;
    $ppmonth[9][0]  -= 20331550;
}
// 2012/04/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
if ($p2_ym >= 201201 && $p2_ym <= 201202) {
    $ppmonth[2][0]  += 20518550;
    $ppmonth[9][0]  -= 20518550;
}
// 2011/11/04 ÄÉ²Ã
if ($p2_ym == 201110) {
    $ppmonth[1][0]  += 315000;
    $ppmonth[34][0] += 15000;
    $ppmonth[41][0] += 300000;
}
// 2011/12/05 ÄÉ²Ã
if ($p2_ym == 201111) {
    $ppmonth[1][0]  -= 315000;
    $ppmonth[34][0] -= 15000;
    $ppmonth[41][0] -= 300000;
}
// 2012/02/03 ÄÉ²Ã
if ($p2_ym == 201201) {
    $ppmonth[1][0]  += 105000;
    $ppmonth[34][0] += 5000;
    $ppmonth[41][0] += 100000;
    // 2012/02/08 ÄÉ²Ã 2012Ç¯1·îÅÙ ¶ÈÌ³°ÑÂ÷Èñ¡ÊÊ¿½Ð²£ÀîÇÉ¸¯ÎÁ¡ËÄ´À°
    $ppmonth[28][0] += 1156130;   // Ì¤Ê§¶â
    $ppmonth[41][0] -= 1156130;   // ½ãÍø±×
}
// 2012/02/03 ÄÉ²Ã
if ($p2_ym == 201202) {
    $ppmonth[1][0]  += 210000;
    $ppmonth[34][0] += 10000;
    $ppmonth[41][0] += 200000;
    // ÄÉ²Ã 2012Ç¯1·îÅÙ ¶ÈÌ³°ÑÂ÷Èñ¡ÊÊ¿½Ð²£ÀîÇÉ¸¯ÎÁ¡ËÄ´À° Ìá¤·
    //$ppmonth[28][0] -= 1156130;   // Ì¤Ê§¶â
    //$ppmonth[41][0] += 1156130;   // ½ãÍø±×
}
// 2012/04/04 ÄÉ²Ã
if ($p2_ym == 201203) {
    $ppmonth[1][0]  += 105000;
    $ppmonth[34][0] += 5000;
    $ppmonth[41][0] += 100000;
    //$ppmonth[1][0]  -= 2562709;
    //$ppmonth[34][0] -= 122034;
    //$ppmonth[41][0] -= 2440675;
    // 2012/04/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡Ê¸¶ºàÎÁµÚ¤ÓÃùÂ¢ÉÊ¡Ë
    $ppmonth[2][0]  += 19777150;
    $ppmonth[9][0]  -= 19777150;
}
// 2012/04/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
if ($p2_ym >= 201204 && $p2_ym <= 201208) {
    $ppmonth[2][0]  += 19777150;
    $ppmonth[9][0]  -= 19777150;
}
// 2012/05/07 ÄÉ²Ã
if ($p2_ym == 201204) {
    $ppmonth[1][0]  -= 210000;
    $ppmonth[34][0] -= 10000;
    $ppmonth[41][0] -= 200000;
}
// 2012/06/05 ÄÉ²Ã
if ($p2_ym == 201205) {
    $ppmonth[1][0]  += 315000;
    $ppmonth[34][0] += 15000;
    $ppmonth[41][0] += 300000;
}
// 2012/07/04 ÄÉ²Ã
if ($p2_ym == 201206) {
    $ppmonth[1][0]  -= 105000;
    $ppmonth[34][0] -= 5000;
    $ppmonth[41][0] -= 100000;
}
// 2012/07/11 ÄÉ²Ã
if ($p2_ym >= 201204 && $p2_ym <= 201211) {
    //Á°´üÊ¬
    $ppmonth[1][0]  += 105000;
    $ppmonth[34][0] += 5000;
    $ppmonth[41][0] += 100000;
}
// 2012/08/03 ÄÉ²Ã
if ($p2_ym == 201207) {
    $ppmonth[1][0]  -= 2562709;
    $ppmonth[34][0] -= 122034;
    $ppmonth[41][0] -= 2440675;
    $ppmonth[1][0]  -= 105000;
    $ppmonth[34][0] -= 5000;
    $ppmonth[41][0] -= 100000;
}
// 2012/09/05 ÄÉ²Ã
if ($p2_ym == 201208) {
    $ppmonth[1][0]  -= 105000;
    $ppmonth[34][0] -= 5000;
    $ppmonth[41][0] -= 100000;
}

// 2012/10/04 ÄÉ²Ã
if ($p2_ym == 201209) {
    $ppmonth[1][0]  -= 105000;
    $ppmonth[34][0] -= 5000;
    $ppmonth[41][0] -= 100000;
    $ppmonth[1][0]  -= 2562709;
    $ppmonth[29][0] -= 122034;
    $ppmonth[41][0] -= 2440675;
    //$ppmonth[2][0]  += 19615350;  // »ÃÄêÍÑ °µÂ¤¹©¶ñ 19,017,150±ß ÃùÂ¢ÉÊ £²ÅÀ 598,200±ß¡Ê151,200±ß¤È447,000±ß¡Ë
    //$ppmonth[9][0]  -= 19615350;  // »ÃÄêÍÑ
    $ppmonth[2][0]  += 17516725;    // ³ÎÄê °µÂ¤¹©¶ñ 16,918,525±ß ÃùÂ¢ÉÊ £²ÅÀ 598,200±ß¡Ê151,200±ß¤È447,000±ß¡Ë
    $ppmonth[9][0]  -= 17516725;    // ³ÎÄê
}
// 2012/10/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
if ($p2_ym >= 201210 && $p2_ym <= 201302) {
    $ppmonth[2][0]  += 17516725;
    $ppmonth[9][0]  -= 17516725;
}
// 2012/11/05 ÄÉ²Ã
if ($p2_ym == 201210) {
    $ppmonth[1][0]  -= 105000;
    $ppmonth[34][0] -= 5000;
    $ppmonth[41][0] -= 100000;
    $ppmonth[1][0]  -= 2562709;
    $ppmonth[29][0] -= 122034;
    $ppmonth[41][0] -= 2440675;
}
// 2012/12/05 ÄÉ²Ã
if ($p2_ym == 201211) {
    $ppmonth[1][0]  -= 105000;
    $ppmonth[34][0] -= 5000;
    $ppmonth[41][0] -= 100000;
    $ppmonth[1][0]  -= 2562709;
    $ppmonth[29][0] -= 122034;
    $ppmonth[41][0] -= 2440675;
}
// 2013/01/11 ÄÉ²Ã
if ($p2_ym == 201212) {
    //$ppmonth[1][0]  -= 105000;
    //$ppmonth[34][0] -= 5000;
    //$ppmonth[41][0] -= 100000;
    $ppmonth[1][0]  -= 2562709;
    $ppmonth[29][0] -= 122034;
    $ppmonth[41][0] -= 2440675;
}
// 2013/02/05 ÄÉ²Ã
// ·è»»»þ(³ÎÄê»þ)¤Ë¾ÃÈñÀÇ¤Î¿¶ÂØ½èÍý¤¬¹Ô¤ï¤ì¤¿ºÝ¤Ë
// IF¤Î¾ò·ïÆüÉÕ±¦Â¦¤ò201303¤«¤é201302¤ØÊÑ¹¹¤¹¤ë¤³¤È
if ($p2_ym >= 201301 && $p2_ym <= 201302) {
    //Ì¤Ê§¾ÃÈñÀÇ[29] ²¾¼õ¾ÃÈñÀÇ[34] Ä´À°
    $ppmonth[29][0] -= 122034;
    $ppmonth[34][0] += 122034;
}
// ·è»»»þ(³ÎÄê»þ)¤ËÅö´ü½ãÍø±×¤¬·«±ÛÍø±×¾êÍ¾¶â¤Ë¿¶¤êÊÖ¤é¤ì¤¿ºÝ¤Ë
// IF¤Î¾ò·ïÆüÉÕ¤ò201303¤«¤é201302¤ØÊÑ¹¹¤¹¤ë¤³¤È
if ($p2_ym >= 201204 && $p2_ym <= 201302) {
    //·«±ÛÍø±×¾êÍ¾¶â[40] Åö´ü½ãÍø±×[41] Ä´À°
    $ppmonth[41][0] -= 100000;
    $ppmonth[40][0] += 100000;
}
// 2013/03/05 ÄÉ²Ã
if ($p2_ym == 201302) {
    $ppmonth[1][0]  -= 5794530;
    $ppmonth[34][0] -= 275930;
    $ppmonth[41][0] -= 5518600;
}
// 2013/03/05 ÄÉ²Ã
if ($p2_ym == 201303) {
    //$ppmonth[1][0]  += 5794530;
    //$ppmonth[34][0] += 275930;
    //$ppmonth[41][0] += 5518600;
    //$ppmonth[2][0]  += 17516725;  // »ÃÄêÍÑ °µÂ¤¹©¶ñ 16,918,525±ß ÃùÂ¢ÉÊ £²ÅÀ 598,200±ß¡Ê151,200±ß¤È447,000±ß¡Ë
    //$ppmonth[9][0]  -= 17516725;  // »ÃÄêÍÑ
    $ppmonth[2][0]  += 18517075;    // ³ÎÄê °µÂ¤¹©¶ñ 17,918,875±ß ÃùÂ¢ÉÊ £²ÅÀ 598,200±ß¡Ê151,200±ß¤È447,000±ß¡Ë
    $ppmonth[9][0]  -= 18517075;    // ³ÎÄê
}
// 2013/04/08 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
if ($p2_ym >= 201304 && $p2_ym <= 201304) {
    $ppmonth[2][0]  += 18517075;    // ³ÎÄê °µÂ¤¹©¶ñ 17,918,875±ß ÃùÂ¢ÉÊ £²ÅÀ 598,200±ß¡Ê151,200±ß¤È447,000±ß¡Ë
    $ppmonth[9][0]  -= 18517075;    // ³ÎÄê
}
// 2013/05/28 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡ËÃùÂ¢ÉÊ£±ÅÀÄÉ²Ã(¥ä¥Þ¥ÏÃ±¼´¥í¥Ü¥Ã¥È 336,600±ß)
if ($p2_ym >= 201305 && $p2_ym <= 201308) {
    $ppmonth[2][0]  += 18853675;  // ³ÎÄê °µÂ¤¹©¶ñ 17,918,875±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $ppmonth[9][0]  -= 18853675;  // ³ÎÄê
}
// 2013/10/10 ÄÉ²Ã Ì¤Ê§¾ÃÈñÀÇ[29] ¤ò Ì¤¼ý¾ÃÈñÀÇÅù¤Ø¿¶ÂØ Ì¤Ê§ 5,269,700 ¢ª 0 Ì¤¼ý 9,622,964-5,269,700=4,353,264
if ($p2_ym == 201309) {
    $ppmonth[29][0] -= 5269700;
    $ppmonth[42][0] -= 5269700;
}
// 2013/10/08 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡ÊÃùÂ¢ÉÊ ¼«Æ°ÁÒ¸ËÊÝ¼éÉôÉÊµÚ¤ÓÃÃÂ¤¶â·¿¡Ë
if ($p2_ym >= 201309 && $p2_ym <= 201402) {
    $ppmonth[2][0]  += 19326300;    // ³ÎÄê °µÂ¤¹©¶ñ 18,391,500±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $ppmonth[9][0]  -= 19326300;    // ³ÎÄê
}
// 2013/11/06 ÄÉ²Ã
if ($p2_ym == 201310) {
    $ppmonth[1][0]  += 105000;
    $ppmonth[34][0] += 5000;
    $ppmonth[41][0] += 100000;
}
// 2014/01/10 ÄÉ²Ã
if ($p2_ym == 201312) {
    $ppmonth[1][0]  += 105000;
    $ppmonth[34][0] += 5000;
    $ppmonth[41][0] += 100000;
}
// 2014/02/05 ÄÉ²Ã
if ($p2_ym == 201401) {
    $ppmonth[1][0]  += 525000;
    $ppmonth[34][0] += 25000;
    $ppmonth[41][0] += 500000;
}
// 2014/03/05 ÄÉ²Ã
if ($p2_ym == 201402) {
    $ppmonth[1][0]  += 315000;
    $ppmonth[34][0] += 15000;
    $ppmonth[41][0] += 300000;
}
// 2014/04/03 ÄÉ²Ã
if ($p2_ym == 201403) {
    //$ppmonth[2][0]  += 19326300;    // »ÃÄêÍÑ °µÂ¤¹©¶ñ 18,391,500±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    //$ppmonth[9][0]  -= 19326300;    // »ÃÄêÍÑ
    // Ä¾ÀÜ¾¦´É¤ÎÄ´À°¤òAS¤ËÆþÎÏ¤¹¤ë¤è¤¦¤Ë¤Ê¤Ã¤¿°Ù¡¢Ä´À°¤ò²ò½ü
    //$ppmonth[1][0]  -= 105000;
    //$ppmonth[34][0] -= 5000;
    //$ppmonth[41][0] -= 100000;
    $ppmonth[2][0]  += 21957050;    // ³ÎÄê °µÂ¤¹©¶ñ 21,022,250±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $ppmonth[9][0]  -= 21957050;    // ³ÎÄê
    //Ì¤Ê§¾ÃÈñÀÇ[29] ¤ò Ì¤¼ý¾ÃÈñÀÇÅù¤Ø¿¶ÂØ Ì¤Ê§ 5,269,700 ¢ª 0 Ì¤¼ý 9,622,964-5,269,700=4,353,264
    //$month[29][0] -= 5269700;
    //$month[42][0] -= 5269700;
}
// 2014/06/12 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p2_ym >= 201404 && $p2_ym <= 201408) {
    $ppmonth[2][0]  += 21957050;    // ³ÎÄê °µÂ¤¹©¶ñ 21,022,250±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $ppmonth[9][0]  -= 21957050;    // ³ÎÄê
}
// 2014/06/04 ÄÉ²Ã
if ($p2_ym == 201405) {
    $ppmonth[1][0]  -= 540000;
    $ppmonth[34][0] -= 40000;
    $ppmonth[41][0] -= 500000;
}
// 2014/10/06 ÄÉ²Ã
if ($p2_ym == 201409) {
    //$ppmonth[2][0]  += 21957050;    // »ÃÄêÍÑ °µÂ¤¹©¶ñ 21,022,250±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    //$ppmonth[9][0]  -= 21957050;    // »ÃÄêÍÑ
    
    $ppmonth[2][0]  += 21647825;    // ³ÎÄê °µÂ¤¹©¶ñ 20,713,025±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $ppmonth[9][0]  -= 21647825;    // ³ÎÄê
}
// 2014/10/06 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p2_ym >= 201410 && $p2_ym <= 201502) {
    $ppmonth[2][0]  += 21647825;    // ³ÎÄê °µÂ¤¹©¶ñ 20,713,025±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $ppmonth[9][0]  -= 21647825;    // ³ÎÄê
}

// 2015/04/07 ÄÉ²Ã
if ($p2_ym == 201503) {
    //$ppmonth[2][0]  += 21647825;    // »ÃÄê °µÂ¤¹©¶ñ 20,713,025±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    //$ppmonth[9][0]  -= 21647825;    // »ÃÄê
    
    $ppmonth[2][0]  += 22512650;    // ³ÎÄê °µÂ¤¹©¶ñ 21,577,850±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $ppmonth[9][0]  -= 22512650;    // ³ÎÄê
}
// 2015/04/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p2_ym >= 201504 && $p2_ym <= 201508) {
    $ppmonth[2][0]  += 22512650;    // ³ÎÄê °µÂ¤¹©¶ñ 21,577,850±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $ppmonth[9][0]  -= 22512650;    // ³ÎÄê
}
// 2015/05/08 ÄÉ²Ã
if ($p2_ym == 201504) {
    $ppmonth[1][0]  -= 215000;
    $ppmonth[34][0] -= 15000;
    $ppmonth[41][0] -= 200000;
}
// 2015/09/04 ÄÉ²Ã
if ($p2_ym == 201508) {
    $ppmonth[1][0]  += 209488;
    $ppmonth[34][0] += 15518;
    $ppmonth[41][0] += 193970;
}
// 2015/10/07 ÄÉ²Ã
if ($p2_ym == 201409) {
    //$ppmonth[2][0]  += 22512650;    // »ÃÄê °µÂ¤¹©¶ñ 21,577,850±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    //$ppmonth[9][0]  -= 22512650;    // »ÃÄê
    
    $ppmonth[2][0]  += 21948500;    // ³ÎÄê °µÂ¤¹©¶ñ 21,013,700±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $ppmonth[9][0]  -= 21948500;    // ³ÎÄê
}
// 2015/10/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p2_ym >= 201510 && $p2_ym <= 201602) {
    //$ppmonth[2][0]  += 21948500;    // ³ÎÄê °µÂ¤¹©¶ñ 21,013,700±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    //$ppmonth[9][0]  -= 21948500;    // ³ÎÄê
    // 20151021¤Ë¥ä¥Þ¥ÏÃ±¼´¥í¥Ü¥Ã¥ÈÃùÂ¢ÉÊ»ÈÍÑ¡Ê336,600±ß¡Ë¢ª ÃùÂ¢ÉÊ¤È¤·¤ÆÃ±¼´¥í¥Ü¥Ã¥ÈºÆ¹ØÆþ¡Ê416,700±ß¡Ë
    $ppmonth[2][0]  += 22028600;    // ³ÎÄê °µÂ¤¹©¶ñ 21,013,700±ß ÃùÂ¢ÉÊ £³ÅÀ 1,014,900,800±ß¡Ê151,200±ß¤È447,000±ß¤È416,700±ß¡Ë
    $ppmonth[9][0]  -= 22028600;    // ³ÎÄê
}
// 2016/04/07 ÄÉ²Ã
if ($p2_ym == 201603) {
    $ppmonth[2][0]  += 22443100;    // ³ÎÄê °µÂ¤¹©¶ñ 21,508,300±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $ppmonth[9][0]  -= 22443100;    // ³ÎÄê
}
// 2016/04/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p2_ym >= 201604 && $p2_ym <= 201608) {
    $ppmonth[2][0]  += 22443100;    // ³ÎÄê °µÂ¤¹©¶ñ 21,508,300±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $ppmonth[9][0]  -= 22443100;    // ³ÎÄê
}
// 2016/05/09 ÄÉ²Ã
if ($p2_ym == 201604) {
    $ppmonth[1][0]  -= 600000;
    //$month[34][0] -= 48000;
    $ppmonth[41][0] -= 600000;
}
// 2016/10/06 ÄÉ²Ã
if ($p2_ym == 201609) {
    $ppmonth[2][0]  += 27994100;    // ³ÎÄê °µÂ¤¹©¶ñ 26,979,200±ß ÃùÂ¢ÉÊ £³ÅÀ 1,014,800±ß¡Ê151,200±ß¤È447,000±ß¤È416,700±ß¡Ë
    $ppmonth[9][0]  -= 27994100;    // ³ÎÄê
}
// 2016/10/06 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p2_ym >= 201610 && $p2_ym <= 201610) {
    $ppmonth[2][0]  += 27994100;    // ³ÎÄê °µÂ¤¹©¶ñ 26,979,200±ß ÃùÂ¢ÉÊ £³ÅÀ 1,014,800±ß¡Ê151,200±ß¤È447,000±ß¤È416,700±ß¡Ë
    $ppmonth[9][0]  -= 27994100;    // ³ÎÄê
}
// 2016/11/29 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡Ê11·î¤è¤êAC¥µ¡¼¥Ü¥â¡¼¥¿¡¼Ê¬ 66,500±ßÄÉ²Ã¡Ë
if ($p2_ym >= 201611 && $p2_ym <= 201611) {
    $ppmonth[2][0]  += 28060500;    // ³ÎÄê °µÂ¤¹©¶ñ 26,979,200±ß ÃùÂ¢ÉÊ £´ÅÀ 1,081,300±ß¡Ê151,200±ß¤È447,000±ß¤È416,700±ß¤È66,500±ß¡Ë
    $ppmonth[9][0]  -= 28060500;    // ³ÎÄê
}
// 2016/12/21 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡Ê12·î¤è¤êAC¥µ¡¼¥Ü¥â¡¼¥¿¡¼Ê¬ 58,000±ßÄÉ²Ã¡Ë
if ($p2_ym >= 201612 && $p2_ym <= 201701) {
    $ppmonth[2][0]  += 28118600;    // ³ÎÄê °µÂ¤¹©¶ñ 26,979,200±ß ÃùÂ¢ÉÊ £´ÅÀ 1,139,400±ß¡Ê151,200±ß¤È447,000±ß¤È416,700±ß¤È66,500±ß¤È58,000±ß¡Ë
    $ppmonth[9][0]  -= 28118600;    // ³ÎÄê
}
// 2017/03/03 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡Ê2·î¤Ë¥ä¥Þ¥ÏÃ±¼´¥í¥Ü¥Ã¥È 416,700±ß»ÈÍÑ¡Ë
if ($p2_ym >= 201702 && $p2_ym <= 201702) {
    $ppmonth[2][0]  += 27701900;    // ³ÎÄê °µÂ¤¹©¶ñ 26,979,200±ß ÃùÂ¢ÉÊ £´ÅÀ 722,700±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¡Ë
    $ppmonth[9][0]  -= 27701900;    // ³ÎÄê
}
// 2017/04/07 ÄÉ²Ã
if ($p2_ym == 201703) {
    //$ppmonth[2][0]  += 27701900;    // »ÃÄê °µÂ¤¹©¶ñ 26,979,200±ß ÃùÂ¢ÉÊ £´ÅÀ 722,700±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¡Ë
    //$ppmonth[9][0]  -= 27701900;    // »ÃÄê
    
    $ppmonth[2][0]  += 27170800;    // ³ÎÄê °µÂ¤¹©¶ñ 26,448,100±ß ÃùÂ¢ÉÊ £´ÅÀ 722,700±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¡Ë
    $ppmonth[9][0]  -= 27170800;    // ³ÎÄê
}
// 2017/04/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p2_ym >= 201704 && $p2_ym <= 201708) {
    $ppmonth[2][0]  += 27170800;    // ³ÎÄê °µÂ¤¹©¶ñ 26,448,100±ß ÃùÂ¢ÉÊ £´ÅÀ 722,700±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¡Ë
    $ppmonth[9][0]  -= 27170800;    // ³ÎÄê
}
// 2017/10/04 ÄÉ²Ã
if ($p2_ym == 201709) {
    //$ppmonth[2][0]  += 27170800;    // »ÃÄê °µÂ¤¹©¶ñ 26,448,100±ß ÃùÂ¢ÉÊ £´ÅÀ 722,700±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¡Ë
    //$ppmonth[9][0]  -= 27170800;    // »ÃÄê
    
    $ppmonth[2][0]  += 31331800;    // ³ÎÄê °µÂ¤¹©¶ñ 30,609,100±ß ÃùÂ¢ÉÊ £´ÅÀ 722,700±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¡Ë
    $ppmonth[9][0]  -= 31331800;    // ³ÎÄê
}
// 2017/10/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p2_ym >= 201710 && $p2_ym <= 201802) {
    $ppmonth[2][0]  += 31331800;    // ³ÎÄê °µÂ¤¹©¶ñ 30,609,100±ß ÃùÂ¢ÉÊ £´ÅÀ 722,700±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¡Ë
    $ppmonth[9][0]  -= 31331800;    // ³ÎÄê
}
// 2018/03/29 ÄÉ²Ã
if ($p2_ym == 201803) {
    //$ppmonth[2][0]  += 31809300;    // »ÃÄê °µÂ¤¹©¶ñ 30,609,100±ß ÃùÂ¢ÉÊ £µÅÀ 1,200,200±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¤È477,500±ß¡Ë
    //$ppmonth[9][0]  -= 31809300;    // »ÃÄê
    
    $ppmonth[2][0]  += 30723300;    // ³ÎÄê °µÂ¤¹©¶ñ 29,523,100±ß ÃùÂ¢ÉÊ £µÅÀ 1,200,200±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¤È477,500±ß¡Ë
    $ppmonth[9][0]  -= 30723300;    // ³ÎÄê
}

// 2018/07/05 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p2_ym >= 201804 && $p2_ym <= 201807) {
    $ppmonth[2][0]  += 30723300;    // ³ÎÄê °µÂ¤¹©¶ñ 29,523,100±ß ÃùÂ¢ÉÊ £µÅÀ 1,200,200±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¤È477,500±ß¡Ë
    $ppmonth[9][0]  -= 30723300;    // ³ÎÄê
}
// 2018/09/05 ÄÉ²Ã ÃùÂ¢ÉÊ¥·¥ó¥¯¥í¥¿¥Ã¥ÑÄÉ²Ã 348,000±ß
if ($p2_ym == 201808) {
    $ppmonth[2][0]  += 31071300;    // ³ÎÄê °µÂ¤¹©¶ñ 29,523,100±ß ÃùÂ¢ÉÊ £µÅÀ 1,548,200±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¡Ë
    $ppmonth[9][0]  -= 31071300;    // ³ÎÄê
}
// 2018/10/04 ÄÉ²Ã
if ($p2_ym == 201809) {
    //$ppmonth[2][0]  += 31071300;    // »ÃÄê °µÂ¤¹©¶ñ 29,523,100±ß ÃùÂ¢ÉÊ £µÅÀ 1,548,200±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¡Ë
    //$ppmonth[9][0]  -= 31071300;    // »ÃÄê
    
    $ppmonth[2][0]  += 31076300;    // ³ÎÄê °µÂ¤¹©¶ñ 29,528,100±ß ÃùÂ¢ÉÊ £µÅÀ 1,548,200±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¡Ë
    $ppmonth[9][0]  -= 31076300;    // ³ÎÄê
}
// 2018/10/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p2_ym >= 201810 && $p2_ym <= 201902) {
    $ppmonth[2][0]  += 31076300;    // ³ÎÄê °µÂ¤¹©¶ñ 29,528,100±ß ÃùÂ¢ÉÊ £µÅÀ 1,548,200±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¡Ë
    $ppmonth[9][0]  -= 31076300;    // ³ÎÄê
}
// 2019/04/05 ÄÉ²Ã
if ($p2_ym == 201903) {
    //$ppmonth[2][0]  += 31208800;    // »ÃÄê °µÂ¤¹©¶ñ 29,528,100±ß ÃùÂ¢ÉÊ £±£°ÅÀ 1,680,700±ß¡Ê151,200±ß¤È447,000±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¡Ë
    //$ppmonth[9][0]  -= 31208800;    // »ÃÄê
    
    $ppmonth[2][0]  += 29013600;    // ³ÎÄê °µÂ¤¹©¶ñ 27,332,900±ß ÃùÂ¢ÉÊ £±£°ÅÀ 1,680,700±ß¡Ê151,200±ß¤È447,000±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¡Ë
    $ppmonth[9][0]  -= 29013600;    // ³ÎÄê
}
// 2019/04/08 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p2_ym >= 201904 && $p2_ym <= 201908) {
    $ppmonth[2][0]  += 29013600;    // ³ÎÄê °µÂ¤¹©¶ñ 27,332,900±ß ÃùÂ¢ÉÊ £±£°ÅÀ 1,680,700±ß¡Ê151,200±ß¤È447,000±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¡Ë
    $ppmonth[9][0]  -= 29013600;    // ³ÎÄê
}
// 2019/10/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p2_ym >= 201909 && $p2_ym <= 202002) {
    $ppmonth[2][0]  += 30711100;    // ³ÎÄê °µÂ¤¹©¶ñ 29,030,400±ß ÃùÂ¢ÉÊ £±£°ÅÀ 1,680,700±ß¡Ê151,200±ß¤È447,000±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¡Ë
    $ppmonth[9][0]  -= 30711100;    // ³ÎÄê
}
// 2020/04/06 ÄÉ²Ã
if ($p2_ym == 202003) {
    //$ppmonth[2][0]  += 30653100;    // »ÃÄê °µÂ¤¹©¶ñ 29,030,400±ß ÃùÂ¢ÉÊ £¹ÅÀ 1,622,700±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¡Ë
    //$ppmonth[9][0]  -= 30653100;    // »ÃÄê
    
    $ppmonth[2][0]  += 31847700;    // ³ÎÄê °µÂ¤¹©¶ñ 30,225,000±ß ÃùÂ¢ÉÊ £¹ÅÀ 1,622,700±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¡Ë
    $ppmonth[9][0]  -= 31847700;    // ³ÎÄê
}
// 2020/04/06 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p2_ym >= 202004 && $p2_ym <= 202005) {
    $ppmonth[2][0]  += 31847700;    // ³ÎÄê °µÂ¤¹©¶ñ 30,225,000±ß ÃùÂ¢ÉÊ £¹ÅÀ 1,622,700±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¡Ë
    $ppmonth[9][0]  -= 31847700;    // ³ÎÄê
}
// 2020/07/08 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p2_ym >= 202006 && $p2_ym <= 202008) {
    $ppmonth[2][0]  += 34437700;    // // ³ÎÄê °µÂ¤¹©¶ñ 30,225,000±ß ÃùÂ¢ÉÊ £¹ÅÀ 4,212,700±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¤È2,590,000±ß¡Ë
    $ppmonth[9][0]  -= 34437700;    // ³ÎÄê
}
// 2020/10/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p2_ym >= 202009 && $p2_ym <= 202102) {
    $ppmonth[2][0]  += 35225500;    // ³ÎÄê °µÂ¤¹©¶ñ 31,012,800±ß ÃùÂ¢ÉÊ £¹ÅÀ 4,212,700±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¤È2,590,000±ß¡Ë
    $ppmonth[9][0]  -= 35225500;    // ³ÎÄê
}
// 2021/04/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p2_ym >= 202103 && $p2_ym <= 202105) {
    $ppmonth[2][0]  += 34201500;    // ³ÎÄê °µÂ¤¹©¶ñ 29,988,800±ß ÃùÂ¢ÉÊ £¹ÅÀ 4,212,700±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¤È2,590,000±ß¡Ë
    $ppmonth[9][0]  -= 34201500;    // ³ÎÄê
}
// 2021/07/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p2_ym >= 202106 && $p2_ym <= 202108) {
    $ppmonth[2][0]  += 34390591;    // ³ÎÄê °µÂ¤¹©¶ñ 29,988,800±ß ÃùÂ¢ÉÊ £¹ÅÀ 4,401,791±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¤È2,590,000±ß¤È189,091±ß¡Ë
    $ppmonth[9][0]  -= 34390591;    // ³ÎÄê
}
// 2021/10/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($p2_ym >= 202109 && $p2_ym <= 202202) {
    $ppmonth[2][0]  += 35918291;    // ³ÎÄê °µÂ¤¹©¶ñ 31,516,500±ß ÃùÂ¢ÉÊ £¹ÅÀ 4,401,791±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¤È2,590,000±ß¤È189,091±ß¡Ë
    $ppmonth[9][0]  -= 35918291;    // ³ÎÄê
}
    ///// Á°¡¹·î¤Î²¾¼õ¶â¥Á¥§¥Ã¥¯
$ppmonth_kari = array();
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d and t_row=44 order by t_row ASC", $p2_ym);
if ((getResult2($query, $ppmonth_kari)) > 0) {
    $ppmonth[32][0] += $ppmonth_kari[0][0];         // ¤½¤ÎÂ¾Î®Æ°ÉéºÄ¤Ë²Ã»»
}
    ///// Á°¡¹·î¤Î»ÜÀßÍøÍÑ¸¢¥Á¥§¥Ã¥¯F45(2440)
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d and t_row=45 order by t_row ASC", $p2_ym);
if ((getUniResult($query, $ppmonth_sisetu)) <= 0) {
    $ppmonth_sisetu = 0;
}
    ///// Á°¡¹·î¤Î»ÜÀßÍøÍÑ¸¢¥Á¥§¥Ã¥¯F46(1475) ¾¦Ë¡²ÊÌÜ¤Ç¤¢¤ë¤³¤È¤ËÃí°Õ ¼ÒÆâ²ÊÌÜ¤Ï1518
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d and t_row=46 order by t_row ASC", $p2_ym);
if ((getUniResult($query, $ppmonth_mihojin)) <= 0) {
    $ppmonth_mihojin = 0;
}
    ///// ´ü¼ó (Á°´üËö¤Î·è»»¥Ç¡¼¥¿)
$kisyu_month = array();
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d order by t_row ASC", $pre_end_ym);
$kisyu_rows = getResult2($query, $kisyu_month);

// 2010/10/06 ÄÉ²Ã
if ($pre_end_ym == 201103) {
    $kisyu_month[1][0]  += 6562097;
    $kisyu_month[29][0] += 312481;
    $kisyu_month[41][0] += 6249616;
}
// 2010/11/05 ÄÉ²Ã
if ($pre_end_ym == 201103) {
    $kisyu_month[1][0]  += 796423;
    $kisyu_month[34][0] += 37925;
    $kisyu_month[41][0] += 758498;
}
// 2010/12/03 ÄÉ²Ã
if ($pre_end_ym == 201103) {
    $kisyu_month[1][0]  += 1817925;
    $kisyu_month[34][0] += 86568;
    $kisyu_month[41][0] += 1731357;
}
// 2011/04/06 ÄÉ²Ã
if ($pre_end_ym == 201103) {
    $kisyu_month[1][0]  -= 6562097;
    $kisyu_month[29][0] -= 312481;
    $kisyu_month[41][0] -= 6249616;
    $kisyu_month[1][0]  -= 796423;
    $kisyu_month[34][0] -= 37925;
    $kisyu_month[41][0] -= 758498;
    $kisyu_month[1][0]  -= 1817925;
    $kisyu_month[34][0] -= 86568;
    $kisyu_month[41][0] -= 1731357;
    // 2011/04/20 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡Ê¸¶ºàÎÁµÚ¤ÓÃùÂ¢ÉÊ¡Ë
    $kisyu_month[2][0]  += 15278200;
    $kisyu_month[9][0]  -= 15278200;
}
// 2012/04/04 ÄÉ²Ã
if ($pre_end_ym == 201203) {
    $kisyu_month[1][0]  += 105000;
    $kisyu_month[34][0] += 5000;
    $kisyu_month[41][0] += 100000;
    //$kisyu_month[1][0]  -= 2562709;
    //$kisyu_month[34][0] -= 122034;
    //$kisyu_month[41][0] -= 2440675;
    // 2012/04/04 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡Ê¸¶ºàÎÁµÚ¤ÓÃùÂ¢ÉÊ¡Ë
    $kisyu_month[2][0]  += 19777150;
    $kisyu_month[9][0]  -= 19777150;
}
// 2013/04/08 ÄÉ²Ã
if ($pre_end_ym == 201303) {
    // 2013/04/08 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º¡Ê¸¶ºàÎÁµÚ¤ÓÃùÂ¢ÉÊ¡Ë
    $kisyu_month[2][0]  += 18517075;    // ³ÎÄê °µÂ¤¹©¶ñ 17,918,875±ß ÃùÂ¢ÉÊ £²ÅÀ 598,200±ß¡Ê151,200±ß¤È447,000±ß¡Ë
    $kisyu_month[9][0]  -= 18517075;    // ³ÎÄê
}
// 2014/04/04 ÄÉ²Ã
if ($pre_end_ym == 201403) {
    $kisyu_month[2][0]  += 21957050;    // ³ÎÄê °µÂ¤¹©¶ñ 21,022,250±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $kisyu_month[9][0]  -= 21957050;    // ³ÎÄê
    // Ä¾ÀÜ¾¦´É¤ÎÄ´À°¤òAS¤ËÆþÎÏ¤¹¤ë¤è¤¦¤Ë¤Ê¤Ã¤¿°Ù¡¢Ä´À°¤ò²ò½ü
    //$kisyu_month[1][0]  -= 105000;
    //$kisyu_month[34][0] -= 5000;
    //$kisyu_month[41][0] -= 100000;
}
// 2015/04/07 ÄÉ²Ã
if ($pre_end_ym == 201503) {
    $kisyu_month[2][0]  += 22512650;    // ³ÎÄê °µÂ¤¹©¶ñ 21,577,850±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $kisyu_month[9][0]  -= 22512650;    // ³ÎÄê
}
// 2016/04/07 ÄÉ²Ã
if ($pre_end_ym == 201603) {
    $kisyu_month[2][0]  += 22443100;    // ³ÎÄê °µÂ¤¹©¶ñ 21,508,300±ß ÃùÂ¢ÉÊ £³ÅÀ 934,800±ß¡Ê151,200±ß¤È447,000±ß¤È336,600±ß¡Ë
    $kisyu_month[9][0]  -= 22443100;    // ³ÎÄê
}
// 2017/04/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($pre_end_ym == 201703) {
    $kisyu_month[2][0]  += 27170800;    // ³ÎÄê °µÂ¤¹©¶ñ 26,448,100±ß ÃùÂ¢ÉÊ £´ÅÀ 722,700±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¡Ë
    $kisyu_month[9][0]  -= 27170800;    // ³ÎÄê
}
// 2018/04/06 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($pre_end_ym == 201803) {
    $kisyu_month[2][0]  += 30723300;    // ³ÎÄê °µÂ¤¹©¶ñ 29,523,100±ß ÃùÂ¢ÉÊ £µÅÀ 1,200,200±ß¡Ê151,200±ß¤È447,000±ß¤È66,500±ß¤È58,000±ß¤È477,500±ß¡Ë
    $kisyu_month[9][0]  -= 30723300;    // ³ÎÄê
}
// 2019/04/08 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($pre_end_ym == 201903) {
    $kisyu_month[2][0]  += 29013600;    // ³ÎÄê °µÂ¤¹©¶ñ 27,332,900±ß ÃùÂ¢ÉÊ £±£°ÅÀ 1,680,700±ß¡Ê151,200±ß¤È447,000±ß¤È58,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¡Ë
    $kisyu_month[9][0]  -= 29013600;    // ³ÎÄê
}
// 2020/04/06 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($pre_end_ym == 202003) {
    $kisyu_month[2][0]  += 31847700;    // ³ÎÄê °µÂ¤¹©¶ñ 30,225,000±ß ÃùÂ¢ÉÊ £¹ÅÀ 1,622,700±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¡Ë
    $kisyu_month[9][0]  -= 31847700;    // ³ÎÄê
}
// 2021/04/07 ÄÉ²Ã ²¾Ê§¶â¢ªÃª²·»ñ»º
if ($pre_end_ym == 202103) {
    $kisyu_month[2][0]  += 34201500;    // ³ÎÄê °µÂ¤¹©¶ñ 29,988,800±ß ÃùÂ¢ÉÊ £¹ÅÀ 4,212,700±ß¡Ê151,200±ß¤È447,000±ß¤È477,500±ß¤È348,000±ß¤È39,800±ß¤¬5ÅÀ¤È2,590,000±ß¡Ë
    $kisyu_month[9][0]  -= 34201500;    // ³ÎÄê
}
    ///// ´ü¼ó¤Î»ÜÀßÍøÍÑ¸¢¥Á¥§¥Ã¥¯F45(2440)
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d and t_row=45 order by t_row ASC", $pre_end_ym);
if ((getUniResult($query, $premonth_sisetu)) <= 0) {
    $premonth_sisetu = 0;
}
    ///// ´ü¼ó¤Î»ÜÀßÍøÍÑ¸¢¥Á¥§¥Ã¥¯F46(1475) ¾¦Ë¡²ÊÌÜ¤Ç¤¢¤ë¤³¤È¤ËÃí°Õ ¼ÒÆâ²ÊÌÜ¤Ï1518
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d and t_row=46 order by t_row ASC", $pre_end_ym);
if ((getUniResult($query, $premonth_mihojin)) <= 0) {
    $premonth_mihojin = 0;
}

///// ÇÛÎó¥Ç¡¼¥¿¤òÉ½·Á¼°¤ËÀ°·Á¤¹¤ë
$data      = array();   // ·×»»ÍÑ¥Ç¡¼¥¿ÇÛÎó
$view_data = array();   // É½¼¨ÍÑ¥Ç¡¼¥¿ÇÛÎó
for ($r = 1; $r < $rows; $r++) {            // Åö·î¤Î¹Ô¿ô¤Ç¥«¥¦¥ó¥È³«»Ï ¥¹¥¿¡¼¥È¤¬£±¤«¤é¤ËÃí°Õ
    for ($c = 1; $c <= 6; $c++) {           // ¥«¥é¥à¿ô (´ü¼ó Á°¡¹·î Á°·î Åö·î Á°·îÁý¸º ´ü´ÖÁý¸º)
        if ($c == 1) {                // ´ü¼ó¤Î·è»»¥Ç¡¼¥¿
            if ($r == 3) {                  // Ãª²·»ñ»º¤ò¤Þ¤È¤á¤ë F3 ¸¶ºàÎÁµÚ¤ÓÃùÂ¢ÉÊ(1250)
                if (isset($kisyu_month[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $kisyu_month[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                } else {
                    $data[3][$c]      =  0 ;     // ¥Ç¡¼¥¿¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤Ê¤¤¾ì¹ç¤Ï£°¤Ç½é´ü²½
                    $view_data[3][$c] = '0';     // ¥Ç¡¼¥¿¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤Ê¤¤¾ì¹ç¤Ï£°¤Ç½é´ü²½
                }
            } elseif ($r == 4) {   // Ãª²·»ñ»º¤ò¤Þ¤È¤á¤ë 2009/07/08ÄÉ²Ã F4 »Å³ÝÉÊ(1240)
                if (isset($kisyu_month[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $kisyu_month[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                }
            } elseif ($r == 47) {   // Ãª²·»ñ»º¤ò¤Þ¤È¤á¤ë F47 ÃùÂ¢ÉÊ(1270)
                if (isset($kisyu_month[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $kisyu_month[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                }
            } elseif ($r == 53) {   // Ãª²·»ñ»º¤ò¤Þ¤È¤á¤ë F53 ¾¦ÉÊµÚ¤ÓÀ½ÉÊ(1230)
                if (isset($kisyu_month[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $kisyu_month[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                }
            } elseif (($r >= 13) && ($r <= 16)) {   // Í­·Á¸ÇÄê»ñ»º¤ò¤Þ¤È¤á¤ë
                if (isset($kisyu_month[$r-1][0])) {
                    $data[12][$c]      = ($data[12][$c] + $kisyu_month[$r-1][0]);
                    $view_data[12][$c] = number_format(($data[12][$c] / $tani), $keta);
                } else {
                    $data[12][$c]      =  0 ;    // ¥Ç¡¼¥¿¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤Ê¤¤¾ì¹ç¤Ï£°¤Ç½é´ü²½
                    $view_data[12][$c] = '0';    // ¥Ç¡¼¥¿¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤Ê¤¤¾ì¹ç¤Ï£°¤Ç½é´ü²½
                }
            } elseif ($r == 48) {   // Í­·Á¸ÇÄê»ñ»º¤ò¤Þ¤È¤á¤ë F48 ¥ê¡¼¥¹»ñ»º(2211)
                if (isset($kisyu_month[$r-1][0])) {
                    $data[12][$c]      = ($data[12][$c] + $kisyu_month[$r-1][0]);
                    $view_data[12][$c] = number_format(($data[12][$c] / $tani), $keta);
                }
            } else {                        // ²ÊÌÜ¤¬£±ÂÐ£±¤ËÂÐ±þ¤·¤Æ¤¤¤ëÊª
                if (isset($kisyu_month[$r-1][0])) {
                    $data[$r][$c]      = $kisyu_month[$r-1][0];
                    $view_data[$r][$c] = number_format(($kisyu_month[$r-1][0] / $tani), $keta);
                } else {
                    $data[$r][$c]      =  0 ;    // ¥Ç¡¼¥¿¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤Ê¤¤¾ì¹ç¤Ï£°¤Ç½é´ü²½
                    $view_data[$r][$c] = '0';    // ¥Ç¡¼¥¿¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤Ê¤¤¾ì¹ç¤Ï£°¤Ç½é´ü²½
                }
            }
        } elseif ($c == 2) {                // Á°¡¹·î
            if ($r == 3) {                  // Ãª²·»ñ»º¤ò¤Þ¤È¤á¤ë F3 ¸¶ºàÎÁµÚ¤ÓÃùÂ¢ÉÊ(1250)
                if (isset($ppmonth[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $ppmonth[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                } else {
                    $data[3][$c]      =  0 ;     // ¥Ç¡¼¥¿¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤Ê¤¤¾ì¹ç¤Ï£°¤Ç½é´ü²½
                    $view_data[3][$c] = '0';     // ¥Ç¡¼¥¿¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤Ê¤¤¾ì¹ç¤Ï£°¤Ç½é´ü²½
                }
            } elseif ($r == 4) {   // Ãª²·»ñ»º¤ò¤Þ¤È¤á¤ë 2009/07/08ÄÉ²Ã F4 »Å³ÝÉÊ(1240)
                if (isset($ppmonth[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $ppmonth[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                }
            } elseif ($r == 47) {   // Ãª²·»ñ»º¤ò¤Þ¤È¤á¤ë F47 ÃùÂ¢ÉÊ(1270)
                if (isset($ppmonth[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $ppmonth[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                }
            } elseif ($r == 53) {   // Ãª²·»ñ»º¤ò¤Þ¤È¤á¤ë F53 ¾¦ÉÊµÚ¤ÓÀ½ÉÊ(1230)
                if (isset($ppmonth[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $ppmonth[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                }
            } elseif (($r >= 13) && ($r <= 16)) {   // Í­·Á¸ÇÄê»ñ»º¤ò¤Þ¤È¤á¤ë
                if (isset($ppmonth[$r-1][0])) {
                    $data[12][$c]      = ($data[12][$c] + $ppmonth[$r-1][0]);
                    $view_data[12][$c] = number_format(($data[12][$c] / $tani), $keta);
                } else {
                    $data[12][$c]      =  0 ;    // ¥Ç¡¼¥¿¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤Ê¤¤¾ì¹ç¤Ï£°¤Ç½é´ü²½
                    $view_data[12][$c] = '0';    // ¥Ç¡¼¥¿¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤Ê¤¤¾ì¹ç¤Ï£°¤Ç½é´ü²½
                }
            } elseif ($r == 48) {   // Í­·Á¸ÇÄê»ñ»º¤ò¤Þ¤È¤á¤ë F48 ¥ê¡¼¥¹»ñ»º(2211)
                if (isset($ppmonth[$r-1][0])) {
                    $data[12][$c]      = ($data[12][$c] + $ppmonth[$r-1][0]);
                    $view_data[12][$c] = number_format(($data[12][$c] / $tani), $keta);
                }
            } else {                        // ²ÊÌÜ¤¬£±ÂÐ£±¤ËÂÐ±þ¤·¤Æ¤¤¤ëÊª
                if (isset($ppmonth[$r-1][0])) {
                    $data[$r][$c]      = $ppmonth[$r-1][0];
                    $view_data[$r][$c] = number_format(($ppmonth[$r-1][0] / $tani), $keta);
                } else {
                    $data[$r][$c]      =  0 ;    // ¥Ç¡¼¥¿¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤Ê¤¤¾ì¹ç¤Ï£°¤Ç½é´ü²½
                    $view_data[$r][$c] = '0';    // ¥Ç¡¼¥¿¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤Ê¤¤¾ì¹ç¤Ï£°¤Ç½é´ü²½
                }
            }
        } elseif ($c == 3) {                // Á°·î
            if ($r == 3) {                  // Ãª²·»ñ»º¤ò¤Þ¤È¤á¤ë F3 ¸¶ºàÎÁµÚ¤ÓÃùÂ¢ÉÊ(1250)
                if (isset($pmonth[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $pmonth[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                } else {
                    $data[3][$c]      =  0 ;     // ¥Ç¡¼¥¿¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤Ê¤¤¾ì¹ç¤Ï£°¤Ç½é´ü²½
                    $view_data[3][$c] = '0';     // ¥Ç¡¼¥¿¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤Ê¤¤¾ì¹ç¤Ï£°¤Ç½é´ü²½
                }
            } elseif ($r == 4) {   // Ãª²·»ñ»º¤ò¤Þ¤È¤á¤ë 2009/07/08ÄÉ²Ã F4 »Å³ÝÉÊ(1240)
                if (isset($pmonth[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $pmonth[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                }
            } elseif ($r == 47) {   // Ãª²·»ñ»º¤ò¤Þ¤È¤á¤ë F47 ÃùÂ¢ÉÊ(1270)
                if (isset($pmonth[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $pmonth[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                }
            } elseif ($r == 53) {   // Ãª²·»ñ»º¤ò¤Þ¤È¤á¤ë F53 ¾¦ÉÊµÚ¤ÓÀ½ÉÊ(1230)
                if (isset($pmonth[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $pmonth[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                }
            } elseif (($r >= 13) && ($r <= 16)) {   // Í­·Á¸ÇÄê»ñ»º¤ò¤Þ¤È¤á¤ë
                if (isset($pmonth[$r-1][0])) {
                    $data[12][$c]      = ($data[12][$c] + $pmonth[$r-1][0]);
                    $view_data[12][$c] = number_format(($data[12][$c] / $tani), $keta);
                } else {
                    $data[12][$c]      =  0 ;    // ¥Ç¡¼¥¿¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤Ê¤¤¾ì¹ç¤Ï£°¤Ç½é´ü²½
                    $view_data[12][$c] = '0';    // ¥Ç¡¼¥¿¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤Ê¤¤¾ì¹ç¤Ï£°¤Ç½é´ü²½
                }
            } elseif ($r == 48) {   // Í­·Á¸ÇÄê»ñ»º¤ò¤Þ¤È¤á¤ë F48 ¥ê¡¼¥¹»ñ»º(2211)
                if (isset($pmonth[$r-1][0])) {
                    $data[12][$c]      = ($data[12][$c] + $pmonth[$r-1][0]);
                    $view_data[12][$c] = number_format(($data[12][$c] / $tani), $keta);
                }
            } else {                        // ²ÊÌÜ¤¬£±ÂÐ£±¤ËÂÐ±þ¤·¤Æ¤¤¤ëÊª
                if (isset($pmonth[$r-1][0])) {
                    $data[$r][$c]      = $pmonth[$r-1][0];
                    $view_data[$r][$c] = number_format(($pmonth[$r-1][0] / $tani), $keta);
                } else {
                    $data[$r][$c]      =  0 ;    // ¥Ç¡¼¥¿¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤Ê¤¤¾ì¹ç¤Ï£°¤Ç½é´ü²½
                    $view_data[$r][$c] = '0';    // ¥Ç¡¼¥¿¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤Ê¤¤¾ì¹ç¤Ï£°¤Ç½é´ü²½
                }
            }
        } elseif ($c == 4) {                // Åö·î
            if ($r == 3) {                  // Ãª²·»ñ»º¤ò¤Þ¤È¤á¤ë F3 ¸¶ºàÎÁµÚ¤ÓÃùÂ¢ÉÊ(1250)
                if (isset($month[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $month[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                } else {
                    $data[3][$c]      =  0 ;     // ¥Ç¡¼¥¿¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤Ê¤¤¾ì¹ç¤Ï£°¤Ç½é´ü²½
                    $view_data[3][$c] = '0';     // ¥Ç¡¼¥¿¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤Ê¤¤¾ì¹ç¤Ï£°¤Ç½é´ü²½
                }
            } elseif ($r == 4) {   // Ãª²·»ñ»º¤ò¤Þ¤È¤á¤ë 2009/07/08ÄÉ²Ã F4 »Å³ÝÉÊ(1240)
                if (isset($month[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $month[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                }
            } elseif ($r == 47) {   // Ãª²·»ñ»º¤ò¤Þ¤È¤á¤ë F47 ÃùÂ¢ÉÊ(1270)
                if (isset($month[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $month[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                }
            } elseif ($r == 53) {   // Ãª²·»ñ»º¤ò¤Þ¤È¤á¤ë F53 ¾¦ÉÊµÚ¤ÓÀ½ÉÊ(1230)
                if (isset($month[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $month[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                }
            } elseif (($r >= 13) && ($r <= 16)) {   // Í­·Á¸ÇÄê»ñ»º¤ò¤Þ¤È¤á¤ë
                if (isset($month[$r-1][0])) {
                    $data[12][$c]      = ($data[12][$c] + $month[$r-1][0]);
                    $view_data[12][$c] = number_format(($data[12][$c] / $tani), $keta);
                } else {
                    $data[12][$c]      =  0 ;    // ¥Ç¡¼¥¿¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤Ê¤¤¾ì¹ç¤Ï£°¤Ç½é´ü²½
                    $view_data[12][$c] = '0';    // ¥Ç¡¼¥¿¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤Ê¤¤¾ì¹ç¤Ï£°¤Ç½é´ü²½
                }
            } elseif ($r == 48) {   // Í­·Á¸ÇÄê»ñ»º¤ò¤Þ¤È¤á¤ë F48 ¥ê¡¼¥¹»ñ»º(2211)
                if (isset($month[$r-1][0])) {
                    $data[12][$c]      = ($data[12][$c] + $month[$r-1][0]);
                    $view_data[12][$c] = number_format(($data[12][$c] / $tani), $keta);
                }
            } else {                        // ²ÊÌÜ¤¬£±ÂÐ£±¤ËÂÐ±þ¤·¤Æ¤¤¤ëÊª
                if (isset($month[$r-1][0])) {
                    $data[$r][$c]      = $month[$r-1][0];
                    $view_data[$r][$c] = number_format(($month[$r-1][0] / $tani), $keta);
                } else {
                    $data[$r][$c]      =  0 ;    // ¥Ç¡¼¥¿¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤Ê¤¤¾ì¹ç¤Ï£°¤Ç½é´ü²½
                    $view_data[$r][$c] = '0';    // ¥Ç¡¼¥¿¤¬¥»¥Ã¥È¤µ¤ì¤Æ¤¤¤Ê¤¤¾ì¹ç¤Ï£°¤Ç½é´ü²½
                }
            }
        } elseif ($c == 5) {                // ÂÐÁ°·îÁý¸º  ¡á (Åö·î ¡Ý Á°·î)
            if ($r == 3) {                  // Ãª²·»ñ»º¤ò¤Þ¤È¤á¤ë F3 ¸¶ºàÎÁµÚ¤ÓÃùÂ¢ÉÊ(1250)
                $data[3][$c]      = ($data[3][4] - $data[3][3]);
                $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
            } elseif ($r == 4) {    // Ãª²·»ñ»º¤ò¤Þ¤È¤á¤ë 2009/07/08ÄÉ²Ã F4 »Å³ÝÉÊ(1240)
                $data[3][$c]      = ($data[3][4] - $data[3][3]);
                $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
            } elseif ($r == 47) {   // Ãª²·»ñ»º¤ò¤Þ¤È¤á¤ë F47 ÃùÂ¢ÉÊ(1270)
                $data[3][$c]      = ($data[3][4] - $data[3][3]);
                $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
            } elseif ($r == 53) {   // Ãª²·»ñ»º¤ò¤Þ¤È¤á¤ë F53 ¾¦ÉÊµÚ¤ÓÀ½ÉÊ(1230)
                $data[3][$c]      = ($data[3][4] - $data[3][3]);
                $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
            } elseif (($r >= 13) && ($r <= 16)) {   // Í­·Á¸ÇÄê»ñ»º¤ò¤Þ¤È¤á¤ë
                $data[12][$c]      = ($data[12][4] - $data[12][3]);
                $view_data[12][$c] = number_format(($data[12][$c] / $tani), $keta);
            } elseif ($r == 48) {   // Í­·Á¸ÇÄê»ñ»º¤ò¤Þ¤È¤á¤ë F48 ¥ê¡¼¥¹»ñ»º(2211)
                $data[12][$c]      = ($data[12][4] - $data[12][3]);
                $view_data[12][$c] = number_format(($data[12][$c] / $tani), $keta);
            } else {                // ²ÊÌÜ¤¬£±ÂÐ£±¤ËÂÐ±þ¤·¤Æ¤¤¤ëÊª
                $data[$r][$c]      = ($data[$r][4] - $data[$r][3]);
                $view_data[$r][$c] = number_format(($data[$r][$c] / $tani), $keta);
            }
        } elseif ($c == 6) {                // ´ü´ÖÁý¸º  ¡á  (Åö·î ¡Ý ´ü¼ó)
            if ($r == 3) {                  // Ãª²·»ñ»º¤ò¤Þ¤È¤á¤ë F3 ¸¶ºàÎÁµÚ¤ÓÃùÂ¢ÉÊ(1250)
                $data[3][$c]      = ($data[3][4] - $data[3][1]);
                $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
            } elseif ($r == 4) {    // Ãª²·»ñ»º¤ò¤Þ¤È¤á¤ë 2009/07/08ÄÉ²Ã F4 »Å³ÝÉÊ(1240)
                $data[3][$c]      = ($data[3][4] - $data[3][1]);
                $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
            } elseif ($r == 47) {   // Ãª²·»ñ»º¤ò¤Þ¤È¤á¤ë F47 ÃùÂ¢ÉÊ(1270)
                $data[3][$c]      = ($data[3][4] - $data[3][1]);
                $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
            } elseif ($r == 53) {   // Ãª²·»ñ»º¤ò¤Þ¤È¤á¤ë F53 ¾¦ÉÊµÚ¤ÓÀ½ÉÊ(1230)
                $data[3][$c]      = ($data[3][4] - $data[3][1]);
                $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
            } elseif (($r >= 13) && ($r <= 16)) {   // Í­·Á¸ÇÄê»ñ»º¤ò¤Þ¤È¤á¤ë
                $data[12][$c]      = ($data[12][4] - $data[12][1]);
                $view_data[12][$c] = number_format(($data[12][$c] / $tani), $keta);
            } elseif ($r == 48) {   // Í­·Á¸ÇÄê»ñ»º¤ò¤Þ¤È¤á¤ë F48 ¥ê¡¼¥¹»ñ»º(2211)
                $data[12][$c]      = ($data[12][4] - $data[12][1]);
                $view_data[12][$c] = number_format(($data[12][$c] / $tani), $keta);
            } else {                // ²ÊÌÜ¤¬£±ÂÐ£±¤ËÂÐ±þ¤·¤Æ¤¤¤ëÊª
                $data[$r][$c]      = ($data[$r][4] - $data[$r][1]);
                $view_data[$r][$c] = number_format(($data[$r][$c] / $tani), $keta);
            }
        }
    }
}
///// ¾®·×¡¦¹ç·×¡¦Áí¹ç·×¤Î·×»»
/********** »ñ»º¤ÎÉô Î®Æ°»ñ»º¤Î·× **********/
$rasset_sum      = array(1=>0, 2=>0, 3=>0, 4=>0, 5=>0, 6=>0);           // ½é´ü²½
$rasset_sum_view = array(1=>'', 2=>'', 3=>'', 4=>'', 5=>'', 6=>'');     // ½é´ü²½
for ($r = 1; $r <= 11; $r++) {            // ¥¹¥¿¡¼¥È¤¬£±¤«¤é¤ËÃí°Õ
    if ($r == 4) {
        continue;
    } else {
        for ($c = 1; $c <= 6; $c++) {           // ¥«¥é¥à¿ô (´ü¼ó Á°¡¹·î Á°·î Åö·î Á°·îÁý¸º ´ü´ÖÁý¸º)
            $rasset_sum[$c] += $data[$r][$c];
            $rasset_sum_view[$c] = number_format($rasset_sum[$c] / $tani, $keta);
        }
    }
}
///// ¤³¤Î¥¿¥¤¥ß¥ó¥°¤ÇÄÉ²Ã¤Ë¤Ê¤Ã¤¿Ì¤¼ýË¡¿ÍÅùF46(1475)¤Î½èÍýÄÉ²Ã 2005/04/14
    // ´ü¼ó
$premonth_mihojin_view = number_format($premonth_mihojin / $tani, $keta);
$rasset_sum[1] += $premonth_mihojin;
$rasset_sum_view[1] = number_format($rasset_sum[1] / $tani, $keta);
    // Á°¡¹·î
$ppmonth_mihojin_view = number_format($ppmonth_mihojin / $tani, $keta);
$rasset_sum[2] += $ppmonth_mihojin;
$rasset_sum_view[2] = number_format($rasset_sum[2] / $tani, $keta);
    // Á°·î
$pmonth_mihojin_view = number_format($pmonth_mihojin / $tani, $keta);
$rasset_sum[3] += $pmonth_mihojin;
$rasset_sum_view[3] = number_format($rasset_sum[3] / $tani, $keta);
    // Åö·î
$month_mihojin_view = number_format($month_mihojin / $tani, $keta);
$rasset_sum[4] += $month_mihojin;
$rasset_sum_view[4] = number_format($rasset_sum[4] / $tani, $keta);
    // ÂÐÁ°·îÁý¸º  ¡á (Åö·î ¡Ý Á°·î)
$mihojin_taizen_view = number_format(($month_mihojin - $pmonth_mihojin) / $tani, $keta);
$rasset_sum[5] += ($month_mihojin - $pmonth_mihojin);
$rasset_sum_view[5] = number_format($rasset_sum[5] / $tani, $keta);
    // ÂÐ´ü´ÖÁý¸º  ¡á (Åö·î ¡Ý ´ü¼ó)
$mihojin_taikikan_view = number_format(($month_mihojin - $premonth_mihojin) / $tani, $keta);
$rasset_sum[6] += ($month_mihojin - $premonth_mihojin);
$rasset_sum_view[6] = number_format($rasset_sum[6] / $tani, $keta);

///// ¤³¤Î¥¿¥¤¥ß¥ó¥°¤ÇÄÉ²Ã¤Ë¤Ê¤Ã¤¿Ì¤¼ý¼ý±×F56(1430)¤Î½èÍýÄÉ²Ã 2017/04/06
    // ´ü¼ó
$premonth_mishu_shueki_view = number_format($kisyu_month[55][0] / $tani, $keta);
$rasset_sum[1] += $kisyu_month[55][0];
$rasset_sum_view[1] = number_format($rasset_sum[1] / $tani, $keta);
    // Á°¡¹·î
$ppmonth_mishu_shueki_view = number_format($ppmonth[55][0] / $tani, $keta);
$rasset_sum[2] += $ppmonth[55][0];
$rasset_sum_view[2] = number_format($rasset_sum[2] / $tani, $keta);
    // Á°·î
$pmonth_mishu_shueki_view = number_format($pmonth[55][0] / $tani, $keta);
$rasset_sum[3] += $pmonth[55][0];
$rasset_sum_view[3] = number_format($rasset_sum[3] / $tani, $keta);
    // Åö·î
$month_mishu_shueki_view = number_format($month[55][0] / $tani, $keta);
$rasset_sum[4] += $month[55][0];
$rasset_sum_view[4] = number_format($rasset_sum[4] / $tani, $keta);
    // ÂÐÁ°·îÁý¸º  ¡á (Åö·î ¡Ý Á°·î)
$mishu_shueki_taizen_view = number_format(($month[55][0] - $pmonth[55][0]) / $tani, $keta);
$rasset_sum[5] += ($month[55][0] - $pmonth[55][0]);
$rasset_sum_view[5] = number_format($rasset_sum[5] / $tani, $keta);
    // ÂÐ´ü´ÖÁý¸º  ¡á (Åö·î ¡Ý ´ü¼ó)
$mishu_shueki_taikikan_view = number_format(($month[55][0] - $kisyu_month[55][0]) / $tani, $keta);
$rasset_sum[6] += ($month[55][0] - $kisyu_month[55][0]);
$rasset_sum_view[6] = number_format($rasset_sum[6] / $tani, $keta);

///// ¤³¤Î¥¿¥¤¥ß¥ó¥°¤ÇÄÉ²Ã¤Ë¤Ê¤Ã¤¿Á°Ê§¾ÃÈñÀÇF57(1495)¤Î½èÍýÄÉ²Ã 2017/04/06
    // ´ü¼ó
$premonth_mae_syohi_view = number_format($kisyu_month[56][0] / $tani, $keta);
$rasset_sum[1] += $kisyu_month[56][0];
$rasset_sum_view[1] = number_format($rasset_sum[1] / $tani, $keta);
    // Á°¡¹·î
$ppmonth_mae_syohi_view = number_format($ppmonth[56][0] / $tani, $keta);
$rasset_sum[2] += $ppmonth[56][0];
$rasset_sum_view[2] = number_format($rasset_sum[2] / $tani, $keta);
    // Á°·î
$pmonth_mae_syohi_view = number_format($pmonth[56][0] / $tani, $keta);
$rasset_sum[3] += $pmonth[56][0];
$rasset_sum_view[3] = number_format($rasset_sum[3] / $tani, $keta);
    // Åö·î
$month_mae_syohi_view = number_format($month[56][0] / $tani, $keta);
$rasset_sum[4] += $month[56][0];
$rasset_sum_view[4] = number_format($rasset_sum[4] / $tani, $keta);
    // ÂÐÁ°·îÁý¸º  ¡á (Åö·î ¡Ý Á°·î)
$mae_syohi_taizen_view = number_format(($month[56][0] - $pmonth[56][0]) / $tani, $keta);
$rasset_sum[5] += ($month[56][0] - $pmonth[56][0]);
$rasset_sum_view[5] = number_format($rasset_sum[5] / $tani, $keta);
    // ÂÐ´ü´ÖÁý¸º  ¡á (Åö·î ¡Ý ´ü¼ó)
$mae_syohi_taikikan_view = number_format(($month[56][0] - $kisyu_month[56][0]) / $tani, $keta);
$rasset_sum[6] += ($month[56][0] - $kisyu_month[56][0]);
$rasset_sum_view[6] = number_format($rasset_sum[6] / $tani, $keta);

    //////////// 2003/06/03 Ì¤¼ý¾ÃÈñÀÇÄÉ²Ã¤Î¤¿¤á
for ($c = 1; $c <= 6; $c++) {           // ¥«¥é¥à¿ô (´ü¼ó Á°¡¹·î Á°·î Åö·î Á°·îÁý¸º ´ü´ÖÁý¸º)
    if ($yyyymm < 200303) {
        $data[43][$c] = 0;
        $view_data[43][$c] = '0';       // 2003/02 °ÊÁ°¤ÏÌ¤ÂÐ±þ¤Î¤¿¤á¥ê¥Æ¥é¥ë¤ÇÂÐ±þ
    }
    $rasset_sum[$c] += $data[43][$c];   // t_row = 43 ¤ËÌ¤¼ý¾ÃÈñÀÇ¤òÄÉ²Ã 2003/06/03
    $rasset_sum_view[$c] = number_format($rasset_sum[$c] / $tani, $keta);
}
/********** »ñ»º¤ÎÉô ¸ÇÄê»ñ»º¤ÎÍ­·Á¸ÇÄê»ñ»º ·× **********/
$yasset_sum      = array(1=>0, 2=>0, 3=>0, 4=>0, 5=>0, 6=>0);           // ½é´ü²½
$yasset_sum_view = array(1=>'', 2=>'', 3=>'', 4=>'', 5=>'', 6=>'');     // ½é´ü²½
for ($r = 12; $r <= 18; $r++) {            // ¥¹¥¿¡¼¥È¤¬£±¤«¤é¤ËÃí°Õ 12 17 18
    if (($r >= 13) && ($r <=16)) {
        continue;
    } else {
        for ($c = 1; $c <= 6; $c++) {           // ¥«¥é¥à¿ô (´ü¼ó Á°¡¹·î Á°·î Åö·î Á°·îÁý¸º ´ü´ÖÁý¸º)
            $yasset_sum[$c] += $data[$r][$c];
            $yasset_sum_view[$c] = number_format($yasset_sum[$c] / $tani, $keta);
        }
    }
}
/********** »ñ»º¤ÎÉô ¸ÇÄê»ñ»º¤ÎÌµ·Á¸ÇÄê»ñ»º ·× **********/
$masset_sum      = array(1=>0, 2=>0, 3=>0, 4=>0, 5=>0, 6=>0);           // ½é´ü²½
$masset_sum_view = array(1=>'', 2=>'', 3=>'', 4=>'', 5=>'', 6=>'');     // ½é´ü²½
for ($r = 19; $r <= 20; $r++) {            // ¥¹¥¿¡¼¥È¤¬£±¤«¤é¤ËÃí°Õ 12 17 18
    for ($c = 1; $c <= 6; $c++) {           // ¥«¥é¥à¿ô (´ü¼ó Á°¡¹·î Á°·î Åö·î Á°·îÁý¸º ´ü´ÖÁý¸º)
        $masset_sum[$c] += $data[$r][$c];
        $masset_sum_view[$c] = number_format($masset_sum[$c] / $tani, $keta);
    }
}
///// ¤³¤Î¥¿¥¤¥ß¥ó¥°¤ÇÄÉ²Ã¤Ë¤Ê¤Ã¤¿»ÜÀßÍøÍÑ¸¢F45(2440)¤Î½èÍýÄÉ²Ã
    // ´ü¼ó
$premonth_sisetu_view = number_format($premonth_sisetu / $tani, $keta);
$masset_sum[1] += $premonth_sisetu;
$masset_sum_view[1] = number_format($masset_sum[1] / $tani, $keta);
    // Á°¡¹·î
$ppmonth_sisetu_view = number_format($ppmonth_sisetu / $tani, $keta);
$masset_sum[2] += $ppmonth_sisetu;
$masset_sum_view[2] = number_format($masset_sum[2] / $tani, $keta);
    // Á°·î
$pmonth_sisetu_view = number_format($pmonth_sisetu / $tani, $keta);
$masset_sum[3] += $pmonth_sisetu;
$masset_sum_view[3] = number_format($masset_sum[3] / $tani, $keta);
    // Åö·î
$month_sisetu_view = number_format($month_sisetu / $tani, $keta);
$masset_sum[4] += $month_sisetu;
$masset_sum_view[4] = number_format($masset_sum[4] / $tani, $keta);
    // ÂÐÁ°·îÁý¸º  ¡á (Åö·î ¡Ý Á°·î)
$sisetu_taizen_view = number_format(($month_sisetu - $pmonth_sisetu) / $tani, $keta);
$masset_sum[5] += ($month_sisetu - $pmonth_sisetu);
$masset_sum_view[5] = number_format($masset_sum[5] / $tani, $keta);
    // ÂÐ´ü´ÖÁý¸º  ¡á (Åö·î ¡Ý ´ü¼ó)
$sisetu_taikikan_view = number_format(($month_sisetu - $premonth_sisetu) / $tani, $keta);
$masset_sum[6] += ($month_sisetu - $premonth_sisetu);
$masset_sum_view[6] = number_format($masset_sum[6] / $tani, $keta);

/********** »ñ»º¤ÎÉô ¸ÇÄê»ñ»º¤Î·× **********/
for ($c = 1; $c <= 6; $c++) {           // ¥«¥é¥à¿ô (´ü¼ó Á°¡¹·î Á°·î Åö·î Á°·îÁý¸º ´ü´ÖÁý¸º)
    $kasset_sum[$c]      = ($yasset_sum[$c] + $masset_sum[$c]);
    $kasset_sum_view[$c] = number_format($kasset_sum[$c] / $tani, $keta);
}
/********** »ñ»º¤ÎÉô Åê»ñ¤½¤ÎÂ¾¤Î»ñ»º¤Î·× **********/
$tasset_sum      = array(1=>0, 2=>0, 3=>0, 4=>0, 5=>0, 6=>0);           // ½é´ü²½
$tasset_sum_view = array(1=>'', 2=>'', 3=>'', 4=>'', 5=>'', 6=>'');     // ½é´ü²½
for ($r = 21; $r <= 25; $r++) {            // ¥¹¥¿¡¼¥È¤¬£±¤«¤é¤ËÃí°Õ 12 17 18
    for ($c = 1; $c <= 6; $c++) {           // ¥«¥é¥à¿ô (´ü¼ó Á°¡¹·î Á°·î Åö·î Á°·îÁý¸º ´ü´ÖÁý¸º)
        $tasset_sum[$c] += $data[$r][$c];
        $tasset_sum_view[$c] = number_format($tasset_sum[$c] / $tani, $keta);
    }
}
/********** »ñ»º¤ÎÉô ¹ç·× **********/
for ($c = 1; $c <= 6; $c++) {           // ¥«¥é¥à¿ô (´ü¼ó Á°¡¹·î Á°·î Åö·î Á°·îÁý¸º ´ü´ÖÁý¸º)
    $all_asset_sum[$c]      = ($rasset_sum[$c] + $kasset_sum[$c] + $tasset_sum[$c]);
    $all_asset_sum_view[$c] = number_format($all_asset_sum[$c] / $tani, $keta);
}
/********** ÉéºÄ¤ÎÉô Î®Æ°ÉéºÄ¤Î·× **********/
$rdebt_sum      = array(1=>0, 2=>0, 3=>0, 4=>0, 5=>0, 6=>0);           // ½é´ü²½
$rdebt_sum_view = array(1=>'', 2=>'', 3=>'', 4=>'', 5=>'', 6=>'');     // ½é´ü²½
for ($r = 26; $r <= 36; $r++) {            // ¥¹¥¿¡¼¥È¤¬£±¤«¤é¤ËÃí°Õ 12 17 18
    for ($c = 1; $c <= 6; $c++) {           // ¥«¥é¥à¿ô (´ü¼ó Á°¡¹·î Á°·î Åö·î Á°·îÁý¸º ´ü´ÖÁý¸º)
        $rdebt_sum[$c] += $data[$r][$c];
        $rdebt_sum_view[$c] = number_format($rdebt_sum[$c] / $tani, $keta);
    }
}
///// ¤³¤Î¥¿¥¤¥ß¥ó¥°¤ÇÄÉ²Ã¤Ë¤Ê¤Ã¤¿¥ê¡¼¥¹ºÄÌ³(Ã»´ü)F49(4161)¤Î½èÍýÄÉ²Ã 2009/04/14
    // ´ü¼ó
$premonth_lease_short_view = number_format($kisyu_month[48][0] / $tani, $keta);
$rdebt_sum[1] += $kisyu_month[48][0];
$rdebt_sum_view[1] = number_format($rdebt_sum[1] / $tani, $keta);
    // Á°¡¹·î
$ppmonth_lease_short_view = number_format($ppmonth[48][0] / $tani, $keta);
$rdebt_sum[2] += $ppmonth[48][0];
$rdebt_sum_view[2] = number_format($rdebt_sum[2] / $tani, $keta);
    // Á°·î
$pmonth_lease_short_view = number_format($pmonth[48][0] / $tani, $keta);
$rdebt_sum[3] += $pmonth[48][0];
$rdebt_sum_view[3] = number_format($rdebt_sum[3] / $tani, $keta);
    // Åö·î
$month_lease_short_view = number_format($month[48][0] / $tani, $keta);
$rdebt_sum[4] += $month[48][0];
$rdebt_sum_view[4] = number_format($rdebt_sum[4] / $tani, $keta);
    // ÂÐÁ°·îÁý¸º  ¡á (Åö·î ¡Ý Á°·î)
$lease_short_taizen_view = number_format(($month[48][0] - $pmonth[48][0]) / $tani, $keta);
$rdebt_sum[5] += ($month[48][0] - $pmonth[48][0]);
$rdebt_sum_view[5] = number_format($rdebt_sum[5] / $tani, $keta);
    // ÂÐ´ü´ÖÁý¸º  ¡á (Åö·î ¡Ý ´ü¼ó)
$lease_short_taikikan_view = number_format(($month[48][0] - $kisyu_month[48][0]) / $tani, $keta);
$rdebt_sum[6] += ($month[48][0] - $kisyu_month[48][0]);
$rdebt_sum_view[6] = number_format($rdebt_sum[6] / $tani, $keta);

/********** ÉéºÄ¤ÎÉô ¸ÇÄêÉéºÄ¤Î·× **********/
$kdebt_sum      = array(1=>0, 2=>0, 3=>0, 4=>0, 5=>0, 6=>0);           // ½é´ü²½
$kdebt_sum_view = array(1=>'', 2=>'', 3=>'', 4=>'', 5=>'', 6=>'');     // ½é´ü²½
for ($r = 37; $r <= 38; $r++) {            // ¥¹¥¿¡¼¥È¤¬£±¤«¤é¤ËÃí°Õ 12 17 18
    for ($c = 1; $c <= 6; $c++) {           // ¥«¥é¥à¿ô (´ü¼ó Á°¡¹·î Á°·î Åö·î Á°·îÁý¸º ´ü´ÖÁý¸º)
        $kdebt_sum[$c] += $data[$r][$c];
        $kdebt_sum_view[$c] = number_format($kdebt_sum[$c] / $tani, $keta);
    }
}

///// ¤³¤Î¥¿¥¤¥ß¥ó¥°¤ÇÄÉ²Ã¤Ë¤Ê¤Ã¤¿¥ê¡¼¥¹ºÄÌ³(Ä¹´ü)F50(5180)¤Î½èÍýÄÉ²Ã 2009/04/14
    // ´ü¼ó
$premonth_lease_long_view = number_format($kisyu_month[49][0] / $tani, $keta);
$kdebt_sum[1] += $kisyu_month[49][0];
$kdebt_sum_view[1] = number_format($kdebt_sum[1] / $tani, $keta);
    // Á°¡¹·î
$ppmonth_lease_long_view = number_format($ppmonth[49][0] / $tani, $keta);
$kdebt_sum[2] += $ppmonth[49][0];
$kdebt_sum_view[2] = number_format($kdebt_sum[2] / $tani, $keta);
    // Á°·î
$pmonth_lease_long_view = number_format($pmonth[49][0] / $tani, $keta);
$kdebt_sum[3] += $pmonth[49][0];
$kdebt_sum_view[3] = number_format($kdebt_sum[3] / $tani, $keta);
    // Åö·î
$month_lease_long_view = number_format($month[49][0] / $tani, $keta);
$kdebt_sum[4] += $month[49][0];
$kdebt_sum_view[4] = number_format($kdebt_sum[4] / $tani, $keta);
    // ÂÐÁ°·îÁý¸º  ¡á (Åö·î ¡Ý Á°·î)
$lease_long_taizen_view = number_format(($month[49][0] - $pmonth[49][0]) / $tani, $keta);
$kdebt_sum[5] += ($month[49][0] - $pmonth[49][0]);
$kdebt_sum_view[5] = number_format($kdebt_sum[5] / $tani, $keta);
    // ÂÐ´ü´ÖÁý¸º  ¡á (Åö·î ¡Ý ´ü¼ó)
$lease_long_taikikan_view = number_format(($month[49][0] - $kisyu_month[49][0]) / $tani, $keta);
$kdebt_sum[6] += ($month[49][0] - $kisyu_month[49][0]);
$kdebt_sum_view[6] = number_format($kdebt_sum[6] / $tani, $keta);

///// ¤³¤Î¥¿¥¤¥ß¥ó¥°¤ÇÄÉ²Ã¤Ë¤Ê¤Ã¤¿Ä¹´üÌ¤Ê§¶âF51(5190)¤Î½èÍýÄÉ²Ã 2009/04/14
///// data¤Î¾ì¹ç¤ÏF51¤À¤Ã¤¿¤é$data[51]¤Ç¤¤¤¤¤¬$¡Ámonth¤Î¾ì¹ç¤Ï-1¤·¤Ê¤¤¤È¥À¥á
    // ´ü¼ó
$premonth_mihalong_view = number_format($kisyu_month[50][0] / $tani, $keta);
$kdebt_sum[1] += $kisyu_month[50][0];
$kdebt_sum_view[1] = number_format($kdebt_sum[1] / $tani, $keta);
    // Á°¡¹·î
$ppmonth_mihalong_view = number_format($ppmonth[50][0] / $tani, $keta);
$kdebt_sum[2] += $ppmonth[50][0];
$kdebt_sum_view[2] = number_format($kdebt_sum[2] / $tani, $keta);
    // Á°·î
$pmonth_mihalong_view = number_format($pmonth[50][0] / $tani, $keta);
$kdebt_sum[3] += $pmonth[50][0];
$kdebt_sum_view[3] = number_format($kdebt_sum[3] / $tani, $keta);
    // Åö·î
$month_mihalong_view = number_format($month[50][0] / $tani, $keta);
$kdebt_sum[4] += $month[50][0];
$kdebt_sum_view[4] = number_format($kdebt_sum[4] / $tani, $keta);
    // ÂÐÁ°·îÁý¸º  ¡á (Åö·î ¡Ý Á°·î)
$mihalong_taizen_view = number_format(($month[50][0] - $pmonth[50][0]) / $tani, $keta);
$kdebt_sum[5] += ($month[50][0] - $pmonth[50][0]);
$kdebt_sum_view[5] = number_format($kdebt_sum[5] / $tani, $keta);
    // ÂÐ´ü´ÖÁý¸º  ¡á (Åö·î ¡Ý ´ü¼ó)
$mihalong_taikikan_view = number_format(($month[50][0] - $kisyu_month[50][0]) / $tani, $keta);
$kdebt_sum[6] += ($month[50][0] - $kisyu_month[50][0]);
$kdebt_sum_view[6] = number_format($kdebt_sum[6] / $tani, $keta);

/********** ÉéºÄ¤ÎÉô ¹ç·× **********/
for ($c = 1; $c <= 6; $c++) {           // ¥«¥é¥à¿ô (´ü¼ó Á°¡¹·î Á°·î Åö·î Á°·îÁý¸º ´ü´ÖÁý¸º)
    $all_debt_sum[$c]      = ($rdebt_sum[$c] + $kdebt_sum[$c]);
    $all_debt_sum_view[$c] = number_format($all_debt_sum[$c] / $tani, $keta);
}

/********** ½ã»ñ»º¤ÎÉô »ñËÜ¶â¤Î·× **********/
    ///// »ñËÜ¶â¤ÈÆ±¤¸(°ì¤Ä¤·¤«¤Ê¤¤)
for ($c = 1; $c <= 6; $c++) {           // ¥«¥é¥à¿ô (´ü¼ó Á°¡¹·î Á°·î Åö·î Á°·îÁý¸º ´ü´ÖÁý¸º)
    $capital_sum[$c] = $data[39][$c];
}

///// ¤³¤Î¥¿¥¤¥ß¥ó¥°¤ÇÄÉ²Ã¤Ë¤Ê¤Ã¤¿»ñËÜ½àÈ÷¶âF52(7210)¤Î½èÍýÄÉ²Ã 2009/04/14
///// data¤Î¾ì¹ç¤ÏF52¤À¤Ã¤¿¤é$data[52]¤Ç¤¤¤¤¤¬$¡Ámonth¤Î¾ì¹ç¤Ï-1¤·¤Ê¤¤¤È¥À¥á
    // ´ü¼ó
$premonth_sjyunbi_view = number_format($kisyu_month[51][0] / $tani, $keta);
$hdebt_sum[1] += $kisyu_month[51][0];
$hdebt_sum_view[1] = number_format($hdebt_sum[1] / $tani, $keta);
    // Á°¡¹·î
$ppmonth_sjyunbi_view = number_format($ppmonth[51][0] / $tani, $keta);
$hdebt_sum[2] += $ppmonth[51][0];
$hdebt_sum_view[2] = number_format($hdebt_sum[2] / $tani, $keta);
    // Á°·î
$pmonth_sjyunbi_view = number_format($pmonth[51][0] / $tani, $keta);
$hdebt_sum[3] += $pmonth[51][0];
$hdebt_sum_view[3] = number_format($hdebt_sum[3] / $tani, $keta);
    // Åö·î
$month_sjyunbi_view = number_format($month[51][0] / $tani, $keta);
$hdebt_sum[4] += $month[51][0];
$hdebt_sum_view[4] = number_format($hdebt_sum[4] / $tani, $keta);
    // ÂÐÁ°·îÁý¸º  ¡á (Åö·î ¡Ý Á°·î)
$sjyunbi_taizen_view = number_format(($month[51][0] - $pmonth[51][0]) / $tani, $keta);
$hdebt_sum[5] += ($month[51][0] - $pmonth[51][0]);
$hdebt_sum_view[5] = number_format($hdebt_sum[5] / $tani, $keta);
    // ÂÐ´ü´ÖÁý¸º  ¡á (Åö·î ¡Ý ´ü¼ó)
$sjyunbi_taikikan_view = number_format(($month[51][0] - $kisyu_month[51][0]) / $tani, $keta);
$hdebt_sum[6] += ($month[51][0] - $kisyu_month[51][0]);
$hdebt_sum_view[6] = number_format($hdebt_sum[6] / $tani, $keta);

///// ¤³¤Î¥¿¥¤¥ß¥ó¥°¤ÇÄÉ²Ã¤Ë¤Ê¤Ã¤¿¤½¤ÎÂ¾»ñËÜ¾êÍ¾¶âF54(¡©¡©¡©¡©)¤Î½èÍýÄÉ²Ã 2009/08/20
///// data¤Î¾ì¹ç¤ÏF54¤À¤Ã¤¿¤é$data[54]¤Ç¤¤¤¤¤¬$¡Ámonth¤Î¾ì¹ç¤Ï-1¤·¤Ê¤¤¤È¥À¥á
    // ´ü¼ó
$premonth_s_sjyunbi_view = number_format($kisyu_month[53][0] / $tani, $keta);
$hdebt_sum[1] += $kisyu_month[53][0];
$hdebt_sum_view[1] = number_format($hdebt_sum[1] / $tani, $keta);
    // Á°¡¹·î
$ppmonth_s_sjyunbi_view = number_format($ppmonth[53][0] / $tani, $keta);
$hdebt_sum[2] += $ppmonth[53][0];
$hdebt_sum_view[2] = number_format($hdebt_sum[2] / $tani, $keta);
    // Á°·î
$pmonth_s_sjyunbi_view = number_format($pmonth[53][0] / $tani, $keta);
$hdebt_sum[3] += $pmonth[53][0];
$hdebt_sum_view[3] = number_format($hdebt_sum[3] / $tani, $keta);
    // Åö·î
$month_s_sjyunbi_view = number_format($month[53][0] / $tani, $keta);
$hdebt_sum[4] += $month[53][0];
$hdebt_sum_view[4] = number_format($hdebt_sum[4] / $tani, $keta);
    // ÂÐÁ°·îÁý¸º  ¡á (Åö·î ¡Ý Á°·î)
$s_sjyunbi_taizen_view = number_format(($month[53][0] - $pmonth[53][0]) / $tani, $keta);
$hdebt_sum[5] += ($month[53][0] - $pmonth[53][0]);
$hdebt_sum_view[5] = number_format($hdebt_sum[5] / $tani, $keta);
    // ÂÐ´ü´ÖÁý¸º  ¡á (Åö·î ¡Ý ´ü¼ó)
$s_sjyunbi_taikikan_view = number_format(($month[53][0] - $kisyu_month[53][0]) / $tani, $keta);
$hdebt_sum[6] += ($month[53][0] - $kisyu_month[53][0]);
$hdebt_sum_view[6] = number_format($hdebt_sum[6] / $tani, $keta);

/********** ½ã»ñ»º¤ÎÉô »ñËÜ¾êÍ¾¶â¤Î·× **********/
    ///// »ñËÜ½àÈ÷¶â¤È¤½¤ÎÂ¾»ñËÜ¾êÍ¾¶â¤Î·×
for ($c = 1; $c <= 6; $c++) {           // ¥«¥é¥à¿ô (´ü¼ó Á°¡¹·î Á°·î Åö·î Á°·îÁý¸º ´ü´ÖÁý¸º)
    $hcapital_sum[$c] = $hdebt_sum[$c];
    $hcapital_sum_view[$c] = number_format($hcapital_sum[$c] / $tani, $keta);
}

///// ¤³¤Î¥¿¥¤¥ß¥ó¥°¤ÇÄÉ²Ã¤Ë¤Ê¤Ã¤¿¤½¤ÎÂ¾Íø±×¾êÍ¾¶âF55(¡©¡©¡©¡©)¤Î½èÍýÄÉ²Ã 2009/08/20
///// data¤Î¾ì¹ç¤ÏF55¤À¤Ã¤¿¤é$data[55]¤Ç¤¤¤¤¤¬$¡Ámonth¤Î¾ì¹ç¤Ï-1¤·¤Ê¤¤¤È¥À¥á
    // ´ü¼ó
$premonth_s_rjyunbi_view = number_format($kisyu_month[54][0] / $tani, $keta);
$rjyunbi_sum[1] += $kisyu_month[54][0];
$rjyunbi_sum_view[1] = number_format($rjyunbi_sum[1] / $tani, $keta);
    // Á°¡¹·î
$ppmonth_s_rjyunbi_view = number_format($ppmonth[54][0] / $tani, $keta);
$rjyunbi_sum[2] += $ppmonth[54][0];
$rjyunbi_sum_view[2] = number_format($rjyunbi_sum[2] / $tani, $keta);
    // Á°·î
$pmonth_s_rjyunbi_view = number_format($pmonth[54][0] / $tani, $keta);
$rjyunbi_sum[3] += $pmonth[54][0];
$rjyunbi_sum_view[3] = number_format($rjyunbi_sum[3] / $tani, $keta);
    // Åö·î
$month_s_rjyunbi_view = number_format($month[54][0] / $tani, $keta);
$rjyunbi_sum[4] += $month[54][0];
$rjyunbi_sum_view[4] = number_format($rjyunbi_sum[4] / $tani, $keta);
    // ÂÐÁ°·îÁý¸º  ¡á (Åö·î ¡Ý Á°·î)
$s_rjyunbi_taizen_view = number_format(($month[54][0] - $pmonth[54][0]) / $tani, $keta);
$rjyunbi_sum[5] += ($month[54][0] - $pmonth[54][0]);
$rjyunbi_sum_view[5] = number_format($rjyunbi_sum[5] / $tani, $keta);
    // ÂÐ´ü´ÖÁý¸º  ¡á (Åö·î ¡Ý ´ü¼ó)
$s_rjyunbi_taikikan_view = number_format(($month[54][0] - $kisyu_month[54][0]) / $tani, $keta);
$rjyunbi_sum[6] += ($month[54][0] - $kisyu_month[54][0]);
$rjyunbi_sum_view[6] = number_format($rjyunbi_sum[6] / $tani, $keta);

/********** ½ã»ñ»º¤ÎÉô¤ÎÉô Íø±×¾êÍ¾¶â¤Î·× **********/
$jcapital_sum      = array(1=>0, 2=>0, 3=>0, 4=>0, 5=>0, 6=>0);           // ½é´ü²½
$jcapital_sum_view = array(1=>'', 2=>'', 3=>'', 4=>'', 5=>'', 6=>'');     // ½é´ü²½
for ($c = 1; $c <= 6; $c++) {           // ¥«¥é¥à¿ô (´ü¼ó Á°¡¹·î Á°·î Åö·î Á°·îÁý¸º ´ü´ÖÁý¸º)
    $jcapital_sum[$c] = $rjyunbi_sum[$c];
    $jcapital_sum_view[$c] = number_format($jcapital_sum[$c] / $tani, $keta);
}
for ($r = 40; $r <= 41; $r++) {            // ¥¹¥¿¡¼¥È¤¬£±¤«¤é¤ËÃí°Õ 12 17 18
    for ($c = 1; $c <= 6; $c++) {           // ¥«¥é¥à¿ô (´ü¼ó Á°¡¹·î Á°·î Åö·î Á°·îÁý¸º ´ü´ÖÁý¸º)
        $jcapital_sum[$c] += $data[$r][$c];
        $jcapital_sum_view[$c] = number_format($jcapital_sum[$c] / $tani, $keta);
    }
}
/********** ½ã»ñ»º¤ÎÉô Åö´ü½ãÍø±× **********/
for ($c = 1; $c <= 6; $c++) {           // ¥«¥é¥à¿ô (´ü¼ó Á°¡¹·î Á°·î Åö·î Á°·îÁý¸º ´ü´ÖÁý¸º)
    $profit_sum[$c] = $data[42][$c];
}
/********** ½ã»ñ»º¤ÎÉô ¹ç·× **********/
for ($c = 1; $c <= 6; $c++) {           // ¥«¥é¥à¿ô (´ü¼ó Á°¡¹·î Á°·î Åö·î Á°·îÁý¸º ´ü´ÖÁý¸º)
    $all_capital_sum[$c]      = ($capital_sum[$c] + $hcapital_sum[$c] + $jcapital_sum[$c] + $profit_sum[$c]);
    $all_capital_sum_view[$c] = number_format($all_capital_sum[$c] / $tani, $keta);
}

/********** ÉéºÄµÚ¤Ó½ã»ñ»º¤ÎÉô **********/
for ($c = 1; $c <= 6; $c++) {           // ¥«¥é¥à¿ô (´ü¼ó Á°¡¹·î Á°·î Åö·î Á°·îÁý¸º ´ü´ÖÁý¸º)
    $all_dcapital_sum[$c]      = ($all_debt_sum[$c] + $all_capital_sum[$c]);
    $all_dcapital_sum_view[$c] = number_format($all_dcapital_sum[$c] / $tani, $keta);
}


/********** »ñ»º¤ÎÉô Î®Æ°»ñ»º¤Î¸½¶âµÚ¤ÓÍÂ¶â **********/
/********** »ñ»º¤ÎÉô Î®Æ°»ñ»º¤ÎÇä³Ý¶â **********/
/********** »ñ»º¤ÎÉô Î®Æ°»ñ»º¤ÎÃª²·»ñ»º **********/
/********** »ñ»º¤ÎÉô Î®Æ°»ñ»º¤ÎÁ°Ê§ÈñÍÑ **********/
/********** »ñ»º¤ÎÉô Î®Æ°»ñ»º¤Î·«±äÀÇ¶â»ñ»º **********/
/********** »ñ»º¤ÎÉô Î®Æ°»ñ»º¤ÎÃ»´üÂßÉÕ¶â **********/
/********** »ñ»º¤ÎÉô Î®Æ°»ñ»º¤ÎÌ¤¼ýÆþ¶â **********/
/********** »ñ»º¤ÎÉô Î®Æ°»ñ»º¤ÎÌ¤¼ý¾ÃÈñÀÇÅù **********/
/********** »ñ»º¤ÎÉô Î®Æ°»ñ»º¤ÎÎ©ÂØ¶â **********/
/********** »ñ»º¤ÎÉô Î®Æ°»ñ»º¤Î²¾Ê§¾ÃÈñÀÇÅù **********/
/********** »ñ»º¤ÎÉô Î®Æ°»ñ»º¤Î²¾Ê§¶â **********/
/********** »ñ»º¤ÎÉô Î®Æ°»ñ»º¤Î¤½¤ÎÂ¾Î®Æ°»ñ»º **********/
/********** »ñ»º¤ÎÉô Î®Æ°»ñ»º¤ÎÂßÅÝ°úÅö¶â **********/
    ///// ¤³¤ì¤Ï¸½ºß¤ÏÌµ¤¤
/********** »ñ»º¤ÎÉô Î®Æ°»ñ»º¤Î·× **********/

/********** »ñ»º¤ÎÉô ¸ÇÄê»ñ»º¤ÎÍ­·Á¸ÇÄê»ñ»º **********/
/********** »ñ»º¤ÎÉô ¸ÇÄê»ñ»º¤Î·úÀß²¾´ªÄê **********/
/********** »ñ»º¤ÎÉô ¸ÇÄê»ñ»º¤Î¸º²Á½þµÑÎß·×³Û **********/
/********** »ñ»º¤ÎÉô ¸ÇÄê»ñ»º¤ÎÍ­·Á¸ÇÄê»ñ»º¹ç·× **********/
/********** »ñ»º¤ÎÉô ¸ÇÄê»ñ»º¤Î¥½¥Õ¥È¥¦¥§¥¢ **********/
/********** »ñ»º¤ÎÉô ¸ÇÄê»ñ»º¤ÎÅÅÏÃ²ÃÆþ¸¢ **********/
/********** »ñ»º¤ÎÉô ¸ÇÄê»ñ»º¤ÎÌµ·Á¸ÇÄê»ñ»º¹ç·× **********/
/********** »ñ»º¤ÎÉô ¸ÇÄê»ñ»º¤Î·× **********/

/********** »ñ»º¤ÎÉô Åê»ñ¤½¤ÎÂ¾¤Î»ñ»º¤ÎÄ¹´üÂßÉÕ¶â **********/
/********** »ñ»º¤ÎÉô Åê»ñ¤½¤ÎÂ¾¤Î»ñ»º¤ÎÄ¹´üÁ°Ê§ÈñÍÑ **********/
/********** »ñ»º¤ÎÉô Åê»ñ¤½¤ÎÂ¾¤Î»ñ»º¤Î·«±äÀÇ¶â»ñ»º **********/
/********** »ñ»º¤ÎÉô Åê»ñ¤½¤ÎÂ¾¤Î»ñ»º¤Îº¹ÆþÉß¶âÊÝ¾Ú¶â **********/
/********** »ñ»º¤ÎÉô Åê»ñ¤½¤ÎÂ¾¤Î»ñ»º¤Î¤½¤ÎÂ¾¤ÎÅê»ñÅù **********/
/********** »ñ»º¤ÎÉô Åê»ñ¤½¤ÎÂ¾¤Î»ñ»º¤ÎÂßÅÝ°úÅö¶â **********/
    ///// ¤³¤ì¤Ï¸½ºß¤ÏÌµ¤¤
/********** »ñ»º¤ÎÉô Åê»ñ¤½¤ÎÂ¾¤Î»ñ»º¤Î·× **********/

/********** »ñ»º¤ÎÉô ¹ç·× **********/

/********** ÉéºÄ¤ÎÉô Î®Æ°ÉéºÄ¤Î»ÙÊ§¼ê·Á **********/
/********** ÉéºÄ¤ÎÉô Î®Æ°ÉéºÄ¤ÎÇã³Ý¶â **********/
/********** ÉéºÄ¤ÎÉô Î®Æ°ÉéºÄ¤ÎÃ»´ü¼ÚÆþ¶â **********/
/********** ÉéºÄ¤ÎÉô Î®Æ°ÉéºÄ¤ÎÌ¤Ê§¶â **********/
/********** ÉéºÄ¤ÎÉô Î®Æ°ÉéºÄ¤ÎÌ¤Ê§¾ÃÈñÀÇ **********/
/********** ÉéºÄ¤ÎÉô Î®Æ°ÉéºÄ¤ÎÌ¤Ê§Ë¡¿ÍÀÇÅù **********/
/********** ÉéºÄ¤ÎÉô Î®Æ°ÉéºÄ¤ÎÌ¤Ê§ÈñÍÑ **********/
/********** ÉéºÄ¤ÎÉô Î®Æ°ÉéºÄ¤ÎÍÂ¤ê¶â **********/
/********** ÉéºÄ¤ÎÉô Î®Æ°ÉéºÄ¤Î²¾Ê§¾ÃÈñÀÇÅù **********/
/********** ÉéºÄ¤ÎÉô Î®Æ°ÉéºÄ¤Î¤½¤ÎÂ¾¤ÎÎ®Æ°ÉéºÄ **********/
/********** ÉéºÄ¤ÎÉô Î®Æ°ÉéºÄ¤Î¾ÞÍ¿°úÅö¶â **********/
/********** ÉéºÄ¤ÎÉô Î®Æ°ÉéºÄ¤Î·× **********/

/********** ÉéºÄ¤ÎÉô ¸ÇÄêÉéºÄ¤ÎÄ¹´ü¼ÚÆþ¶â **********/
/********** ÉéºÄ¤ÎÉô ¸ÇÄêÉéºÄ¤ÎÂà¿¦µëÉÕ°úÅö¶â **********/
/********** ÉéºÄ¤ÎÉô ¸ÇÄêÉéºÄ¤ÎÄ¹´ü¼ÚÆþ¶â **********/
/********** ÉéºÄ¤ÎÉô ¸ÇÄêÉéºÄ¤Î¤½¤ÎÂ¾¤Î¸ÇÄêÉéºÄ **********/
/********** ÉéºÄ¤ÎÉô ¸ÇÄêÉéºÄ¤Î·× **********/

/********** ÉéºÄ¤ÎÉô ÉéºÄ¤ÎÉô¹ç·× **********/


/********** ½ã»ñ»º¤ÎÉô »ñËÜ¶â¤Î»ñËÜ¶â **********/
/********** ½ã»ñ»º¤ÎÉô »ñËÜ¶â¤Î·× **********/

/********** ½ã»ñ»º¤ÎÉô »ñËÜ¾êÍ¾¶â¤Î»ñËÜ½àÈ÷¶â **********/
/********** ½ã»ñ»º¤ÎÉô »ñËÜ¾êÍ¾¶â¤Î¤½¤ÎÂ¾»ñËÜ¾êÍ¾¶â **********/
/********** ½ã»ñ»º¤ÎÉô »ñËÜ¾êÍ¾¶â¤Î·× **********/

/********** ½ã»ñ»º¤ÎÉô Íø±×¾êÍ¾¶â¤ÎÍø±×½àÈ÷¶â **********/
/********** ½ã»ñ»º¤ÎÉô Íø±×¾êÍ¾¶â¤Î¤½¤ÎÂ¾Íø±×¾êÍ¾¶â **********/
/********** ½ã»ñ»º¤ÎÉô Íø±×¾êÍ¾¶â¤ÎÃæ´ÖÇÛÅöÀÑÎ©¶â **********/
/********** ½ã»ñ»º¤ÎÉô Íø±×¾êÍ¾¶â¤ÎÆÃÊÌ½þµÑÀÑÎ©¶â **********/
/********** ½ã»ñ»º¤ÎÉô Íø±×¾êÍ¾¶â¤Î·«±äÍø±×¾êÍ¾¶â **********/
/********** ½ã»ñ»º¤ÎÉô Íø±×¾êÍ¾¶â¤Î·× **********/
/********** ½ã»ñ»º¤ÎÉô Åö´ü½ãÍø±× **********/

/********** ½ã»ñ»º¤ÎÉô ½ã»ñ»º¤ÎÉô¹ç·× **********/

/********** ÉéºÄµÚ¤Ó½ã»ñ»º¤ÎÉô **********/


    //// Åö·î¥Ç¡¼¥¿¤ÎÅÐÏ¿
if (isset($_POST['input_data'])) {
    ///////// ¹àÌÜ¤È¥¤¥ó¥Ç¥Ã¥¯¥¹¤Î´ØÏ¢ÉÕ¤±
    $item = array();
    $item[0]   = "¸½¶âµÚ¤ÓÍÂ¶â";
    $item[1]   = "Çä³Ý¶â";
    $item[2]   = "Ãª²·»ñ»º";
    $item[3]   = "Á°Ê§ÈñÍÑ";
    $item[4]   = "Î®Æ°·«±äÀÇ¶â»ñ»º";
    $item[5]   = "Ì¤¼ý¼ý±×";
    $item[6]   = "Ã»´üÂßÉÕ¶â";
    $item[7]   = "Ì¤¼ýÆþ¶â";
    $item[8]   = "Ì¤¼ý¾ÃÈñÀÇÅù";
    $item[9]   = "Ì¤¼ýË¡¿ÍÀÇÅù";
    $item[10]   = "Î©ÂØ¶â";
    $item[11]  = "²¾Ê§¾ÃÈñÀÇÅù";
    $item[12]  = "Á°Ê§¾ÃÈñÀÇ";
    $item[13]  = "²¾Ê§¶â";
    $item[14]  = "¤½¤ÎÂ¾Î®Æ°»ñ»º";
    $item[15]  = "Î®Æ°ÂßÅÝ°úÅö¶â";
    $item[16]  = "Î®Æ°»ñ»º·×";
    $item[17]  = "Í­·Á¸ÇÄê»ñ»º";
    $item[18]  = "·úÀß²¾´ªÄê";
    $item[19]  = "¸º²Á½þµÑÎß·×³Û";
    $item[20]  = "Í­·Á¸ÇÄê»ñ»º·×";
    $item[21]  = "¥½¥Õ¥È¥¦¥§¥¢";
    $item[22]  = "ÅÅÏÃ²ÃÆþ¸¢";
    $item[23]  = "»ÜÀßÍøÍÑ¸¢";
    $item[24]  = "Ìµ·Á¸ÇÄê»ñ»º·×";
    $item[25]  = "¸ÇÄê»ñ»º·×";
    $item[26]  = "Ä¹´üÂßÉÕ¶â";
    $item[27]  = "Ä¹´üÁ°Ê§ÈñÍÑ";
    $item[28]  = "¸ÇÄê·«±äÀÇ¶â»ñ»º";
    $item[29]  = "º¹ÆþÉß¶âÊÝ¾Ú¶â";
    $item[30]  = "¤½¤ÎÂ¾¤ÎÅê»ñÅù";
    $item[31]  = "¸ÇÄêÂßÅÝ°úÅö¶â";
    $item[32]  = "Åê»ñ¤½¤ÎÂ¾¤Î»ñ»º·×";
    $item[33]  = "»ñ»º¤ÎÉô¹ç·×";
    $item[34]  = "»ÙÊ§¼ê·Á";
    $item[35]  = "Çã³Ý¶â";
    $item[36]  = "Ã»´ü¼ÚÆþ¶â";
    $item[37]  = "¥ê¡¼¥¹ºÄÌ³(Ã»´ü)";
    $item[38]  = "Ì¤Ê§¶â";
    $item[39]  = "Ì¤Ê§¾ÃÈñÀÇ";
    $item[40]  = "Ì¤Ê§Ë¡¿ÍÀÇÅù";
    $item[41]  = "Ì¤Ê§ÈñÍÑ";
    $item[42]  = "ÍÂ¤ê¶â";
    $item[43]  = "²¾¼õ¾ÃÈñÀÇÅù";
    $item[44]  = "¤½¤ÎÂ¾¤ÎÎ®Æ°ÉéºÄ";
    $item[45]  = "¾ÞÍ¿°úÅö¶â";
    $item[46]  = "Î®Æ°ÉéºÄ·×";
    $item[47]  = "Ä¹´ü¼ÚÆþ¶â";
    $item[48]  = "¥ê¡¼¥¹ºÄÌ³(Ä¹´ü)";
    $item[49]  = "Ä¹´üÌ¤Ê§¶â";
    $item[50]  = "Âà¿¦µëÉÕ°úÅö¶â";
    $item[51]  = "¤½¤ÎÂ¾¤Î¸ÇÄêÉéºÄ";
    $item[52]  = "¸ÇÄêÉéºÄ·×";
    $item[53]  = "ÉéºÄ¤ÎÉô¹ç·×";
    $item[54]  = "»ñËÜ¶â";
    $item[55]  = "»ñËÜ¶â·×";
    $item[56]  = "»ñËÜ½àÈ÷¶â";
    $item[57]  = "¤½¤ÎÂ¾»ñËÜ¾êÍ¾¶â";
    $item[58]  = "»ñËÜ¾êÍ¾¶â·×";
    $item[59]  = "Íø±×½àÈ÷¶â";
    $item[60]  = "¤½¤ÎÂ¾Íø±×¾êÍ¾¶â";
    $item[61]  = "·«±ÛÍø±×¾êÍ¾¶â";
    $item[62]  = "Íø±×¾êÍ¾¶â·×";
    $item[63]  = "Åö´ü½ãÍø±×";
    $item[64]  = "½ã»ñ»º¤ÎÉô¹ç·×";
    $item[65]  = "ÉéºÄµÚ¤Ó½ã»ñ»º¤ÎÉô";
    ///////// ³Æ¥Ç¡¼¥¿¤ÎÊÝ´É
    ///// É½¼¨¥Ç¡¼¥¿¤«¤é¥«¥ó¥Þ¤òºï½ü¤¹¤ë
    ///// $number = str_replace(',','',$english_format_number);
    $input_data = array();
    $input_data[0]   = str_replace(',','',$view_data[1][4]);   // ¸½¶âµÚ¤ÓÍÂ¶â
    $input_data[1]   = str_replace(',','',$view_data[2][4]);   // Çä³Ý¶â
    $input_data[2]   = str_replace(',','',$view_data[3][4]);   // Ãª²·»ñ»º
    $input_data[3]   = str_replace(',','',$view_data[5][4]);   // Á°Ê§ÈñÍÑ
    $input_data[4]   = str_replace(',','',$view_data[6][4]);   // Î®Æ°·«±äÀÇ¶â»ñ»º
    $input_data[5]   = str_replace(',','',$month_mishu_shueki_view);  // Ì¤¼ý¼ý±×
    $input_data[6]   = "";   // Ã»´üÂßÉÕ¶â
    $input_data[7]   = str_replace(',','',$view_data[7][4]);   // Ì¤¼ýÆþ¶â
    $input_data[8]   = str_replace(',','',$view_data[43][4]);   // Ì¤¼ý¾ÃÈñÀÇÅù
    $input_data[9]   = str_replace(',','',$month_mihojin_view);   // Ì¤¼ýË¡¿ÍÀÇÅù
    $input_data[10]  = str_replace(',','',$view_data[8][4]);   // Î©ÂØ¶â
    $input_data[11]  = str_replace(',','',$view_data[9][4]);   // ²¾Ê§¾ÃÈñÀÇÅù
    $input_data[12]   = str_replace(',','',$month_mae_syohi_view);  // Á°Ê§¾ÃÈñÀÇ
    $input_data[13]  = str_replace(',','',$view_data[10][4]);   // ²¾Ê§¶â
    $input_data[14]  = str_replace(',','',$view_data[11][4]);   // ¤½¤ÎÂ¾Î®Æ°»ñ»º
    $input_data[15]  = "";   // ÂßÅÝ°úÅö¶â
    $input_data[16]  = str_replace(',','',$rasset_sum_view[4]);   // Î®Æ°»ñ»º·×
    $input_data[17]  = str_replace(',','',$view_data[12][4]);   // Í­·Á¸ÇÄê»ñ»º
    $input_data[18]  = str_replace(',','',$view_data[17][4]);   // ·úÀß²¾´ªÄê
    $input_data[19]  = str_replace(',','',$view_data[18][4]);   // ¸º²Á½þµÑÎß·×³Û
    $input_data[20]  = str_replace(',','',$yasset_sum_view[4]);   // Í­·Á¸ÇÄê»ñ»º·×
    $input_data[21]  = str_replace(',','',$view_data[20][4]);   // ¥½¥Õ¥È¥¦¥§¥¢
    $input_data[22]  = str_replace(',','',$view_data[19][4]);   // ÅÅÏÃ²ÃÆþ¸¢
    $input_data[23]  = str_replace(',','',$month_sisetu_view);   // »ÜÀßÍøÍÑ¸¢
    $input_data[24]  = str_replace(',','',$masset_sum_view[4]);   // Ìµ·Á¸ÇÄê»ñ»º·×
    $input_data[25]  = str_replace(',','',$kasset_sum_view[4]);   // ¸ÇÄê»ñ»º·×
    $input_data[26]  = str_replace(',','',$view_data[22][4]);   // Ä¹´üÂßÉÕ¶â
    $input_data[27]  = str_replace(',','',$view_data[23][4]);   // Ä¹´üÁ°Ê§ÈñÍÑ
    $input_data[28]  = str_replace(',','',$view_data[24][4]);   // ·«±äÀÇ¶â»ñ»º
    $input_data[29]  = str_replace(',','',$view_data[25][4]);   // º¹ÆþÉß¶âÊÝ¾Ú¶â
    $input_data[30]  = str_replace(',','',$view_data[21][4]);   // ¤½¤ÎÂ¾¤ÎÅê»ñÅù
    $input_data[31]  = "";   // ÂßÅÝ°úÅö¶â
    $input_data[32]  = str_replace(',','',$tasset_sum_view[4]);   // Åê»ñ¤½¤ÎÂ¾¤Î»ñ»º·×
    $input_data[33]  = str_replace(',','',$all_asset_sum_view[4]);   // »ñ»º¤ÎÉô¹ç·×
    $input_data[34]  = str_replace(',','',$view_data[26][4]);   // »ÙÊ§¼ê·Á
    $input_data[35]  = str_replace(',','',$view_data[27][4]);   // Çã³Ý¶â
    $input_data[36]  = str_replace(',','',$view_data[28][4]);   // Ã»´ü¼ÚÆþ¶â
    $input_data[37]  = str_replace(',','',$month_lease_short_view);   // ¥ê¡¼¥¹ºÄÌ³(Ã»´ü)
    $input_data[38]  = str_replace(',','',$view_data[29][4]);   // Ì¤Ê§¶â
    $input_data[39]  = str_replace(',','',$view_data[30][4]);   // Ì¤Ê§¾ÃÈñÀÇ
    $input_data[40]  = str_replace(',','',$view_data[31][4]);   // Ì¤Ê§Ë¡¿ÍÀÇÅù
    $input_data[41]  = str_replace(',','',$view_data[32][4]);   // Ì¤Ê§ÈñÍÑ
    $input_data[42]  = str_replace(',','',$view_data[34][4]);   // ÍÂ¤ê¶â
    $input_data[43]  = str_replace(',','',$view_data[35][4]);   // ²¾¼õ¾ÃÈñÀÇÅù
    $input_data[44]  = str_replace(',','',$view_data[33][4]);   // ¤½¤ÎÂ¾¤ÎÎ®Æ°ÉéºÄ
    $input_data[45]  = str_replace(',','',$view_data[36][4]);   // ¾ÞÍ¿°úÅö¶â
    $input_data[46]  = str_replace(',','',$rdebt_sum_view[4]);   // Î®Æ°ÉéºÄ·×
    $input_data[47]  = str_replace(',','',$view_data[37][4]);   // Ä¹´ü¼ÚÆþ¶â
    $input_data[48]  = str_replace(',','',$month_lease_long_view);   // ¥ê¡¼¥¹ºÄÌ³(Ä¹´ü)
    $input_data[49]  = str_replace(',','',$month_mihalong_view);   // Ä¹´üÌ¤Ê§¶â
    $input_data[50]  = str_replace(',','',$view_data[38][4]);   // Âà¿¦µëÉÕ°úÅö¶â
    $input_data[51]  = "";   // ¤½¤ÎÂ¾¤Î¸ÇÄêÉéºÄ
    $input_data[52]  = str_replace(',','',$kdebt_sum_view[4]);   // ¸ÇÄêÉéºÄ·×
    $input_data[53]  = str_replace(',','',$all_debt_sum_view[4]);   // ÉéºÄ¤ÎÉô¹ç·×
    $input_data[54]  = str_replace(',','',$view_data[39][4]);   // »ñËÜ¶â
    $input_data[55]  = str_replace(',','',$view_data[39][4]);   // »ñËÜ¶â·×
    $input_data[56]  = str_replace(',','',$month_sjyunbi_view);   // »ñËÜ½àÈ÷¶â
    $input_data[57]  = str_replace(',','',$month_s_sjyunbi_view);   // ¤½¤ÎÂ¾»ñËÜ¾êÍ¾¶â
    $input_data[58]  = str_replace(',','',$hcapital_sum_view[4]);   // »ñËÜ¾êÍ¾¶â·×
    $input_data[59]  = "";   // Íø±×½àÈ÷¶â
    $input_data[60]  = str_replace(',','',$month_s_rjyunbi_view);   // ¤½¤ÎÂ¾Íø±×¾êÍ¾¶â
    $input_data[61]  = str_replace(',','',$view_data[41][4]);   // ·«±ÛÍø±×¾êÍ¾¶â
    $input_data[62]  = str_replace(',','',$jcapital_sum_view[4]);   // Íø±×¾êÍ¾¶â·×
    $input_data[63]  = str_replace(',','',$view_data[42][4]);   // Åö´ü½ãÍø±×
    $input_data[64]  = str_replace(',','',$all_capital_sum_view[4]);   // ½ã»ñ»º¤ÎÉô¹ç·×
    $input_data[65]  = str_replace(',','',$all_dcapital_sum_view[4]);   // ÉéºÄµÚ¤Ó½ã»ñ»º¤ÎÉô
    
    insert_date($item,$yyyymm,$input_data);
}
function insert_date($item,$yyyymm,$input_data) 
{
    for ($i = 0; $i < 66; $i++) {
        //$item_in     = array();
        //$item_in[$i] = $item[$i];
        //$input_data[$i][$sec] = str_replace(',','',$input_data[$i][$sec]);
        $query = sprintf("select kin from profit_loss_bs_history where pl_bs_ym=%d and note='%s'", $yyyymm, $item[$i]);
        $res_in = array();
        if (getResult2($query,$res_in) <= 0) {
            /////////// begin ¥È¥é¥ó¥¶¥¯¥·¥ç¥ó³«»Ï
            if ($con = db_connect()) {
                query_affected_trans($con, "begin");
            } else {
                $_SESSION["s_sysmsg"] .= "¥Ç¡¼¥¿¥Ù¡¼¥¹¤ËÀÜÂ³¤Ç¤­¤Þ¤»¤ó";
                exit();
            }
            ////////// Insert Start
            $query = sprintf("insert into profit_loss_bs_history (pl_bs_ym, kin, note, last_date, last_user) values (%d, %d, '%s', CURRENT_TIMESTAMP, '%s')", $yyyymm, $input_data[$i], $item[$i], $_SESSION['User_ID']);
            if (query_affected_trans($con, $query) <= 0) {
                $_SESSION["s_sysmsg"] .= sprintf("%s¤Î¿·µ¬ÅÐÏ¿¤Ë¼ºÇÔ<br> %d", $item[$i], $yyyymm);
                query_affected_trans($con, "rollback");     // transaction rollback
                exit();
            }
            /////////// commit ¥È¥é¥ó¥¶¥¯¥·¥ç¥ó½ªÎ»
            query_affected_trans($con, "commit");
            $_SESSION["s_sysmsg"] = sprintf("<font color='yellow'>%d Âß¼ÚÂÐ¾ÈÉ½¥Ç¡¼¥¿ ¿·µ¬ ÅÐÏ¿´°Î»</font>",$yyyymm);
        } else {
            /////////// begin ¥È¥é¥ó¥¶¥¯¥·¥ç¥ó³«»Ï
            if ($con = db_connect()) {
                query_affected_trans($con, "begin");
            } else {
                $_SESSION["s_sysmsg"] .= "¥Ç¡¼¥¿¥Ù¡¼¥¹¤ËÀÜÂ³¤Ç¤­¤Þ¤»¤ó";
                exit();
            }
            ////////// UPDATE Start
            $query = sprintf("update profit_loss_bs_history set kin=%d, last_date=CURRENT_TIMESTAMP, last_user='%s' where pl_bs_ym=%d and note='%s'", $input_data[$i], $_SESSION['User_ID'], $yyyymm, $item[$i]);
            if (query_affected_trans($con, $query) <= 0) {
                $_SESSION["s_sysmsg"] .= sprintf("%s¤ÎUPDATE¤Ë¼ºÇÔ<br> %d", $item[$i], $yyyymm);
                query_affected_trans($con, "rollback");     // transaction rollback
                exit();
            }
            /////////// commit ¥È¥é¥ó¥¶¥¯¥·¥ç¥ó½ªÎ»
            query_affected_trans($con, "commit");
            $_SESSION["s_sysmsg"] = sprintf("<font color='yellow'>%d Âß¼ÚÂÐ¾ÈÉ½¥Ç¡¼¥¿ ÊÑ¹¹ ´°Î»</font>",$yyyymm);
        }
    }
    $_SESSION["s_sysmsg"] .= "Åö·î¤Î¥Ç¡¼¥¿¤òÅÐÏ¿¤·¤Þ¤·¤¿¡£";
}
/////////// HTML Header ¤ò½ÐÎÏ¤·¤Æ¥­¥ã¥Ã¥·¥å¤òÀ©¸æ
$menu->out_html_header();
?>
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=EUC-JP">
<meta http-equiv="Content-Style-Type" content="text/css">
<title><?= $menu->out_title() ?></title>
<?= $menu->out_site_java() ?>
<?= $menu->out_css() ?>
<?= $menu->out_jsBaseClass() ?>

<style type='text/css'>
<!--
select {
    background-color:teal;
    color:white;
}
textarea {
    background-color:black;
    color:white;
}
input.sousin {
    background-color:red;
}
input.text {
    background-color:black;
    color:white;
}
.pt8 {
    font:normal 8pt;
    font-family: monospace;
}
.pt10 {
    font:normal 10pt;
    font-family: monospace;
}
.pt10b {
    font:bold 10pt;
    font-family: monospace;
}
.pt12b {
    font:bold 12pt;
    font-family: monospace;
}
.title_font {
    font:bold 13.5pt;
    font-family: monospace;
}
.today_font {
    font-size: 10.5pt;
    font-family: monospace;
}
.corporate_name {
    font:bold 10pt;
    font-family: monospace;
}
.margin0 {
    margin:0%;
}
.OnOff_font {
    font-size:     8.5pt;
    font-family:   monospace;
}
-->
</style>
</head>
<body>
    <center>
<?= $menu->out_title_border() ?>
        <table width='100%' border='1' cellspacing='1' cellpadding='1'>
            <tr>
                <td colspan='3' bgcolor='#d6d3ce' align='center' class='corporate_name'>
                    <?=$menu->out_caption(), "\n"?>
                </td>
                <form method='post' action='<?php echo $menu->out_self() ?>'>
                    <td colspan='15' bgcolor='#d6d3ce' align='right' class='pt10'>
                        Ã±°Ì
                        <select name='taisyaku_tani' class='pt10'>
                        <?php
                            if ($tani == 1000)
                                echo "<option value='1000' selected>¡¡Àé±ß</option>\n";
                            else
                                echo "<option value='1000'>¡¡Àé±ß</option>\n";
                            if ($tani == 1)
                                echo "<option value='1' selected>¡¡¡¡±ß</option>\n";
                            else
                                echo "<option value='1'>¡¡¡¡±ß</option>\n";
                            if ($tani == 1000000)
                                echo "<option value='1000000' selected>É´Ëü±ß</option>\n";
                            else
                                echo "<option value='1000000'>É´Ëü±ß</option>\n";
                            if ($tani == 10000)
                                echo "<option value='10000' selected>¡¡Ëü±ß</option>\n";
                            else
                                echo "<option value='10000'>¡¡Ëü±ß</option>\n";
                            if($tani == 100000)
                                echo "<option value='100000' selected>½½Ëü±ß</option>\n";
                            else
                                echo "<option value='100000'>½½Ëü±ß</option>\n";
                        ?>
                        </select>
                        ¾¯¿ô·å
                        <select name='keihi_keta' class='pt10'>
                        <?php
                            if ($keta == 0)
                                echo "<option value='0' selected>£°·å</option>\n";
                            else
                                echo "<option value='0'>£°·å</option>\n";
                            if ($keta == 3)
                                echo "<option value='3' selected>£³·å</option>\n";
                            else
                                echo "<option value='3'>£³·å</option>\n";
                            if ($keta == 6)
                                echo "<option value='6' selected>£¶·å</option>\n";
                            else
                                echo "<option value='6'>£¶·å</option>\n";
                            if ($keta == 1)
                                echo "<option value='1' selected>£±·å</option>\n";
                            else
                                echo "<option value='1'>£±·å</option>\n";
                            if ($keta == 2)
                                echo "<option value='2' selected>£²·å</option>\n";
                            else
                                echo "<option value='2'>£²·å</option>\n";
                            if ($keta == 4)
                                echo "<option value='4' selected>£´·å</option>\n";
                            else
                                echo "<option value='4'>£´·å</option>\n";
                            if ($keta == 5)
                                echo "<option value='5' selected>£µ·å</option>\n";
                            else
                                echo "<option value='5'>£µ·å</option>\n";
                        ?>
                        </select>
                        <input class='pt10b' type='submit' name='return' value='Ã±°ÌÊÑ¹¹'>
                        <?php
                        if ($_SESSION['User_ID'] == '300144') {
                            if ($keta == 0 && $tani == 1) {
                        ?>
                            &nbsp;
                            <input class='pt10b' type='submit' name='input_data' value='Åö·î¥Ç¡¼¥¿ÅÐÏ¿'>
                        <?php
                            } else {
                        ?>
                            <input class='pt10b' type='submit' name='input_data' value='Åö·î¥Ç¡¼¥¿ÅÐÏ¿' disabled>
                        <?php
                            }
                        }
                        ?>
                    </td>
                </form>
            </tr>
        </table>
        <?php
            //  bgcolor='#ceffce' ²«ÎÐ
            //  bgcolor='#ffffc6' Çö¤¤²«¿§
            //  bgcolor='#d6d3ce' Win ¥°¥ì¥¤
        ?>
    <table width='100%' bgcolor='#d6d3ce' align='left' cellspacing="0" cellpadding="3" border='1'>
        <tr>
        <td>
        <table width='50%' bgcolor='#d6d3ce' align='left' cellspacing="0" cellpadding="3" border='1'>
            <TBODY>
                <tr>
                    <td colspan='3' width='200' align='center' class='pt10b' bgcolor='#ceffce'>²Ê¡¡¡¡¡¡ÌÜ</td>
                    <td nowrap align='center' class='pt10b' bgcolor='#ceffce'>´ü¡¡¡¡¼ó</td>
                    <td nowrap align='center' class='pt10b' bgcolor='#ceffce'><?php echo $p2_ym ?></td>
                    <td nowrap align='center' class='pt10b' bgcolor='#ceffce'><?php echo $p1_ym ?></td>
                    <td nowrap align='center' class='pt10b' bgcolor='#ceffce'><?php echo $yyyymm ?></td>
                    <td nowrap align='center' class='pt8'   bgcolor='#ceffce'>ÂÐÁ°·îÁý¸º</td>
                    <td nowrap align='center' class='pt10' bgcolor='#ceffce'>´ü´ÖÁý¸º</td>
                </tr>
                <tr>
                    <td rowspan='35' width='10' align='center' valign='middle' class='pt10b' bgcolor='#ceffce'>»ñ»º¤ÎÉô</td>
                    <td rowspan='18' width='10' align='center' valign='middle' class='pt10b' bgcolor='#ffffc6'>Î®Æ°»ñ»º</td>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡¸½¶âµÚ¤ÓÍÂ¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[1][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[1][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[1][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[1][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[1][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[1][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡Çä¡¡ ³Ý ¡¡¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[2][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[2][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[2][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[2][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[2][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[2][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡Ãª ²· »ñ »º</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[3][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[3][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[3][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[3][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[3][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[3][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡Á° Ê§ Èñ ÍÑ</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[5][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[5][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[5][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[5][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[5][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[5][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡·«±äÀÇ¶â»ñ»º</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[6][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[6][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[6][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[6][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[6][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[6][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡Ì¤ ¼ý ¼ý ±×</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $premonth_mishu_shueki_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $ppmonth_mishu_shueki_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $pmonth_mishu_shueki_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $month_mishu_shueki_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $mishu_shueki_taizen_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $mishu_shueki_taikikan_view ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡Ã»´üÂßÉÕ¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td> <!-- Í¾Çò -->
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡Ì¤ ¼ý Æþ ¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[7][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[7][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[7][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[7][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[7][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[7][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡Ì¤¼ý¾ÃÈñÀÇÅù</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[43][1] ?></td> <!-- Í¾Çò -->
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[43][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[43][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[43][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[43][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[43][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡Ì¤¼ýË¡¿ÍÀÇÅù</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $premonth_mihojin_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $ppmonth_mihojin_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $pmonth_mihojin_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $month_mihojin_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $mihojin_taizen_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $mihojin_taikikan_view ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡Î©¡¡ ÂØ ¡¡¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[8][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[8][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[8][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[8][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[8][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[8][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡²¾Ê§¾ÃÈñÀÇÅù</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[9][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[9][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[9][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[9][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[9][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[9][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡Á°Ê§¾ÃÈñÀÇ</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $premonth_mae_syohi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $ppmonth_mae_syohi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $pmonth_mae_syohi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $month_mae_syohi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $mae_syohi_taizen_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $mae_syohi_taikikan_view ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡²¾ ¡¡Ê§¡¡ ¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[10][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[10][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[10][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[10][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[10][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[10][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡¤½¤ÎÂ¾Î®Æ°»ñ»º</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[11][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[11][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[11][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[11][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[11][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[11][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡ÂßÅÝ°úÅö¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td> <!-- Í¾Çò -->
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td> <!-- Í¾Çò -->
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='#ffffc6'>·×</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $rasset_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $rasset_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $rasset_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $rasset_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $rasset_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $rasset_sum_view[6] ?></td>
                </tr>
                <tr>
                    <td rowspan='9' width='10' align='center' valign='middle' class='pt10b' bgcolor='#ffffc6'>¸ÇÄê»ñ»º</td>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡Í­·Á¸ÇÄê»ñ»º</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[12][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[12][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[12][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[12][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[12][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[12][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡·úÀß²¾´ªÄê</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[17][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[17][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[17][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[17][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[17][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[17][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡¸º²Á½þµÑÎß·×³Û</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[18][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[18][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[18][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[18][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[18][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[18][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='#ffffc6'>Í­·Á¸ÇÄê»ñ»º ·×</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $yasset_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $yasset_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $yasset_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $yasset_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $yasset_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $yasset_sum_view[6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡¥½¥Õ¥È¥¦¥§¥¢</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[20][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[20][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[20][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[20][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[20][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[20][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡ÅÅÏÃ²ÃÆþ¸¢</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[19][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[19][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[19][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[19][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[19][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[19][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡»ÜÀßÍøÍÑ¸¢</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $premonth_sisetu_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $ppmonth_sisetu_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $pmonth_sisetu_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $month_sisetu_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $sisetu_taizen_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $sisetu_taikikan_view ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='#ffffc6'>Ìµ·Á¸ÇÄê»ñ»º ·×</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $masset_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $masset_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $masset_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $masset_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $masset_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $masset_sum_view[6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='#ffffc6'>·×</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $kasset_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $kasset_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $kasset_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $kasset_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $kasset_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $kasset_sum_view[6] ?></td>
                </tr>
                <tr>
                    <td rowspan='7' width='10' align='center' valign='middle' class='pt10b' bgcolor='#ffffc6'>Åê»ñ¤½¤ÎÂ¾¤Î»ñ»º</td>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡Ä¹´üÂßÉÕ¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[22][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[22][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[22][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[22][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[22][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[22][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡Ä¹´üÁ°Ê§ÈñÍÑ</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[23][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[23][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[23][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[23][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[23][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[23][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡·«±äÀÇ¶â»ñ»º</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[24][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[24][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[24][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[24][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[24][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[24][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡º¹ÆþÉß¶âÊÝ¾Ú¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[25][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[25][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[25][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[25][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[25][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[25][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡¤½¤ÎÂ¾¤ÎÅê»ñÅù</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[21][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[21][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[21][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[21][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[21][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[21][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>¡¡ÂßÅÝ°úÅö¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td> <!-- Í¾Çò -->
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='#ffffc6'>·×</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $tasset_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $tasset_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $tasset_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $tasset_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $tasset_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $tasset_sum_view[6] ?></td>
                </tr>
                <tr>
                    <td colspan='2' align='center' class='pt10b' bgcolor='#ceffce'>»ñ»º¤ÎÉô ¹ç·×</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_asset_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_asset_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_asset_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_asset_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_asset_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_asset_sum_view[6] ?></td>
                </tr>
            </TBODY>
        </table>
        </td>
        <td>
        <table width='50%' bgcolor='#d6d3ce' align='right' cellspacing="0" cellpadding="3" border='1'>
            <TBODY>
                <tr>
                    <td colspan='3' width='200' align='center' class='pt10b' bgcolor='#ceffce'>²Ê¡¡¡¡¡¡ÌÜ</td>
                    <td nowrap align='center' class='pt10b' bgcolor='#ceffce'>´ü¡¡¡¡¼ó</td>
                    <td nowrap align='center' class='pt10b' bgcolor='#ceffce'><?php echo $p2_ym ?></td>
                    <td nowrap align='center' class='pt10b' bgcolor='#ceffce'><?php echo $p1_ym ?></td>
                    <td nowrap align='center' class='pt10b' bgcolor='#ceffce'><?php echo $yyyymm ?></td>
                    <td nowrap align='center' class='pt8'   bgcolor='#ceffce'>ÂÐÁ°·îÁý¸º</td>
                    <td nowrap align='center' class='pt10'  bgcolor='#ceffce'>´ü´ÖÁý¸º</td>
                </tr>
                <tr>
                    <td rowspan='21' width='10' align='center' valign='middle' class='pt10b' bgcolor='#ceffce'>ÉéºÄ¤ÎÉô</td>
                    <td rowspan='14' width='10' align='center' valign='middle' class='pt10b' bgcolor='#ffffc6'>Î®Æ°ÉéºÄ</td>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>»Ù¡¡Ê§¡¡¼ê¡¡·Á</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[26][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[26][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[26][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[26][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[26][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[26][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>Çã¡¡¡¡³Ý¡¡¡¡¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[27][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[27][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[27][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[27][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[27][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[27][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>Ã» ´ü ¼Ú Æþ ¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[28][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[28][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[28][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[28][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[28][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[28][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>¥ê¡¼¥¹ºÄÌ³(Ã»´ü)</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $premonth_lease_short_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $ppmonth_lease_short_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $pmonth_lease_short_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $month_lease_short_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $lease_short_taizen_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $lease_short_taikikan_view ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>Ì¤¡¡¡¡Ê§¡¡¡¡¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[29][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[29][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[29][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[29][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[29][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[29][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>Ì¤ Ê§ ¾Ã Èñ ÀÇ</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[30][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[30][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[30][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[30][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[30][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[30][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>Ì¤Ê§Ë¡¿ÍÀÇÅù</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[31][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[31][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[31][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[31][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[31][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[31][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>Ì¤¡¡Ê§¡¡Èñ¡¡ÍÑ</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[32][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[32][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[32][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[32][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[32][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[32][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>ÍÂ¡¡¡¡¤ê¡¡¡¡¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[34][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[34][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[34][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[34][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[34][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[34][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>²¾¼õ¾ÃÈñÀÇÅù</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[35][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[35][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[35][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[35][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[35][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[35][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>¤½¤ÎÂ¾¤ÎÎ®Æ°ÉéºÄ</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[33][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[33][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[33][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[33][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[33][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[33][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>¾Þ Í¿ °ú Åö ¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[36][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[36][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[36][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[36][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[36][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[36][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='#ffffc6'>·×</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $rdebt_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $rdebt_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $rdebt_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $rdebt_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $rdebt_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $rdebt_sum_view[6] ?></td>
                </tr>
                <tr>
                    <td rowspan='6' width='10' align='center' valign='middle' class='pt10b' bgcolor='#ffffc6'>¸ÇÄêÉéºÄ</td>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>Ä¹ ´ü ¼Ú Æþ ¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[37][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[37][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[37][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[37][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[37][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[37][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>¥ê¡¼¥¹ºÄÌ³(Ä¹´ü)</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $premonth_lease_long_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $ppmonth_lease_long_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $pmonth_lease_long_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $month_lease_long_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $lease_long_taizen_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $lease_long_taikikan_view ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>Ä¹ ´ü Ì¤ Ê§ ¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $premonth_mihalong_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $ppmonth_mihalong_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $pmonth_mihalong_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $month_mihalong_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $mihalong_taizen_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $mihalong_taikikan_view ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>Âà¿¦µëÉÕ°úÅö¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[38][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[38][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[38][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[38][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[38][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[38][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>¤½¤ÎÂ¾¤Î¸ÇÄêÉéºÄ</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td> <!-- Í¾Çò -->
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='#ffffc6'>·×</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $kdebt_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $kdebt_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $kdebt_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $kdebt_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $kdebt_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $kdebt_sum_view[6] ?></td>
                </tr>
                <tr>
                    <td colspan='2' align='center' class='pt10b' bgcolor='#ceffce'>ÉéºÄ¤ÎÉô ¹ç·×</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_debt_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_debt_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_debt_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_debt_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_debt_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_debt_sum_view[6] ?></td>
                </tr>
                <tr>
                    <td rowspan='13' width='10' align='center' valign='middle' class='pt10b' bgcolor='#ceffce'>½ã»ñ»º¤ÎÉô</td><!--»ñËÜ¤ÎÉô-->
                    <td rowspan='3'  width='10' align='center' valign='middle' class='pt10b' bgcolor='#ffffc6'>»ñËÜ¶â</td>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>»ñ¡¡¡¡ËÜ¡¡¡¡¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[39][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[39][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[39][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[39][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[39][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[39][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>¡¡</td> <!-- Í¾Çò -->
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='#ffffc6'>»ñËÜ¶â ·×</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $view_data[39][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $view_data[39][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $view_data[39][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $view_data[39][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $view_data[39][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $view_data[39][6] ?></td>
                </tr>
                <tr>
                    <td rowspan='4' width='10' align='center' valign='middle' class='pt10b' bgcolor='#ffffc6'>»ñËÜ¾êÍ¾¶â</td>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>»ñ ËÜ ½à È÷ ¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $premonth_sjyunbi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $ppmonth_sjyunbi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $pmonth_sjyunbi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $month_sjyunbi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $sjyunbi_taizen_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $sjyunbi_taikikan_view ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>¤½¤ÎÂ¾»ñËÜ¾êÍ¾¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $premonth_s_sjyunbi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $ppmonth_s_sjyunbi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $pmonth_s_sjyunbi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $month_s_sjyunbi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $s_sjyunbi_taizen_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $s_sjyunbi_taikikan_view ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>¡¡</td> <!-- Í¾Çò -->
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='#ffffc6'>»ñËÜ¾êÍ¾¶â ·×</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $hcapital_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $hcapital_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $hcapital_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $hcapital_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $hcapital_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $hcapital_sum_view[6] ?></td>
                </tr>
                <tr>
                    <td rowspan='4' width='10' align='center' valign='middle' class='pt10b' bgcolor='#ffffc6'>Íø±×¾êÍ¾¶â</td>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>Íø ±× ½à È÷ ¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td> <!-- Í¾Çò -->
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                </tr>
                <!--
                <tr>
                    <td rowspan='4' width='10' align='center' valign='middle' class='pt10b' bgcolor='#ffffc6'>Íø±×¾êÍ¾¶â</td>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>Ãæ´ÖÇÛÅöÀÑÎ©¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>¡¡</td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>ÆÃÊÌ½þµÑÀÑÎ©¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[40][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[40][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[40][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[40][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[40][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[40][6] ?></td>
                </tr>
                -->
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>¤½¤ÎÂ¾Íø±×¾êÍ¾¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $premonth_s_rjyunbi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $ppmonth_s_rjyunbi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $pmonth_s_rjyunbi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $month_s_rjyunbi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $s_rjyunbi_taizen_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $s_rjyunbi_taikikan_view ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>·«±ÛÍø±×¾êÍ¾¶â</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[41][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[41][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[41][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[41][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[41][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[41][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='#ffffc6'>Íø±×¾êÍ¾¶â ·×</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $jcapital_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $jcapital_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $jcapital_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $jcapital_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $jcapital_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $jcapital_sum_view[6] ?></td>
                </tr>
                <tr>
                    <td colspan='2' nowrap align='center' class='pt10b' bgcolor='#ffffc6'>Åö ´ü ½ã Íø ±×</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $view_data[42][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $view_data[42][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $view_data[42][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $view_data[42][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $view_data[42][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $view_data[42][6] ?></td>
                </tr>
                <tr>
                    <td colspan='2' align='center' class='pt10b' bgcolor='#ceffce'>½ã»ñ»º¤ÎÉô ¹ç·×</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_capital_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_capital_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_capital_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_capital_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_capital_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_capital_sum_view[6] ?></td>
                </tr>
                <tr>
                    <td colspan='3' align='center' class='pt10b' bgcolor='#ceffce'>ÉéºÄµÚ¤Ó½ã»ñ»º¤ÎÉô</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_dcapital_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_dcapital_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_dcapital_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_dcapital_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_dcapital_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_dcapital_sum_view[6] ?></td>
                </tr>
            </TBODY>
        </table>
        </td>
        </tr>
    </table>
    </center>
</body>
</html>
