<?php
//////////////////////////////////////////////////////////////////////////////
// 月次損益関係 月次 貸借対照表                                             //
// Copyright(C) 2003-2020 Kazuhiro.Kobayashi tnksys@nitto-kohki.co.jp       //
// Changed history                                                          //
// 2003/02/13 Created   profit_loss_bs_act.php                              //
// 2003/02/23 date("Y/m/d H:m:s") → H:i:s のミス修正                       //
// 2003/02/27 セッション変数の単位を keihi_tani → taisyaku_tani へ         //
// 2003/02/28 小数点以下桁数を 0/3/6/1/2/4/5 へ 変更                        //
// 2003/03/04 文字サイズをブラウザーで変更できなくした title_font 等        //
// 2003/03/10 $kisyu_month $kisyu_rows が $ppmonth 等になっていた ミス      //
// 2003/03/11 Location: http → Location $url_referer に変更                //
//            メッセージを出力するため site_index site_id をコメント        //
//            にし parent.menu_site.を有効に変更                            //
// 2003/05/01 工場長からの指示で認証をAccount_groupから通常へ変更           //
// 2003/06/03 未収消費税に金額がある場合が年２回あるため修正３月と４月      //
// 2003/08/05 その他の科目に仮受金が発生したため t_row=44 に設定し修正      //
// 2003/12/04 負債の部で仮 払 消 費 税 → 仮 受 消 費 税 に訂正             //
// 2003/12/11 未収消費税で 2003/02 以前は未対応のため強制的に0で初期化      //
// 2004/05/11 左側のサイトメニューのオン・オフ ボタンを追加                 //
// 2004/07/05 無形固定資産の科目 施設利用権(F45)WAPLBSL=F45(2440) を追加    //
//                                  貸借対照表の科目の追加は半日かかります。//
// 2005/04/14 流動資産の科目 未収法人税等(F46)WAPLBSL=F46(1475) を追加      //
// 2005/10/27 MenuHeader class を使用して共通メニュー化及び認証方式へ変更   //
// 2006/06/07 資本の部→純資産の部へ 新会社法による名称変更                 //
// 2009/04/15 新規科目（5科目）追加 貯蔵品(F47)WAPLBSL=F47(1270)、          //
//            リース資産(F48)WAPLBSL=F48(2211)、リース債務(短期)(F49)       //
//            WAPLBSL=F49(4161)、リース債務(長期)(F50)WAPLBSL=F50(5180)、   //
//            長期未払金WAPLBSL=F51(5190) 商品及び製品WAPLBSL=F53(1230)     //
//            新規科目発生の場合はASにダミーのデータを作成すること。        //
//            F52～、最後に追加しないとプログラムが順番指定なのでずれる大谷 //
// 2009/06/16 新規科目 追加 資本準備金(F52) WAPLBSL=F52(7210)               //
//            新規科目発生の場合はWAPLBSLにダミーのデータを作成すること。   //
//            最後に追加しないとプログラムが順番指定なのでずれる       大谷 //
// 2009/07/10 棚卸資産の商法科目変更・追加に伴い棚卸をまとめる部分を変更    //
//            棚卸部分の$rはF○の値と同じなので注意                         //
//            商品及び製品(F53)WAPLBSL=F53(1230)                       大谷 //
// 2009/08/20 会社法にあわせ貸借対照表の構成変更及び新規科目追加            //
//            その他資本剰余金(F54)WAPLBSL=F54(7215)                        //
//            その他利益剰余金(F55)WAPLBSL=F55(7225)                   大谷 //
// 2010/10/06 11期上期分の特注(00222)売上高を調整する為                     //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2010/11/05 11期10月分の特注(00222)売上高を調整する為                     //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2010/12/03 11期11月分の特注(00222)売上高を調整する為                     //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2011/01/11 11期11月分の特注(00222)売上高を調整する為                     //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2011/04/06 11期の特注(00222)売上高を調整する為                           //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2011/04/20 11期の金型治工具を仮払金から棚卸資産への調整                  //
//            仮払金(9)→棚卸資産(2) 15,278,200円                      大谷 //
// 2011/07/06 12期6月の商管売上高を調整する為(+300,000)                     //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2011/08/03 12期7月の商管売上高を調整する為(-100,000)                     //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2011/09/05 12期8月の商管売上高を調整する為(-100,000)                     //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2011/10/08 12期9月の商管売上高を調整する為(+100,000)                     //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2011/10/18 12期上期(4月～9月は15278200、9月は20205550)を                 //
//            仮払金(9)→棚卸資産(2)に調整(貯蔵品)                     大谷 //
// 2011/11/04 12期10月の商管売上高を調整する為(+300,000)                    //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2011/12/05 12期11月の商管売上高を調整する為(-300,000)                    //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2012/01/24 経歴のデータ保管を追加（２期比較表で使用）               大谷 //
// 2012/02/03 12期1月の商管売上高を調整する為(100,000)                      //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2012/02/28 2012年1月 業務委託費 調整 リニア製造経費 +1,156,130円    大谷 //
//            未払金(28)、当期純利益(41)に調整                         大谷 //
//             ※ 平出横川派遣料 2月に逆調整を行うこと                      //
// 2012/03/05 12期1月の商管売上高を調整する為(100,000)                      //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整               //
//            2012年1月 業務委託費 調整 リニア製造経費 -1,156,130円 戻し    //
//            未払金(28)、当期純利益(41)に調整                         大谷 //
// 2012/04/02 03/05の商管調整を100,000円から200,000円に変更            大谷 //
// 2012/04/04 12期3月の商管売上高を調整する為(+100,000)                     //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2012/04/10 仮受消費税(34)の調整を未払消費税(29)に変更したが戻した   大谷 //
// 2012/05/07 13期4月の商管売上高を調整する為(-200,000)                     //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2012/06/05 13期5月の商管売上高を調整する為(+300,000)                     //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2012/07/05 13期6月の商管売上高を調整する為(-100,000)                     //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2012/07/11 第１四半期の調整を追加                                   大谷 //
// 2012/08/03 13期7月のリニア２重計上(2,440,675円)を調整               大谷 //
// 2012/09/05 繰越利益剰余金の調整を追加（中間or期末まで？）           大谷 //
// 2012/10/01 会社法にあわせ貸借対照表の構成変更及び新規科目追加？          //
//            その他の営業外費用(9310)                                 大谷 //
// 2012/10/03 暫定用に貯蔵品の調整を追加                               大谷 //
// 2012/10/09 貯蔵品の調整を確定版に変更                               大谷 //
// 2012/11/05 13期の商管売上高(期首残高)(-100,000)と                        //
//            13期7月のリニア２重計上(-2,440,675円)を調整するため           //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2012/12/05 13期の商管売上高(期首残高)(-100,000)と                        //
//            13期7月のリニア２重計上(-2,440,675円)を調整するため           //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2013/01/11 13期の商管売上高(期首残高)(-100,000)と                        //
//            13期7月のリニア２重計上(-2,440,675円)を調整するため           //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2013/01/12 商管売上高(期首残高)(-100,000)の調整は１２月以降行わなくいい  //
//            決算時に当期純利益と繰越利益剰余金の振替の条件を変える事 大谷 //
//            また、リニア２重計上は１月に伝票を入れるのでそこから無しで    //
//            その際、仮受消費税に調整を伝票で入れるので決算までは仮受から  //
//            未払消費税に振替える調整を入れる必要がある。                  //
// 2013/01/18 １月にリニア２重計上(-2,440,675円）の調整伝票を入れるが       //
//            決算時の消費税・当期純利益の振替処理が終わらないと正しい数字に//
//            ならない為調整を追加。３月振替完了時に忘れずにプログラムの    //
//            変更を行うこと。IF条件右側201303を201302へ変更           大谷 //
// 2013/03/05 ２月に仕切単価登録ミス発生。２月に調整追加（5,518,600）       //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2013/04/08 13期3月 圧造工具在庫確定の為、確定版と14期の調整を追加   大谷 //
// 2013/04/09 13期3月 当期純利益・消費税振替完了の為調整日付を変更     大谷 //
// 2013/05/28 2013/05より貯蔵品１点追加 ヤマハ単軸ロボット 336,600円   大谷 //
// 2013/10/03 暫定用に貯蔵品の調整を追加                               大谷 //
// 2013/10/08 14期9月 圧造工具在庫確定の為、確定と13期下期の調整を追加 大谷 //
// 2013/10/10 14期9月 未払消費税[29] を 未収消費税等へ振替             大谷 //
// 2013/11/06 14期10月の商管売上高を調整する為(+100,000)                    //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2013/12/04 14期10月の商管売上高調整の戻しの為、14期11月を調整(-100,000)  //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
//            ↑はいらなかったので削除                                 大谷 //
// 2014/01/10 14期12月の商管売上高を調整する為(+100,000)                    //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2014/02/05 14期1月の商管売上高を調整する為(+400,000)                     //
//            (12月分の戻し-100,000円と1月分の調整+500,000円の計+400,000円) //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2014/03/05 14期2月の商管売上高を調整する為(+300,000)                     //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2014/04/08 貯蔵品の調整の確定版を追加                               大谷 //
// 2014/06/04 14期5月の商管売上高を調整し忘れた為(-500,000)                 //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2014/06/12 15期上期の圧造工具振替を忘れていたので追加               大谷 //
// 2014/10/06 9月の暫定圧造工具振替と確定の数字を追加。確定作成時に         //
//            変更する事                                               大谷 //
// 2014/10/08 圧造工具の振替高を確定に変更                             大谷 //
// 2015/04/07 暫定用に貯蔵品の調整を追加                               大谷 //
// 2015/04/09 貯蔵品の振替を暫定から確定に変更                         大谷 //
// 2015/05/08 前月・前々月分の貯蔵品調整を追加                         大谷 //
//            商管調整ミスにより調整-200,000円（来月は逆？）           大谷 //
// 2015/09/04 16期8月のMT個別売上を調整する為(+193,970)                     //
//            売掛金(1)、仮受消費税(34)、当期純利益(41)に調整          大谷 //
// 2015/10/06 9月の暫定圧造工具振替と確定の数字を追加。確定作成時に         //
//            変更する事                                               大谷 //
// 2015/10/07 貯蔵品の振替を暫定から確定に変更                         大谷 //
// 2015/11/02 ヤマハ単軸ロボット貯蔵品使用（336,600円）→                   //
//            貯蔵品として単軸ロボット再購入（416,700円）              大谷 //
// 2016/04/08 貯蔵品の振替を最新に変更                                 大谷 //
// 2016/05/09 17期4月の商管売上高を調整伝票ミスの為(-600,000)               //
//            売掛金(1)、当期純利益(41)に調整(消費税は合ってたのでなし)大谷 //
// 2016/10/05 9月の暫定圧造工具振替と確定の数字を追加。確定作成時に         //
//            変更する事                                               大谷 //
// 2016/10/06 貯蔵品の振替を最新に変更                                 大谷 //
// 2016/10/13 貯蔵品ヤマハ単軸ロボットの金額を訂正                     大谷 //
// 2016/11/29 11月より貯蔵品にACサーボモーター追加（66,500円）         大谷 //
// 2016/12/21 12月より貯蔵品にACサーボモーター追加（58,000円）         大谷 //
// 2017/03/03 ヤマハ単軸ロボット貯蔵品使用（416,700円）                大谷 //
//            新規貯蔵品は現在購入手配中                                    //
// 2017/04/06 新規科目追加 未収収益(F56)WAPLBSL=F56(1430)              大谷 //
//            BSの再印刷でWAPLBSLが更新される(WAPLBSPを更新した)            //
// 2017/04/07 3月の暫定圧造工具振替と確定の数字を追加。確定作成時に         //
//            変更する事                                               大谷 //
// 2017/04/11 貯蔵品の振替を最新に変更                                 大谷 //
// 2017/04/13 未収収益のデータ保管が間違っていたので修正               大谷 //
// 2017/08/03 新規科目追加 前払消費税(F57)WAPLBSL=F57(1495)            大谷 //
//            BSの再印刷でWAPLBSLが更新される(WAPLBSPを更新した)            //
// 2017/10/04 9月の暫定圧造工具振替と確定の数字を追加。確定作成時に         //
//            変更する事                                               大谷 //
// 2018/03/29 ヤマハ単軸ロボット貯蔵品追加（477,500円）                大谷 //
// 2018/04/06 確定版に変更                                             大谷 //
// 2018/07/05 19期上期用の振替がなかったので追加                       大谷 //
// 2018/09/05 8月より貯蔵品にシンクロタッパ追加（348,000円）           大谷 //
// 2018/10/04 圧造工具の在庫を更新                                     大谷 //
// 2018/10/17 期首に9月を入れていたので削除                            大谷 //
// 2019/04/05 貯蔵品ACサーボモーター66,500削除、ボールネジ39,800×5を       //
//            を追加。暫定版。確定では圧造工具を直す。                 大谷 //
// 2019/04/09 圧造工具が27,332,900円に変更。確定に訂正                 大谷 //
// 2019/10/07 圧造工具が29,030,400円に変更。確定に訂正                 大谷 //
// 2020/04/03 貯蔵品ACサーボモーター58,000円を削除。                        //
//            暫定版。確定では圧造工具を直す。                         大谷 //
// 2020/04/06 圧造工具確定入替 本番は確定時に変更                      大谷 //
// 2020/07/08 貯蔵品プローブ2,590,000円を追加                          大谷 //
// 2021/04/07 圧造工具が29,988,800円に変更。確定に訂正                 大谷 //
// 2022/04/07 圧造工具が29,014,900円に変更。確定に訂正                 大谷 //
//////////////////////////////////////////////////////////////////////////////
ini_set('error_reporting', E_STRICT);       // E_STRICT=2048(php5) E_ALL=2047 debug 用
// ini_set('error_reporting',E_ALL);           // E_ALL='2047' debug 用
// ini_set('display_errors','1');              // Error 表示 ON debug 用 リリース後コメント
session_start();                            // ini_set()の次に指定すること Script 最上行

require_once ('../function.php');           // define.php と pgsql.php を require_once している
require_once ('../tnk_func.php');           // TNK に依存する部分の関数を require_once している
require_once ('../MenuHeader.php');         // TNK 全共通 menu class
access_log();                               // Script Name は自動取得

///// TNK 共用メニュークラスのインスタンスを作成
$menu = new MenuHeader(0);                  // 認証チェック0=一般以上 戻り先=TOP_MENU タイトル未設定
    // 実際の認証はprofit_loss_submit.phpで行っているaccount_group_check()を使用

////////////// サイト設定
// $menu->set_site(10, 7);                     // site_index=10(損益メニュー) site_id=7(月次損益)
//////////// 表題の設定
$menu->set_caption('栃木日東工器(株)');
//////////// 呼出先のaction名とアドレス設定
// $menu->set_action('抽象化名',   PL . 'address.php');

$url_referer     = $_SESSION['pl_referer'];     // 呼出もとの URL を取得

///// 期・月の取得
$ki = 22
$tuki = 11

//////////// タイトル名(ソースのタイトル名とフォームのタイトル名)
$menu->set_title("第 {$ki} 期　{$tuki} 月度　　貸　借　対　照　表");

///// 対象当月
$yyyymm = 202211
///// 対象前月
if (substr($yyyymm,4,2)!=01) {
    $p1_ym = $yyyymm - 1;
} else {
    $p1_ym = $yyyymm - 100;
    $p1_ym = $p1_ym + 11;
}
///// 対象前々月
if (substr($p1_ym,4,2)!=01) {
    $p2_ym = $p1_ym - 1;
} else {
    $p2_ym = $p1_ym - 100;
    $p2_ym = $p2_ym + 11;
}
///// 前期末 年月の算出
$yyyy = substr($yyyymm, 0,4);
$mm   = substr($yyyymm, 4,2);
if (($mm >= 1) && ($mm <= 3)) {
    $yyyy = ($yyyy - 1);
}
$pre_end_ym = $yyyy . "03";     // 期初年月

///// 表示単位を設定取得
if (isset($_POST['taisyaku_tani'])) {
    $_SESSION['taisyaku_tani'] = $_POST['taisyaku_tani'];
    $tani = $_SESSION['taisyaku_tani'];
} elseif (isset($_SESSION['taisyaku_tani'])) {
    $tani = $_SESSION['taisyaku_tani'];
} else {
    $tani = 1000000;        // 初期値 表示単位 千円
    $_SESSION['taisyaku_tani'] = $tani;
}
///// 表示 小数部桁数 設定取得
if (isset($_POST['keihi_keta'])) {
    $_SESSION['keihi_keta'] = $_POST['keihi_keta'];
    $keta = $_SESSION['keihi_keta'];
} elseif (isset($_SESSION['keihi_keta'])) {
    $keta = $_SESSION['keihi_keta'];
} else {
    $keta = 0;          // 初期値 小数点以下桁数
    $_SESSION['keihi_keta'] = $keta;
}
///// pl_bs_summary よりデータ取得
    ///// 当月
$month = array();
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d order by t_row ASC", $yyyymm);
if (($rows = getResult2($query, $month)) <= 0) {
    $_SESSION['s_sysmsg'] .= sprintf("貸借対照表のデータがない<br>第 %d期 %d月",$ki,$tuki);
    header("Location: $url_referer");
    exit();
}
// 2010/10/06 追加
if ($yyyymm == 201009) {
    $month[1][0]  += 6562097;
    $month[29][0] += 312481;
    $month[41][0] += 6249616;
}
// 2010/11/05 追加
if ($yyyymm == 201010) {
    $month[1][0]  += 6562097;
    $month[29][0] += 312481;
    $month[41][0] += 6249616;
    $month[1][0]  += 796423;
    $month[34][0] += 37925;
    $month[41][0] += 758498;
}
// 2010/12/03 追加
if (($yyyymm >= 201011) && ($yyyymm <= 201103)) {
    $month[1][0]  += 6562097;
    $month[29][0] += 312481;
    $month[41][0] += 6249616;
    $month[1][0]  += 796423;
    $month[34][0] += 37925;
    $month[41][0] += 758498;
    $month[1][0]  += 1817925;
    $month[34][0] += 86568;
    $month[41][0] += 1731357;
}
// 2011/04/06 追加
if ($yyyymm == 201103) {
    $month[1][0]  -= 6562097;
    $month[29][0] -= 312481;
    $month[41][0] -= 6249616;
    $month[1][0]  -= 796423;
    $month[34][0] -= 37925;
    $month[41][0] -= 758498;
    $month[1][0]  -= 1817925;
    $month[34][0] -= 86568;
    $month[41][0] -= 1731357;
    // 2011/04/20 追加 仮払金→棚卸資産（原材料及び貯蔵品）
    $month[2][0]  += 15278200;
    $month[9][0]  -= 15278200;
}
// 2011/10/18 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
if ($yyyymm >= 201104 && $yyyymm <= 201108) {
    $month[2][0]  += 15278200;
    $month[9][0]  -= 15278200;
}
// 2011/07/06 追加
if ($yyyymm == 201106) {
    $month[1][0]  += 315000;
    $month[34][0] += 15000;
    $month[41][0] += 300000;
}
// 2011/08/03 追加
if ($yyyymm == 201107) {
    $month[1][0]  -= 105000;
    $month[34][0] -= 5000;
    $month[41][0] -= 100000;
}
// 2011/09/05 追加
if ($yyyymm == 201108) {
    $month[1][0]  -= 105000;
    $month[34][0] -= 5000;
    $month[41][0] -= 100000;
}
// 2011/10/05 追加
if ($yyyymm == 201109) {
    $month[1][0]  += 210000;
    $month[34][0] += 10000;
    $month[41][0] += 200000;
    // 2011/10/18 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
    $month[2][0]  += 20205550;
    $month[9][0]  -= 20205550;
}
// 2012/04/04 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
if ($yyyymm == 201110) {
    $month[2][0]  += 20205550;
    $month[9][0]  -= 20205550;
}
// 2012/04/04 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
if ($yyyymm >= 201111 && $yyyymm <= 201112) {
    $month[2][0]  += 20331550;
    $month[9][0]  -= 20331550;
}
// 2012/04/04 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
if ($yyyymm >= 201201 && $yyyymm <= 201202) {
    $month[2][0]  += 20518550;
    $month[9][0]  -= 20518550;
}
// 2011/11/04 追加
if ($yyyymm == 201110) {
    $month[1][0]  += 315000;
    $month[34][0] += 15000;
    $month[41][0] += 300000;
}
// 2011/12/05 追加
if ($yyyymm == 201111) {
    $month[1][0]  -= 315000;
    $month[34][0] -= 15000;
    $month[41][0] -= 300000;
}
// 2012/02/03 追加
if ($yyyymm == 201201) {
    $month[1][0]  += 105000;
    $month[34][0] += 5000;
    $month[41][0] += 100000;
    // 2012/02/08 追加 2012年1月度 業務委託費（平出横川派遣料）調整
    $month[28][0] += 1156130;   // 未払金
    $month[41][0] -= 1156130;   // 純利益
}
// 2012/03/05 追加
if ($yyyymm == 201202) {
    $month[1][0]  += 210000;
    $month[34][0] += 10000;
    $month[41][0] += 200000;
    // 2012年1月度 業務委託費（平出横川派遣料）調整 戻し
    //$month[28][0] -= 1156130;   // 未払金
    //$month[41][0] += 1156130;   // 純利益
}
// 2012/04/04 追加
if ($yyyymm == 201203) {
    $month[1][0]  += 105000;
    $month[34][0] += 5000;
    $month[41][0] += 100000;
    //$month[1][0]  -= 2562709;
    //$month[34][0] -= 122034;
    //$month[41][0] -= 2440675;
    // 2012/04/04 追加 仮払金→棚卸資産（原材料及び貯蔵品）
    $month[2][0]  += 19777150;  // 圧造工具 19,017,150円 貯蔵品 ３点 760,000円
    $month[9][0]  -= 19777150;
}
// 2012/04/04 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
if ($yyyymm >= 201204 && $yyyymm <= 201208) {
    $month[2][0]  += 19777150;
    $month[9][0]  -= 19777150;
}
// 2012/05/07 追加
if ($yyyymm == 201204) {
    $month[1][0]  -= 210000;
    $month[34][0] -= 10000;
    $month[41][0] -= 200000;
}
// 2012/06/05 追加
if ($yyyymm == 201205) {
    $month[1][0]  += 315000;
    $month[34][0] += 15000;
    $month[41][0] += 300000;
}
// 2012/07/04 追加
if ($yyyymm == 201206) {
    $month[1][0]  -= 105000;
    $month[34][0] -= 5000;
    $month[41][0] -= 100000;
}
// 2012/07/11 追加
//if ($yyyymm >= 201204 && $yyyymm <= 201303) {
if ($yyyymm >= 201204 && $yyyymm <= 201211) {
    //前期分
    $month[1][0]  += 105000;
    $month[34][0] += 5000;
    $month[41][0] += 100000;
}
// 2012/08/03 追加
if ($yyyymm == 201207) {
    $month[1][0]  -= 2562709;
    $month[34][0] -= 122034;
    $month[41][0] -= 2440675;
    $month[1][0]  -= 105000;
    $month[34][0] -= 5000;
    $month[41][0] -= 100000;
}
// 2012/09/05 追加
if ($yyyymm == 201208) {
    $month[1][0]  -= 105000;
    $month[34][0] -= 5000;
    $month[41][0] -= 100000;
}
// 2012/10/04 追加
if ($yyyymm == 201209) {
    $month[1][0]  -= 105000;
    $month[34][0] -= 5000;
    $month[41][0] -= 100000;
    $month[1][0]  -= 2562709;
    $month[29][0] -= 122034;
    $month[41][0] -= 2440675;
    //$month[2][0]  += 19615350;  // 暫定用 圧造工具 19,017,150円 貯蔵品 ２点 598,200円（151,200円と447,000円）
    //$month[9][0]  -= 19615350;  // 暫定用
    $month[2][0]  += 17516725;    // 確定 圧造工具 16,918,525円 貯蔵品 ２点 598,200円（151,200円と447,000円）
    $month[9][0]  -= 17516725;    // 確定
}
// 2012/10/04 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
if ($yyyymm >= 201210 && $yyyymm <= 201302) {
    $month[2][0]  += 17516725;
    $month[9][0]  -= 17516725;
}
// 2012/11/05 追加
if ($yyyymm == 201210) {
    $month[1][0]  -= 105000;
    $month[34][0] -= 5000;
    $month[41][0] -= 100000;
    $month[1][0]  -= 2562709;
    $month[29][0] -= 122034;
    $month[41][0] -= 2440675;
}
// 2012/12/05 追加
if ($yyyymm == 201211) {
    $month[1][0]  -= 105000;
    $month[34][0] -= 5000;
    $month[41][0] -= 100000;
    $month[1][0]  -= 2562709;
    $month[29][0] -= 122034;
    $month[41][0] -= 2440675;
}
// 2013/01/11 追加
if ($yyyymm == 201212) {
    //$month[1][0]  -= 105000;
    //$month[34][0] -= 5000;
    //$month[41][0] -= 100000;
    $month[1][0]  -= 2562709;
    $month[29][0] -= 122034;
    $month[41][0] -= 2440675;
}
// 2013/02/05 追加
// 決算時(確定時)に消費税の振替処理が行われた際に
// IFの条件日付右側を201303から201302へ変更すること
if ($yyyymm >= 201301 && $yyyymm <= 201302) {
    //未払消費税[29] 仮受消費税[34] 調整
    $month[29][0] -= 122034;
    $month[34][0] += 122034;
}
// 決算時(確定時)に当期純利益が繰越利益剰余金に振り替えられた際に
// IFの条件日付右側を201303から201302へ変更すること
if ($yyyymm >= 201204 && $yyyymm <= 201302) {
    //繰越利益剰余金[40] 当期純利益[41] 調整
    $month[41][0] -= 100000;
    $month[40][0] += 100000;
}
// 2013/03/05 追加
if ($yyyymm == 201302) {
    $month[1][0]  -= 5794530;
    $month[34][0] -= 275930;
    $month[41][0] -= 5518600;
}
// 2013/03/05 追加
if ($yyyymm == 201303) {
    //$month[1][0]  += 5794530;
    //$month[34][0] += 275930;
    //$month[41][0] += 5518600;
    //$month[2][0]  += 17516725;  // 暫定用 圧造工具 16,918,525円 貯蔵品 ２点 598,200円（151,200円と447,000円）
    //$month[9][0]  -= 17516725;  // 暫定用
    $month[2][0]  += 18517075;    // 確定 圧造工具 17,918,875円 貯蔵品 ２点 598,200円（151,200円と447,000円）
    $month[9][0]  -= 18517075;    // 確定
}
// 2013/04/08 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
if ($yyyymm >= 201304 && $yyyymm <= 201304) {
    $month[2][0]  += 18517075;  // 確定 圧造工具 17,918,875円 貯蔵品 ２点 598,200円（151,200円と447,000円）
    $month[9][0]  -= 18517075;  // 確定
}
// 2013/05/28 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）貯蔵品１点追加(ヤマハ単軸ロボット 336,600円)
if ($yyyymm >= 201305 && $yyyymm <= 201308) {
    $month[2][0]  += 18853675;  // 確定 圧造工具 17,918,875円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $month[9][0]  -= 18853675;  // 確定
}
// 2013/10/03 追加
if ($yyyymm == 201309) {
    //$month[2][0]  += 18853675;    // 暫定用 圧造工具 17,918,875円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    //$month[9][0]  -= 18853675;    // 暫定用
    $month[2][0]  += 19326300;    // 確定 圧造工具 18,391,500円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $month[9][0]  -= 19326300;    // 確定
    //未払消費税[29] を 未収消費税等へ振替 未払 5,269,700 → 0 未収 9,622,964-5,269,700=4,353,264
    $month[29][0] -= 5269700;
    $month[42][0] -= 5269700;
}
// 2013/10/08 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
if ($yyyymm >= 201310 && $yyyymm <= 201402) {
    $month[2][0]  += 19326300;    // 確定 圧造工具 18,391,500円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $month[9][0]  -= 19326300;    // 確定
}
// 2013/11/06 追加
if ($yyyymm == 201310) {
    $month[1][0]  += 105000;
    $month[34][0] += 5000;
    $month[41][0] += 100000;
}
// 2014/01/10 追加
if ($yyyymm == 201312) {
    $month[1][0]  += 105000;
    $month[34][0] += 5000;
    $month[41][0] += 100000;
}
// 2014/02/05 追加
if ($yyyymm == 201401) {
    $month[1][0]  += 525000;
    $month[34][0] += 25000;
    $month[41][0] += 500000;
}
// 2014/03/05 追加
if ($yyyymm == 201402) {
    $month[1][0]  += 315000;
    $month[34][0] += 15000;
    $month[41][0] += 300000;
}
// 2014/04/03 追加
if ($yyyymm == 201403) {
    //$month[2][0]  += 19326300;    // 暫定用 圧造工具 18,391,500円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    //$month[9][0]  -= 19326300;    // 暫定用
    
    // 直接商管の調整をASに入力するようになった為、調整を解除
    //$month[1][0]  -= 105000;
    //$month[34][0] -= 5000;
    //$month[41][0] -= 100000;
    // 期末の消費税振替により、仮受消費税[34] の-5,000円が未収消費税に移る為 両方に+5,000円を行う
    //$month[34][0] += 5000;
    //$month[42][0] += 5000;
    // ここまで
    
    $month[2][0]  += 21957050;    // 確定 圧造工具 21,022,250円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $month[9][0]  -= 21957050;    // 確定
}

// 2014/06/12 追加 仮払金→棚卸資産
if ($yyyymm >= 201404 && $yyyymm <= 201408) {
    $month[2][0]  += 21957050;    // 確定 圧造工具 21,022,250円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $month[9][0]  -= 21957050;    // 確定
}

// 2014/06/04 追加
if ($yyyymm == 201405) {
    $month[1][0]  -= 540000;
    $month[34][0] -= 40000;
    $month[41][0] -= 500000;
}
// 2014/10/06 追加
if ($yyyymm == 201409) {
    //$month[2][0]  += 21957050;    // 暫定用 圧造工具 21,022,250円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    ///$month[9][0]  -= 21957050;    // 暫定用
    
    $month[2][0]  += 21647825;    // 確定 圧造工具 20,713,025円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $month[9][0]  -= 21647825;    // 確定
}
// 2014/10/06 追加 仮払金→棚卸資産
if ($yyyymm >= 201410 && $yyyymm <= 201502) {
    $month[2][0]  += 21647825;    // 確定 圧造工具 20,713,025円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $month[9][0]  -= 21647825;    // 確定
}
// 2015/04/07 追加
if ($yyyymm == 201503) {
    //$month[2][0]  += 21647825;    // 暫定 圧造工具 20,713,025円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    //$month[9][0]  -= 21647825;    // 暫定
    
    $month[2][0]  += 22512650;    // 確定 圧造工具 21,577,850円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $month[9][0]  -= 22512650;    // 確定
}
// 2015/04/07 追加 仮払金→棚卸資産
if ($yyyymm >= 201504 && $yyyymm <= 201508) {
    $month[2][0]  += 22512650;    // 確定 圧造工具 21,577,850円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $month[9][0]  -= 22512650;    // 確定
}
// 2015/05/08 追加
if ($yyyymm == 201504) {
    $month[1][0]  -= 215000;
    $month[34][0] -= 15000;
    $month[41][0] -= 200000;
}
// 2015/09/04 追加
if ($yyyymm == 201508) {
    $month[1][0]  += 209488;
    $month[34][0] += 15518;
    $month[41][0] += 193970;
}
// 2015/10/07 追加
if ($yyyymm == 201509) {
    //$month[2][0]  += 22512650;    // 暫定 圧造工具 21,577,850円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    //$month[9][0]  -= 22512650;    // 暫定
    
    $month[2][0]  += 21948500;    // 確定 圧造工具 21,013,700円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $month[9][0]  -= 21948500;    // 確定
}
// 2015/10/07 追加 仮払金→棚卸資産
if ($yyyymm >= 201510 && $yyyymm <= 201602) {
    //$month[2][0]  += 21948500;    // 確定 圧造工具 21,013,700円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    //$month[9][0]  -= 21948500;    // 確定
    // 20151021にヤマハ単軸ロボット貯蔵品使用（336,600円）→ 貯蔵品として単軸ロボット再購入（416,700円）
    $month[2][0]  += 22028600;    // 確定 圧造工具 21,013,700円 貯蔵品 ３点 1,014,900,800円（151,200円と447,000円と416,700円）
    $month[9][0]  -= 22028600;    // 確定
}
// 2016/04/07 追加
if ($yyyymm == 201603) {
    //$month[2][0]  += 21948500;    // 暫定 圧造工具 21,013,700円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    //$month[9][0]  -= 21948500;    // 暫定
    
    $month[2][0]  += 22443100;    // 確定 圧造工具 21,508,300円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $month[9][0]  -= 22443100;    // 確定
}
// 2016/04/07 追加 仮払金→棚卸資産
if ($yyyymm >= 201604 && $yyyymm <= 201608) {
    $month[2][0]  += 22443100;    // 確定 圧造工具 21,508,300円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $month[9][0]  -= 22443100;    // 確定
}
// 2016/05/09 追加
if ($yyyymm == 201604) {
    $month[1][0]  -= 600000;
    //$month[34][0] -= 48000;
    $month[41][0] -= 600000;
}
// 2016/10/05 追加
if ($yyyymm == 201609) {
    //$month[2][0]  += 22443100;    // 暫定 圧造工具 21,508,300円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    //$month[9][0]  -= 22443100;    // 暫定
    
    $month[2][0]  += 27994100;    // 確定 圧造工具 26,979,200円 貯蔵品 ３点 1,014,800円（151,200円と447,000円と416,700円）
    $month[9][0]  -= 27994100;    // 確定
}
// 2016/10/06 追加 仮払金→棚卸資産
if ($yyyymm >= 201610 && $yyyymm <= 201610) {
    $month[2][0]  += 27994100;    // 確定 圧造工具 26,979,200円 貯蔵品 ３点 1,014,800円（151,200円と447,000円と416,700円）
    $month[9][0]  -= 27994100;    // 確定
}
// 2016/11/29 追加 仮払金→棚卸資産（11月よりACサーボモーター分 66,500円追加）
if ($yyyymm >= 201611 && $yyyymm <= 201611) {
    $month[2][0]  += 28060500;    // 確定 圧造工具 26,979,200円 貯蔵品 ４点 1,081,300円（151,200円と447,000円と416,700円と66,500円）
    $month[9][0]  -= 28060500;    // 確定
}
// 2016/12/21 追加 仮払金→棚卸資産（12月よりACサーボモーター分 58,000円追加）
if ($yyyymm >= 201612 && $yyyymm <= 201701) {
    $month[2][0]  += 28118600;    // 確定 圧造工具 26,979,200円 貯蔵品 ５点 1,139,400円（151,200円と447,000円と416,700円と66,500円と58,000円）
    $month[9][0]  -= 28118600;    // 確定
}
// 2017/03/03 追加 仮払金→棚卸資産（2月にヤマハ単軸ロボット 416,700円使用）
if ($yyyymm >= 201702 && $yyyymm <= 201702) {
    $month[2][0]  += 27701900;    // 確定 圧造工具 26,979,200円 貯蔵品 ４点 722,700円（151,200円と447,000円と66,500円と58,000円）
    $month[9][0]  -= 27701900;    // 確定
}
// 2017/04/07 追加
if ($yyyymm == 201703) {
    //$month[2][0]  += 27701900;    // 暫定 圧造工具 26,979,200円 貯蔵品 ４点 722,700円（151,200円と447,000円と66,500円と58,000円）
    //$month[9][0]  -= 27701900;    // 暫定
    
    $month[2][0]  += 27170800;    // 確定 圧造工具 26,448,100円 貯蔵品 ４点 722,700円（151,200円と447,000円と66,500円と58,000円）
    $month[9][0]  -= 27170800;    // 確定
}
// 2017/04/07 追加 仮払金→棚卸資産
if ($yyyymm >= 201704 && $yyyymm <= 201708) {
    $month[2][0]  += 27170800;    // 確定 圧造工具 26,448,100円 貯蔵品 ４点 722,700円（151,200円と447,000円と66,500円と58,000円）
    $month[9][0]  -= 27170800;    // 確定
}
// 2017/10/04 追加
if ($yyyymm == 201709) {
    //$month[2][0]  += 27170800;    // 暫定 圧造工具 26,448,100円 貯蔵品 ４点 722,700円（151,200円と447,000円と66,500円と58,000円）
    //$month[9][0]  -= 27170800;    // 暫定
    
    $month[2][0]  += 31331800;    // 確定 圧造工具 30,609,100円 貯蔵品 ４点 722,700円（151,200円と447,000円と66,500円と58,000円）
    $month[9][0]  -= 31331800;    // 確定
}
// 2017/10/04 追加 仮払金→棚卸資産
if ($yyyymm >= 201710 && $yyyymm <= 201802) {
    $month[2][0]  += 31331800;    // 確定 圧造工具 30,609,100円 貯蔵品 ４点 722,700円（151,200円と447,000円と66,500円と58,000円）
    $month[9][0]  -= 31331800;    // 確定
}
// 2018/03/29 追加
if ($yyyymm == 201803) {
    //$month[2][0]  += 31809300;    // 暫定 圧造工具 30,609,100円 貯蔵品 ５点 1,200,200円（151,200円と447,000円と66,500円と58,000円と477,500円）
    //$month[9][0]  -= 31809300;    // 暫定
    
    $month[2][0]  += 30723300;    // 確定 圧造工具 29,523,100円 貯蔵品 ５点 1,200,200円（151,200円と447,000円と66,500円と58,000円と477,500円）
    $month[9][0]  -= 30723300;    // 確定
}
// 2018/07/05 追加 仮払金→棚卸資産
if ($yyyymm >= 201804 && $yyyymm <= 201807) {
    $month[2][0]  += 30723300;    // 確定 圧造工具 29,523,100円 貯蔵品 ５点 1,200,200円（151,200円と447,000円と66,500円と58,000円と477,500円）
    $month[9][0]  -= 30723300;    // 確定
}
// 2018/09/05 追加 貯蔵品シンクロタッパ追加 348,000円
if ($yyyymm == 201808) {
    $month[2][0]  += 31071300;    // 確定 圧造工具 29,523,100円 貯蔵品 ５点 1,548,200円（151,200円と447,000円と66,500円と58,000円と477,500円と348,000円）
    $month[9][0]  -= 31071300;    // 確定
}
// 2018/10/04 追加
if ($yyyymm == 201809) {
    //$month[2][0]  += 31071300;    // 暫定 圧造工具 29,523,100円 貯蔵品 ５点 1,548,200円（151,200円と447,000円と66,500円と58,000円と477,500円と348,000円）
    //$month[9][0]  -= 31071300;    // 暫定
    
    $month[2][0]  += 31076300;    // 確定 圧造工具 29,528,100円 貯蔵品 ５点 1,548,200円（151,200円と447,000円と66,500円と58,000円と477,500円と348,000円）
    $month[9][0]  -= 31076300;    // 確定
}
// 2018/10/04 追加 仮払金→棚卸資産
if ($yyyymm >= 201810 && $yyyymm <= 201902) {
    $month[2][0]  += 31076300;    // 確定 圧造工具 29,528,100円 貯蔵品 ５点 1,548,200円（151,200円と447,000円と66,500円と58,000円と477,500円と348,000円）
    $month[9][0]  -= 31076300;    // 確定
}
// 2019/04/05 追加
if ($yyyymm == 201903) {
    //$month[2][0]  += 31208800;    // 暫定 圧造工具 29,528,100円 貯蔵品 １０点 1,680,700円（151,200円と447,000円と58,000円と477,500円と348,000円と39,800円が5点）
    //$month[9][0]  -= 31208800;    // 暫定
    
    $month[2][0]  += 29013600;    // 確定 圧造工具 27,332,900円 貯蔵品 １０点 1,680,700円（151,200円と447,000円と58,000円と477,500円と348,000円と39,800円が5点）
    $month[9][0]  -= 29013600;    // 確定
}
// 2019/04/08 追加 仮払金→棚卸資産
if ($yyyymm >= 201904 && $yyyymm <= 201908) {
    $month[2][0]  += 29013600;    // 確定 圧造工具 27,332,900円 貯蔵品 １０点 1,680,700円（151,200円と447,000円と58,000円と477,500円と348,000円と39,800円が5点）
    $month[9][0]  -= 29013600;    // 確定
}
// 2019/10/07 追加 仮払金→棚卸資産
if ($yyyymm >= 201909 && $yyyymm <= 202002) {
    $month[2][0]  += 30711100;    // 確定 圧造工具 29,030,400円 貯蔵品 １０点 1,680,700円（151,200円と447,000円と58,000円と477,500円と348,000円と39,800円が5点）
    $month[9][0]  -= 30711100;    // 確定
}
// 2019/04/05 追加
if ($yyyymm == 202003) {
    //$month[2][0]  += 30653100;    // 暫定 圧造工具 29,030,400円 貯蔵品 ９点 1,622,700円（151,200円と447,000円と477,500円と348,000円と39,800円が5点）
    //$month[9][0]  -= 30653100;    // 暫定
    
    $month[2][0]  += 31847700;    // 確定 圧造工具 30,225,000円 貯蔵品 ９点 1,622,700円（151,200円と447,000円と477,500円と348,000円と39,800円が5点）
    $month[9][0]  -= 31847700;    // 確定
}
// 2020/04/06 追加 仮払金→棚卸資産
if ($yyyymm >= 202004 && $yyyymm <= 202005) {
    $month[2][0]  += 31847700;    // 確定 圧造工具 30,225,000円 貯蔵品 ９点 1,622,700円（151,200円と447,000円と477,500円と348,000円と39,800円が5点）
    $month[9][0]  -= 31847700;    // 確定
}
// 2020/07/08 追加 仮払金→棚卸資産
if ($yyyymm >= 202006 && $yyyymm <= 202008) {
    $month[2][0]  += 34437700;    // 確定 圧造工具 30,225,000円 貯蔵品 ９点 4,212,700円（151,200円と447,000円と477,500円と348,000円と39,800円が5点と2,590,000円）
    $month[9][0]  -= 34437700;    // 確定
}
// 2020/10/07 追加 仮払金→棚卸資産
if ($yyyymm >= 202009 && $yyyymm <= 202102) {
    $month[2][0]  += 35225500;    // 確定 圧造工具 31,012,800円 貯蔵品 ９点 4,212,700円（151,200円と447,000円と477,500円と348,000円と39,800円が5点と2,590,000円）
    $month[9][0]  -= 35225500;    // 確定
}
// 2021/04/07 追加 仮払金→棚卸資産
if ($yyyymm >= 202103 && $yyyymm <= 202105) {
    $month[2][0]  += 34201500;    // 確定 圧造工具 29,988,800円 貯蔵品 ９点 4,212,700円（151,200円と447,000円と477,500円と348,000円と39,800円が5点と2,590,000円）
    $month[9][0]  -= 34201500;    // 確定
}
// 2021/07/07 追加 仮払金→棚卸資産
if ($yyyymm >= 202106 && $yyyymm <= 202108) {
    $month[2][0]  += 34390591;    // 確定 圧造工具 29,988,800円 貯蔵品 ９点 4,401,791円（151,200円と447,000円と477,500円と348,000円と39,800円が5点と2,590,000円と189,091円）
    $month[9][0]  -= 34390591;    // 確定
}
// 2021/10/07 追加 仮払金→棚卸資産
if ($yyyymm >= 202109 && $yyyymm <= 202202) {
    $month[2][0]  += 35918291;    // 確定 圧造工具 31,516,500円 貯蔵品 ９点 4,401,791円（151,200円と447,000円と477,500円と348,000円と39,800円が5点と2,590,000円と189,091円）
    $month[9][0]  -= 35918291;    // 確定
}
// 2022/04/07 追加 仮払金→棚卸資産
if ($yyyymm >= 202203 && $yyyymm <= 202208) {
    //$month[2][0]  += 35918291;    // 暫定 圧造工具 31,516,500円 貯蔵品 ９点 4,401,791円（151,200円と447,000円と477,500円と348,000円と39,800円が5点と2,590,000円と189,091円）
    //$month[9][0]  -= 35918291;    // 暫定
    $month[2][0]  += 33416691;    // 確定 圧造工具 29,014,900円 貯蔵品 ９点 4,401,791円（151,200円と447,000円と477,500円と348,000円と39,800円が5点と2,590,000円と189,091円）
    $month[9][0]  -= 33416691;    // 確定
}
///// その他の科目に金額があるかどうかチェック
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and actcod=9999 and pl_bs_ym=%d order by t_row ASC", $yyyymm);
getUniResult($query, $other);
if ($other !=0) {
    $fother = number_format($other);
    $_SESSION['s_sysmsg'] .= sprintf("その他の科目に金額があります<br>第 %d期 %d月 金額=%s",$ki,$tuki, $fother);
}

    ///// 当月の仮受金チェック
$month_kari = array();
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d and t_row=44 order by t_row ASC", $yyyymm);
if ((getResult2($query, $month_kari)) > 0) {
    $month[32][0] += $month_kari[0][0];         // その他流動負債に加算
}
    ///// 当月の施設利用権チェックF45(2440)
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d and t_row=45 order by t_row ASC", $yyyymm);
if ((getUniResult($query, $month_sisetu)) <= 0) {
    $month_sisetu = 0;
}
    ///// 当月の未収法人税等チェックF46(1475) 商法科目であることに注意 社内科目は1518 2005/04/14
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d and t_row=46 order by t_row ASC", $yyyymm);
if ((getUniResult($query, $month_mihojin)) <= 0) {
    $month_mihojin = 0;
}

///////// 前月
$pmonth = array();
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d order by t_row ASC", $p1_ym);
$prows = getResult2($query, $pmonth);
// 2010/10/06 追加
if ($p1_ym == 201009) {
    $pmonth[1][0]  += 6562097;
    $pmonth[29][0] += 312481;
    $pmonth[41][0] += 6249616;
}
// 2010/11/05 追加
if ($p1_ym == 201010) {
    $pmonth[1][0]  += 6562097;
    $pmonth[29][0] += 312481;
    $pmonth[41][0] += 6249616;
    $pmonth[1][0]  += 796423;
    $pmonth[34][0] += 37925;
    $pmonth[41][0] += 758498;
}
// 2010/12/03 追加
if (($p1_ym >= 201011) && ($p1_ym <= 201103)) {
    $pmonth[1][0]  += 6562097;
    $pmonth[29][0] += 312481;
    $pmonth[41][0] += 6249616;
    $pmonth[1][0]  += 796423;
    $pmonth[34][0] += 37925;
    $pmonth[41][0] += 758498;
    $pmonth[1][0]  += 1817925;
    $pmonth[34][0] += 86568;
    $pmonth[41][0] += 1731357;
}
// 2011/04/06 追加
if ($p1_ym == 201103) {
    $pmonth[1][0]  -= 6562097;
    $pmonth[29][0] -= 312481;
    $pmonth[41][0] -= 6249616;
    $pmonth[1][0]  -= 796423;
    $pmonth[34][0] -= 37925;
    $pmonth[41][0] -= 758498;
    $pmonth[1][0]  -= 1817925;
    $pmonth[34][0] -= 86568;
    $pmonth[41][0] -= 1731357;
    // 2011/04/20 追加 仮払金→棚卸資産（原材料及び貯蔵品）
    $pmonth[2][0]  += 15278200;
    $pmonth[9][0]  -= 15278200;
}
// 2011/10/18 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
if ($p1_ym >= 201104 && $p1_ym <= 201108) {
    $pmonth[2][0]  += 15278200;
    $pmonth[9][0]  -= 15278200;
}
// 2011/07/06 追加
if ($p1_ym == 201106) {
    $pmonth[1][0]  += 315000;
    $pmonth[34][0] += 15000;
    $pmonth[41][0] += 300000;
}
// 2011/08/03 追加
if ($p1_ym == 201107) {
    $pmonth[1][0]  -= 105000;
    $pmonth[34][0] -= 5000;
    $pmonth[41][0] -= 100000;
}
// 2011/09/05 追加
if ($p1_ym == 201108) {
    $pmonth[1][0]  -= 105000;
    $pmonth[34][0] -= 5000;
    $pmonth[41][0] -= 100000;
}
// 2011/10/05 追加
if ($p1_ym == 201109) {
    $pmonth[1][0]  += 210000;
    $pmonth[34][0] += 10000;
    $pmonth[41][0] += 200000;
    // 2011/10/18 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
    $pmonth[2][0]  += 20205550;
    $pmonth[9][0]  -= 20205550;
}
// 2012/04/04 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
if ($p1_ym == 201110) {
    $pmonth[2][0]  += 20205550;
    $pmonth[9][0]  -= 20205550;
}
// 2012/04/04 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
if ($p1_ym >= 201111 && $p1_ym <= 201112) {
    $pmonth[2][0]  += 20331550;
    $pmonth[9][0]  -= 20331550;
}
// 2012/04/04 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
if ($p1_ym >= 201201 && $p1_ym <= 201202) {
    $pmonth[2][0]  += 20518550;
    $pmonth[9][0]  -= 20518550;
}
// 2011/11/04 追加
if ($p1_ym == 201110) {
    $pmonth[1][0]  += 315000;
    $pmonth[34][0] += 15000;
    $pmonth[41][0] += 300000;
}
// 2011/12/05 追加
if ($p1_ym == 201111) {
    $pmonth[1][0]  -= 315000;
    $pmonth[34][0] -= 15000;
    $pmonth[41][0] -= 300000;
}
// 2012/02/03 追加
if ($p1_ym == 201201) {
    $pmonth[1][0]  += 105000;
    $pmonth[34][0] += 5000;
    $pmonth[41][0] += 100000;
    // 2012/02/08 追加 2012年1月度 業務委託費（平出横川派遣料）調整
    $pmonth[28][0] += 1156130;   // 未払金
    $pmonth[41][0] -= 1156130;   // 純利益
}
// 2012/02/03 追加
if ($p1_ym == 201202) {
    $pmonth[1][0]  += 210000;
    $pmonth[34][0] += 10000;
    $pmonth[41][0] += 200000;
    // 2012年1月度 業務委託費（平出横川派遣料）調整 戻し
    //$pmonth[28][0] -= 1156130;   // 未払金
    //$pmonth[41][0] += 1156130;   // 純利益
}
// 2012/04/04 追加
if ($p1_ym == 201203) {
    $pmonth[1][0]  += 105000;
    $pmonth[34][0] += 5000;
    $pmonth[41][0] += 100000;
    //$pmonth[1][0]  -= 2562709;
    //$pmonth[34][0] -= 122034;
    //$pmonth[41][0] -= 2440675;
    // 2012/04/04 追加 仮払金→棚卸資産（原材料及び貯蔵品）
    $pmonth[2][0]  += 19777150;
    $pmonth[9][0]  -= 19777150;
}
// 2012/04/04 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
if ($p1_ym >= 201204 && $p1_ym <= 201208) {
    $pmonth[2][0]  += 19777150;
    $pmonth[9][0]  -= 19777150;
}
// 2012/05/07 追加
if ($p1_ym == 201204) {
    $pmonth[1][0]  -= 210000;
    $pmonth[34][0] -= 10000;
    $pmonth[41][0] -= 200000;
}
// 2012/06/05 追加
if ($p1_ym == 201205) {
    $pmonth[1][0]  += 315000;
    $pmonth[34][0] += 15000;
    $pmonth[41][0] += 300000;
}
// 2012/07/04 追加
if ($p1_ym == 201206) {
    $pmonth[1][0]  -= 105000;
    $pmonth[34][0] -= 5000;
    $pmonth[41][0] -= 100000;
}
// 2012/07/11 追加
if ($p1_ym >= 201204 && $p1_ym <= 201211) {
    //前期分
    $pmonth[1][0]  += 105000;
    $pmonth[34][0] += 5000;
    $pmonth[41][0] += 100000;
}
// 2012/08/03 追加
if ($p1_ym == 201207) {
    $pmonth[1][0]  -= 2562709;
    $pmonth[34][0] -= 122034;
    $pmonth[41][0] -= 2440675;
    $pmonth[1][0]  -= 105000;
    $pmonth[34][0] -= 5000;
    $pmonth[41][0] -= 100000;
}
// 2012/09/05 追加
if ($p1_ym == 201208) {
    $pmonth[1][0]  -= 105000;
    $pmonth[34][0] -= 5000;
    $pmonth[41][0] -= 100000;
}

// 2012/10/04 追加
if ($p1_ym == 201209) {
    $pmonth[1][0]  -= 105000;
    $pmonth[34][0] -= 5000;
    $pmonth[41][0] -= 100000;
    $pmonth[1][0]  -= 2562709;
    $pmonth[29][0] -= 122034;
    $pmonth[41][0] -= 2440675;
    //$pmonth[2][0]  += 19615350;  // 暫定用 圧造工具 19,017,150円 貯蔵品 ２点 598,200円（151,200円と447,000円）
    //$pmonth[9][0]  -= 19615350;  // 暫定用
    $pmonth[2][0]  += 17516725;    // 確定 圧造工具 16,918,525円 貯蔵品 ２点 598,200円（151,200円と447,000円）
    $pmonth[9][0]  -= 17516725;    // 確定
}
// 2012/10/04 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
if ($p1_ym >= 201210 && $p1_ym <= 201302) {
    $pmonth[2][0]  += 17516725;
    $pmonth[9][0]  -= 17516725;
}
// 2012/11/05 追加
if ($p1_ym == 201210) {
    $pmonth[1][0]  -= 105000;
    $pmonth[34][0] -= 5000;
    $pmonth[41][0] -= 100000;
    $pmonth[1][0]  -= 2562709;
    $pmonth[29][0] -= 122034;
    $pmonth[41][0] -= 2440675;
}
// 2012/12/05 追加
if ($p1_ym == 201211) {
    $pmonth[1][0]  -= 105000;
    $pmonth[34][0] -= 5000;
    $pmonth[41][0] -= 100000;
    $pmonth[1][0]  -= 2562709;
    $pmonth[29][0] -= 122034;
    $pmonth[41][0] -= 2440675;
}
// 2013/01/11 追加
if ($p1_ym == 201212) {
    //$pmonth[1][0]  -= 105000;
    //$pmonth[34][0] -= 5000;
    //$pmonth[41][0] -= 100000;
    $pmonth[1][0]  -= 2562709;
    $pmonth[29][0] -= 122034;
    $pmonth[41][0] -= 2440675;
}
// 2013/02/05 追加
// 決算時(確定時)に消費税の振替処理が行われた際に
// IFの条件日付右側を201303から201302へ変更すること
if ($p1_ym >= 201301 && $p1_ym <= 201302) {
    //未払消費税[29] 仮受消費税[34] 調整
    $pmonth[29][0] -= 122034;
    $pmonth[34][0] += 122034;
}
// 決算時(確定時)に当期純利益が繰越利益剰余金に振り返られた際に
// IFの条件日付右側を201303から201302へ変更すること
if ($p1_ym >= 201204 && $p1_ym <= 201302) {
    //繰越利益剰余金[40] 当期純利益[41] 調整
    $pmonth[41][0] -= 100000;
    $pmonth[40][0] += 100000;
}
// 2013/03/05 追加
if ($p1_ym == 201302) {
    $pmonth[1][0]  -= 5794530;
    $pmonth[34][0] -= 275930;
    $pmonth[41][0] -= 5518600;
}
// 2013/03/05 追加
if ($p1_ym == 201303) {
    //$pmonth[1][0]  += 5794530;
    //$pmonth[34][0] += 275930;
    //$pmonth[41][0] += 5518600;
    //$pmonth[2][0]  += 17516725;  // 暫定用 圧造工具 16,918,525円 貯蔵品 ２点 598,200円（151,200円と447,000円）
    //$pmonth[9][0]  -= 17516725;  // 暫定用
    $pmonth[2][0]  += 18517075;    // 確定 圧造工具 17,918,875円 貯蔵品 ２点 598,200円（151,200円と447,000円）
    $pmonth[9][0]  -= 18517075;    // 確定
}
// 2013/04/08 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
if ($p1_ym >= 201304 && $p1_ym <= 201304) {
    $pmonth[2][0]  += 18517075; // 確定 圧造工具 17,918,875円 貯蔵品 ２点 598,200円（151,200円と447,000円）
    $pmonth[9][0]  -= 18517075; // 確定
}
// 2013/05/28 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）貯蔵品１点追加(ヤマハ単軸ロボット 336,600円)
if ($p1_ym >= 201305 && $p1_ym <= 201308) {
    $pmonth[2][0]  += 18853675;  // 確定 圧造工具 17,918,875円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $pmonth[9][0]  -= 18853675;  // 確定
}
// 2013/10/10 追加 未払消費税[29] を 未収消費税等へ振替 未払 5,269,700 → 0 未収 9,622,964-5,269,700=4,353,264
if ($p1_ym == 201309) {
    $pmonth[29][0] -= 5269700;
    $pmonth[42][0] -= 5269700;
}
// 2013/10/08 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
if ($p1_ym >= 201309 && $p1_ym <= 201402) {
    $pmonth[2][0]  += 19326300;    // 確定 圧造工具 18,391,500円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $pmonth[9][0]  -= 19326300;    // 確定
}
// 2013/11/06 追加
if ($p1_ym == 201310) {
    $pmonth[1][0]  += 105000;
    $pmonth[34][0] += 5000;
    $pmonth[41][0] += 100000;
}
// 2014/01/10 追加
if ($p1_ym == 201312) {
    $pmonth[1][0]  += 105000;
    $pmonth[34][0] += 5000;
    $pmonth[41][0] += 100000;
}
// 2014/02/05 追加
if ($p1_ym == 201401) {
    $pmonth[1][0]  += 525000;
    $pmonth[34][0] += 25000;
    $pmonth[41][0] += 500000;
}
// 2014/03/05 追加
if ($p1_ym == 201402) {
    $pmonth[1][0]  += 315000;
    $pmonth[34][0] += 15000;
    $pmonth[41][0] += 300000;
}
// 2014/04/03 追加
if ($p1_ym == 201403) {
    //$pmonth[2][0]  += 19326300;    // 暫定用 圧造工具 18,391,500円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    //$pmonth[9][0]  -= 19326300;    // 暫定用
    // 直接商管の調整をASに入力するようになった為、調整を解除
    //$pmonth[1][0]  -= 105000;
    //$pmonth[34][0] -= 5000;
    //$pmonth[41][0] -= 100000;
    $pmonth[2][0]  += 21957050;    // 確定 圧造工具 21,022,250円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $pmonth[9][0]  -= 21957050;    // 確定
    //未払消費税[29] を 未収消費税等へ振替 未払 5,269,700 → 0 未収 9,622,964-5,269,700=4,353,264
    //$pmonth[29][0] -= 5269700;
    //$pmonth[42][0] -= 5269700;
}
// 2014/06/12 追加 仮払金→棚卸資産
if ($p1_ym >= 201404 && $p1_ym <= 201408) {
    $pmonth[2][0]  += 21957050;    // 確定 圧造工具 21,022,250円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $pmonth[9][0]  -= 21957050;    // 確定
}

// 2014/06/04 追加
if ($p1_ym == 201405) {
    $pmonth[1][0]  -= 540000;
    $pmonth[34][0] -= 40000;
    $pmonth[41][0] -= 500000;
}
// 2014/10/06 追加
if ($p1_ym == 201409) {
    //$pmonth[2][0]  += 21957050;    // 暫定用 圧造工具 21,022,250円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    //$pmonth[9][0]  -= 21957050;    // 暫定用
    
    $pmonth[2][0]  += 21647825;    // 確定 圧造工具 20,713,025円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $pmonth[9][0]  -= 21647825;    // 確定
}
// 2014/10/06 追加 仮払金→棚卸資産
if ($p1_ym >= 201410 && $p1_ym <= 201502) {
    $pmonth[2][0]  += 21647825;    // 確定 圧造工具 20,713,025円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $pmonth[9][0]  -= 21647825;    // 確定
}

// 2015/04/07 追加
if ($p1_ym == 201503) {
    //$pmonth[2][0]  += 21647825;    // 暫定 圧造工具 20,713,025円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    //$pmonth[9][0]  -= 21647825;    // 暫定
    
    $pmonth[2][0]  += 22512650;    // 確定 圧造工具 21,577,850円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $pmonth[9][0]  -= 22512650;    // 確定
}
// 2015/04/07 追加 仮払金→棚卸資産
if ($p1_ym >= 201504 && $p1_ym <= 201508) {
    $pmonth[2][0]  += 22512650;    // 確定 圧造工具 21,577,850円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $pmonth[9][0]  -= 22512650;    // 確定
}
// 2015/05/08 追加
if ($p1_ym == 201504) {
    $pmonth[1][0]  -= 215000;
    $pmonth[34][0] -= 15000;
    $pmonth[41][0] -= 200000;
}
// 2015/09/04 追加
if ($p1_ym == 201508) {
    $pmonth[1][0]  += 209488;
    $pmonth[34][0] += 15518;
    $pmonth[41][0] += 193970;
}
// 2015/10/07 追加
if ($p1_ym == 201409) {
    //$pmonth[2][0]  += 22512650;    // 暫定 圧造工具 21,577,850円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    //$pmonth[9][0]  -= 22512650;    // 暫定
    
    $pmonth[2][0]  += 21948500;    // 確定 圧造工具 21,013,700円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $pmonth[9][0]  -= 21948500;    // 確定
}
// 2015/10/07 追加 仮払金→棚卸資産
if ($p1_ym >= 201510 && $p1_ym <= 201602) {
    //$pmonth[2][0]  += 21948500;    // 確定 圧造工具 21,013,700円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    //$pmonth[9][0]  -= 21948500;    // 確定
    // 20151021にヤマハ単軸ロボット貯蔵品使用（336,600円）→ 貯蔵品として単軸ロボット再購入（416,700円）
    $pmonth[2][0]  += 22028600;    // 確定 圧造工具 21,013,700円 貯蔵品 ３点 1,014,900,800円（151,200円と447,000円と416,700円）
    $pmonth[9][0]  -= 22028600;    // 確定
}
// 2016/04/07 追加
if ($p1_ym == 201603) {
    $pmonth[2][0]  += 22443100;    // 確定 圧造工具 21,508,300円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $pmonth[9][0]  -= 22443100;    // 確定
}
// 2016/04/07 追加 仮払金→棚卸資産
if ($p1_ym >= 201604 && $p1_ym <= 201608) {
    $pmonth[2][0]  += 22443100;    // 確定 圧造工具 21,508,300円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $pmonth[9][0]  -= 22443100;    // 確定
}
// 2016/05/09 追加
if ($p1_ym == 201604) {
    $pmonth[1][0]  -= 600000;
    //$month[34][0] -= 48000;
    $pmonth[41][0] -= 600000;
}
    //$month[2][0]  += 27914000;    // 確定 圧造工具 26,979,200円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    //$month[9][0]  -= 27914000;    // 確定

// 2016/10/06 追加
if ($p1_ym == 201609) {
    $pmonth[2][0]  += 27994100;    // 確定 圧造工具 26,979,200円 貯蔵品 ３点 1,014,800円（151,200円と447,000円と416,700円）
    $pmonth[9][0]  -= 27994100;    // 確定
}
// 2016/10/06 追加 仮払金→棚卸資産
if ($p1_ym >= 201610 && $p1_ym <= 201610) {
    $pmonth[2][0]  += 27994100;    // 確定 圧造工具 26,979,200円 貯蔵品 ３点 1,014,800円（151,200円と447,000円と416,700円）
    $pmonth[9][0]  -= 27994100;    // 確定
}
// 2016/11/29 追加 仮払金→棚卸資産（11月よりACサーボモーター分 66,500円追加）
if ($p1_ym >= 201611 && $p1_ym <= 201611) {
    $pmonth[2][0]  += 28060500;    // 確定 圧造工具 26,979,200円 貯蔵品 ４点 1,081,300円（151,200円と447,000円と416,700円と66,500円）
    $pmonth[9][0]  -= 28060500;    // 確定
}
// 2016/12/21 追加 仮払金→棚卸資産（12月よりACサーボモーター分 58,000円追加）
if ($p1_ym >= 201612 && $p1_ym <= 201701) {
    $pmonth[2][0]  += 28118600;    // 確定 圧造工具 26,979,200円 貯蔵品 ４点 1,139,400円（151,200円と447,000円と416,700円と66,500円と58,000円）
    $pmonth[9][0]  -= 28118600;    // 確定
}
// 2017/03/03 追加 仮払金→棚卸資産（2月にヤマハ単軸ロボット 416,700円使用）
if ($p1_ym >= 201702 && $p1_ym <= 201702) {
    $pmonth[2][0]  += 27701900;    // 確定 圧造工具 26,979,200円 貯蔵品 ４点 722,700円（151,200円と447,000円と66,500円と58,000円）
    $pmonth[9][0]  -= 27701900;    // 確定
}
// 2017/04/07 追加
if ($p1_ym == 201703) {
    //$pmonth[2][0]  += 27701900;    // 暫定 圧造工具 26,979,200円 貯蔵品 ４点 722,700円（151,200円と447,000円と66,500円と58,000円）
    //$pmonth[9][0]  -= 27701900;    // 暫定
    
    $pmonth[2][0]  += 27170800;    // 確定 圧造工具 26,448,100円 貯蔵品 ４点 722,700円（151,200円と447,000円と66,500円と58,000円）
    $pmonth[9][0]  -= 27170800;    // 確定
}
// 2017/04/07 追加 仮払金→棚卸資産
if ($p1_ym >= 201704 && $p1_ym <= 201708) {
    $pmonth[2][0]  += 27170800;    // 確定 圧造工具 26,448,100円 貯蔵品 ４点 722,700円（151,200円と447,000円と66,500円と58,000円）
    $pmonth[9][0]  -= 27170800;    // 確定
}
// 2017/10/04 追加
if ($p1_ym == 201709) {
    //$pmonth[2][0]  += 27170800;    // 暫定 圧造工具 26,448,100円 貯蔵品 ４点 722,700円（151,200円と447,000円と66,500円と58,000円）
    //$pmonth[9][0]  -= 27170800;    // 暫定
    
    $pmonth[2][0]  += 31331800;    // 確定 圧造工具 30,609,100円 貯蔵品 ４点 722,700円（151,200円と447,000円と66,500円と58,000円）
    $pmonth[9][0]  -= 31331800;    // 確定
}
// 2017/10/04 追加 仮払金→棚卸資産
if ($p1_ym >= 201710 && $p1_ym <= 201802) {
    $pmonth[2][0]  += 31331800;    // 確定 圧造工具 30,609,100円 貯蔵品 ４点 722,700円（151,200円と447,000円と66,500円と58,000円）
    $pmonth[9][0]  -= 31331800;    // 確定
}
// 2018/03/29 追加
if ($p1_ym == 201803) {
    //$pmonth[2][0]  += 31809300;    // 暫定 圧造工具 30,609,100円 貯蔵品 ５点 1,200,200円（151,200円と447,000円と66,500円と58,000円と477,500円）
    //$pmonth[9][0]  -= 31809300;    // 暫定
    
    $pmonth[2][0]  += 30723300;    // 確定 圧造工具 29,523,100円 貯蔵品 ５点 1,200,200円（151,200円と447,000円と66,500円と58,000円と477,500円）
    $pmonth[9][0]  -= 30723300;    // 確定
}

// 2018/07/05 追加 仮払金→棚卸資産
if ($p1_ym >= 201804 && $p1_ym <= 201807) {
    $pmonth[2][0]  += 30723300;    // 確定 圧造工具 29,523,100円 貯蔵品 ５点 1,200,200円（151,200円と447,000円と66,500円と58,000円と477,500円）
    $pmonth[9][0]  -= 30723300;    // 確定
}
// 2018/09/05 追加 貯蔵品シンクロタッパ追加 348,000円
if ($p1_ym == 201808) {
    $pmonth[2][0]  += 31071300;    // 確定 圧造工具 29,523,100円 貯蔵品 ５点 1,548,200円（151,200円と447,000円と66,500円と58,000円と477,500円と348,000円）
    $pmonth[9][0]  -= 31071300;    // 確定
}
// 2018/10/04 追加
if ($p1_ym == 201809) {
    //$pmonth[2][0]  += 31071300;    // 暫定 圧造工具 29,523,100円 貯蔵品 ５点 1,548,200円（151,200円と447,000円と66,500円と58,000円と477,500円と348,000円）
    //$pmonth[9][0]  -= 31071300;    // 暫定
    
    $pmonth[2][0]  += 31076300;    // 確定 圧造工具 29,528,100円 貯蔵品 ５点 1,548,200円（151,200円と447,000円と66,500円と58,000円と477,500円と348,000円）
    $pmonth[9][0]  -= 31076300;    // 確定
}
// 2018/10/04 追加 仮払金→棚卸資産
if ($p1_ym >= 201810 && $p1_ym <= 201902) {
    $pmonth[2][0]  += 31076300;    // 確定 圧造工具 29,528,100円 貯蔵品 ５点 1,548,200円（151,200円と447,000円と66,500円と58,000円と477,500円と348,000円）
    $pmonth[9][0]  -= 31076300;    // 確定
}
// 2019/04/05 追加
if ($p1_ym == 201903) {
    //$pmonth[2][0]  += 31208800;    // 暫定 圧造工具 29,528,100円 貯蔵品 １０点 1,680,700円（151,200円と447,000円と58,000円と477,500円と348,000円と39,800円が5点）
    //$pmonth[9][0]  -= 31208800;    // 暫定
    
    $pmonth[2][0]  += 29013600;    // 確定 圧造工具 27,332,900円 貯蔵品 １０点 1,680,700円（151,200円と447,000円と58,000円と477,500円と348,000円と39,800円が5点）
    $pmonth[9][0]  -= 29013600;    // 確定
}
// 2019/04/08 追加 仮払金→棚卸資産
if ($p1_ym >= 201904 && $p1_ym <= 201908) {
    $pmonth[2][0]  += 29013600;    // 確定 圧造工具 27,332,900円 貯蔵品 １０点 1,680,700円（151,200円と447,000円と58,000円と477,500円と348,000円と39,800円が5点）
    $pmonth[9][0]  -= 29013600;    // 確定
}
// 2019/10/07 追加 仮払金→棚卸資産
if ($p1_ym >= 201909 && $p1_ym <= 202002) {
    $pmonth[2][0]  += 30711100;    // 確定 圧造工具 29,030,400円 貯蔵品 １０点 1,680,700円（151,200円と447,000円と58,000円と477,500円と348,000円と39,800円が5点）
    $pmonth[9][0]  -= 30711100;    // 確定
}
// 2020/04/06 追加
if ($p1_ym == 202003) {
    //$pmonth[2][0]  += 30653100;    // 暫定 圧造工具 29,030,400円 貯蔵品 ９点 1,622,700円（151,200円と447,000円と477,500円と348,000円と39,800円が5点）
    //$pmonth[9][0]  -= 30653100;    // 暫定
    
    $pmonth[2][0]  += 31847700;    // 確定 圧造工具 30,225,000円 貯蔵品 ９点 1,622,700円（151,200円と447,000円と477,500円と348,000円と39,800円が5点）
    $pmonth[9][0]  -= 31847700;    // 確定
}
// 2020/04/06 追加 仮払金→棚卸資産
if ($p1_ym >= 202004 && $p1_ym <= 202005) {
    $pmonth[2][0]  += 31847700;    // 確定 圧造工具 30,225,000円 貯蔵品 ９点 1,622,700円（151,200円と447,000円と477,500円と348,000円と39,800円が5点）
    $pmonth[9][0]  -= 31847700;    // 確定
}
// 2020/07/08 追加 仮払金→棚卸資産
if ($p1_ym >= 202006 && $p1_ym <= 202008) {
    $pmonth[2][0]  += 34437700;    // // 確定 圧造工具 30,225,000円 貯蔵品 ９点 4,212,700円（151,200円と447,000円と477,500円と348,000円と39,800円が5点と2,590,000円）
    $pmonth[9][0]  -= 34437700;    // 確定
}
// 2020/10/07 追加 仮払金→棚卸資産
if ($p1_ym >= 202009 && $p1_ym <= 202102) {
    $pmonth[2][0]  += 35225500;    // 確定 圧造工具 31,012,800円 貯蔵品 ９点 4,212,700円（151,200円と447,000円と477,500円と348,000円と39,800円が5点と2,590,000円）
    $pmonth[9][0]  -= 35225500;    // 確定
}
// 2021/04/07 追加 仮払金→棚卸資産
if ($p1_ym >= 202103 && $p1_ym <= 202105) {
    $pmonth[2][0]  += 34201500;    // 確定 圧造工具 29,988,800円 貯蔵品 ９点 4,212,700円（151,200円と447,000円と477,500円と348,000円と39,800円が5点と2,590,000円）
    $pmonth[9][0]  -= 34201500;    // 確定
}
// 2021/07/07 追加 仮払金→棚卸資産
if ($p1_ym >= 202106 && $p1_ym <= 202108) {
    $pmonth[2][0]  += 34390591;    // 確定 圧造工具 29,988,800円 貯蔵品 ９点 4,401,791円（151,200円と447,000円と477,500円と348,000円と39,800円が5点と2,590,000円と189,091円）
    $pmonth[9][0]  -= 34390591;    // 確定
}
// 2021/10/07 追加 仮払金→棚卸資産
if ($p1_ym >= 202109 && $p1_ym <= 202202) {
    $pmonth[2][0]  += 35918291;    // 確定 圧造工具 31,516,500円 貯蔵品 ９点 4,401,791円（151,200円と447,000円と477,500円と348,000円と39,800円が5点と2,590,000円と189,091円）
    $pmonth[9][0]  -= 35918291;    // 確定
}
// 2022/04/07 追加 仮払金→棚卸資産
if ($p1_ym >= 202203 && $p1_ym <= 202208) {
    $pmonth[2][0]  += 33416691;    // 確定 圧造工具 29,014,900円 貯蔵品 ９点 4,401,791円（151,200円と447,000円と477,500円と348,000円と39,800円が5点と2,590,000円と189,091円）
    $pmonth[9][0]  -= 33416691;    // 確定
}
    ///// 前月の仮受金チェック
$pmonth_kari = array();
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d and t_row=44 order by t_row ASC", $p1_ym);
if ((getResult2($query, $pmonth_kari)) > 0) {
    $pmonth[32][0] += $pmonth_kari[0][0];         // その他流動負債に加算
}
    ///// 前月の施設利用権チェックF45(2440)
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d and t_row=45 order by t_row ASC", $p1_ym);
if ((getUniResult($query, $pmonth_sisetu)) <= 0) {
    $pmonth_sisetu = 0;
}
    ///// 前月の施設利用権チェックF46(1475) 商法科目であることに注意 社内科目は1518
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d and t_row=46 order by t_row ASC", $p1_ym);
if ((getUniResult($query, $pmonth_mihojin)) <= 0) {
    $pmonth_mihojin = 0;
}

///////// 前々月
$ppmonth = array();
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d order by t_row ASC", $p2_ym);
$pprows = getResult2($query, $ppmonth);

// 2010/10/06 追加
if ($p2_ym == 201009) {
    $ppmonth[1][0]  += 6562097;
    $ppmonth[29][0] += 312481;
    $ppmonth[41][0] += 6249616;
}
// 2010/11/05 追加
if ($p2_ym == 201010) {
    $ppmonth[1][0]  += 6562097;
    $ppmonth[29][0] += 312481;
    $ppmonth[41][0] += 6249616;
    $ppmonth[1][0]  += 796423;
    $ppmonth[34][0] += 37925;
    $ppmonth[41][0] += 758498;
}
// 2010/12/03 追加
if (($p2_ym >= 201011) && ($p2_ym <= 201103)) {
    $ppmonth[1][0]  += 6562097;
    $ppmonth[29][0] += 312481;
    $ppmonth[41][0] += 6249616;
    $ppmonth[1][0]  += 796423;
    $ppmonth[34][0] += 37925;
    $ppmonth[41][0] += 758498;
    $ppmonth[1][0]  += 1817925;
    $ppmonth[34][0] += 86568;
    $ppmonth[41][0] += 1731357;
}
// 2011/04/06 追加
if ($p2_ym == 201103) {
    $ppmonth[1][0]  -= 6562097;
    $ppmonth[29][0] -= 312481;
    $ppmonth[41][0] -= 6249616;
    $ppmonth[1][0]  -= 796423;
    $ppmonth[34][0] -= 37925;
    $ppmonth[41][0] -= 758498;
    $ppmonth[1][0]  -= 1817925;
    $ppmonth[34][0] -= 86568;
    $ppmonth[41][0] -= 1731357;
    // 2011/04/20 追加 仮払金→棚卸資産（原材料及び貯蔵品）
    $ppmonth[2][0]  += 15278200;
    $ppmonth[9][0]  -= 15278200;
}
// 2011/10/18 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
if ($p2_ym >= 201104 && $p2_ym <= 201108) {
    $ppmonth[2][0]  += 15278200;
    $ppmonth[9][0]  -= 15278200;
}
// 2011/07/06 追加
if ($p2_ym == 201106) {
    $ppmonth[1][0]  += 315000;
    $ppmonth[34][0] += 15000;
    $ppmonth[41][0] += 300000;
}
// 2011/08/03 追加
if ($p2_ym == 201107) {
    $ppmonth[1][0]  -= 105000;
    $ppmonth[34][0] -= 5000;
    $ppmonth[41][0] -= 100000;
}
// 2011/09/05 追加
if ($p2_ym == 201108) {
    $ppmonth[1][0]  -= 105000;
    $ppmonth[34][0] -= 5000;
    $ppmonth[41][0] -= 100000;
}
// 2011/10/05 追加
if ($p2_ym == 201109) {
    $ppmonth[1][0]  += 210000;
    $ppmonth[34][0] += 10000;
    $ppmonth[41][0] += 200000;
    // 2011/10/18 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
    $ppmonth[2][0]  += 20205550;
    $ppmonth[9][0]  -= 20205550;
}
// 2012/04/04 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
if ($p2_ym == 201110) {
    $ppmonth[2][0]  += 20205550;
    $ppmonth[9][0]  -= 20205550;
}
// 2012/04/04 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
if ($p2_ym >= 201111 && $p2_ym <= 201112) {
    $ppmonth[2][0]  += 20331550;
    $ppmonth[9][0]  -= 20331550;
}
// 2012/04/04 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
if ($p2_ym >= 201201 && $p2_ym <= 201202) {
    $ppmonth[2][0]  += 20518550;
    $ppmonth[9][0]  -= 20518550;
}
// 2011/11/04 追加
if ($p2_ym == 201110) {
    $ppmonth[1][0]  += 315000;
    $ppmonth[34][0] += 15000;
    $ppmonth[41][0] += 300000;
}
// 2011/12/05 追加
if ($p2_ym == 201111) {
    $ppmonth[1][0]  -= 315000;
    $ppmonth[34][0] -= 15000;
    $ppmonth[41][0] -= 300000;
}
// 2012/02/03 追加
if ($p2_ym == 201201) {
    $ppmonth[1][0]  += 105000;
    $ppmonth[34][0] += 5000;
    $ppmonth[41][0] += 100000;
    // 2012/02/08 追加 2012年1月度 業務委託費（平出横川派遣料）調整
    $ppmonth[28][0] += 1156130;   // 未払金
    $ppmonth[41][0] -= 1156130;   // 純利益
}
// 2012/02/03 追加
if ($p2_ym == 201202) {
    $ppmonth[1][0]  += 210000;
    $ppmonth[34][0] += 10000;
    $ppmonth[41][0] += 200000;
    // 追加 2012年1月度 業務委託費（平出横川派遣料）調整 戻し
    //$ppmonth[28][0] -= 1156130;   // 未払金
    //$ppmonth[41][0] += 1156130;   // 純利益
}
// 2012/04/04 追加
if ($p2_ym == 201203) {
    $ppmonth[1][0]  += 105000;
    $ppmonth[34][0] += 5000;
    $ppmonth[41][0] += 100000;
    //$ppmonth[1][0]  -= 2562709;
    //$ppmonth[34][0] -= 122034;
    //$ppmonth[41][0] -= 2440675;
    // 2012/04/04 追加 仮払金→棚卸資産（原材料及び貯蔵品）
    $ppmonth[2][0]  += 19777150;
    $ppmonth[9][0]  -= 19777150;
}
// 2012/04/04 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
if ($p2_ym >= 201204 && $p2_ym <= 201208) {
    $ppmonth[2][0]  += 19777150;
    $ppmonth[9][0]  -= 19777150;
}
// 2012/05/07 追加
if ($p2_ym == 201204) {
    $ppmonth[1][0]  -= 210000;
    $ppmonth[34][0] -= 10000;
    $ppmonth[41][0] -= 200000;
}
// 2012/06/05 追加
if ($p2_ym == 201205) {
    $ppmonth[1][0]  += 315000;
    $ppmonth[34][0] += 15000;
    $ppmonth[41][0] += 300000;
}
// 2012/07/04 追加
if ($p2_ym == 201206) {
    $ppmonth[1][0]  -= 105000;
    $ppmonth[34][0] -= 5000;
    $ppmonth[41][0] -= 100000;
}
// 2012/07/11 追加
if ($p2_ym >= 201204 && $p2_ym <= 201211) {
    //前期分
    $ppmonth[1][0]  += 105000;
    $ppmonth[34][0] += 5000;
    $ppmonth[41][0] += 100000;
}
// 2012/08/03 追加
if ($p2_ym == 201207) {
    $ppmonth[1][0]  -= 2562709;
    $ppmonth[34][0] -= 122034;
    $ppmonth[41][0] -= 2440675;
    $ppmonth[1][0]  -= 105000;
    $ppmonth[34][0] -= 5000;
    $ppmonth[41][0] -= 100000;
}
// 2012/09/05 追加
if ($p2_ym == 201208) {
    $ppmonth[1][0]  -= 105000;
    $ppmonth[34][0] -= 5000;
    $ppmonth[41][0] -= 100000;
}

// 2012/10/04 追加
if ($p2_ym == 201209) {
    $ppmonth[1][0]  -= 105000;
    $ppmonth[34][0] -= 5000;
    $ppmonth[41][0] -= 100000;
    $ppmonth[1][0]  -= 2562709;
    $ppmonth[29][0] -= 122034;
    $ppmonth[41][0] -= 2440675;
    //$ppmonth[2][0]  += 19615350;  // 暫定用 圧造工具 19,017,150円 貯蔵品 ２点 598,200円（151,200円と447,000円）
    //$ppmonth[9][0]  -= 19615350;  // 暫定用
    $ppmonth[2][0]  += 17516725;    // 確定 圧造工具 16,918,525円 貯蔵品 ２点 598,200円（151,200円と447,000円）
    $ppmonth[9][0]  -= 17516725;    // 確定
}
// 2012/10/04 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
if ($p2_ym >= 201210 && $p2_ym <= 201302) {
    $ppmonth[2][0]  += 17516725;
    $ppmonth[9][0]  -= 17516725;
}
// 2012/11/05 追加
if ($p2_ym == 201210) {
    $ppmonth[1][0]  -= 105000;
    $ppmonth[34][0] -= 5000;
    $ppmonth[41][0] -= 100000;
    $ppmonth[1][0]  -= 2562709;
    $ppmonth[29][0] -= 122034;
    $ppmonth[41][0] -= 2440675;
}
// 2012/12/05 追加
if ($p2_ym == 201211) {
    $ppmonth[1][0]  -= 105000;
    $ppmonth[34][0] -= 5000;
    $ppmonth[41][0] -= 100000;
    $ppmonth[1][0]  -= 2562709;
    $ppmonth[29][0] -= 122034;
    $ppmonth[41][0] -= 2440675;
}
// 2013/01/11 追加
if ($p2_ym == 201212) {
    //$ppmonth[1][0]  -= 105000;
    //$ppmonth[34][0] -= 5000;
    //$ppmonth[41][0] -= 100000;
    $ppmonth[1][0]  -= 2562709;
    $ppmonth[29][0] -= 122034;
    $ppmonth[41][0] -= 2440675;
}
// 2013/02/05 追加
// 決算時(確定時)に消費税の振替処理が行われた際に
// IFの条件日付右側を201303から201302へ変更すること
if ($p2_ym >= 201301 && $p2_ym <= 201302) {
    //未払消費税[29] 仮受消費税[34] 調整
    $ppmonth[29][0] -= 122034;
    $ppmonth[34][0] += 122034;
}
// 決算時(確定時)に当期純利益が繰越利益剰余金に振り返られた際に
// IFの条件日付を201303から201302へ変更すること
if ($p2_ym >= 201204 && $p2_ym <= 201302) {
    //繰越利益剰余金[40] 当期純利益[41] 調整
    $ppmonth[41][0] -= 100000;
    $ppmonth[40][0] += 100000;
}
// 2013/03/05 追加
if ($p2_ym == 201302) {
    $ppmonth[1][0]  -= 5794530;
    $ppmonth[34][0] -= 275930;
    $ppmonth[41][0] -= 5518600;
}
// 2013/03/05 追加
if ($p2_ym == 201303) {
    //$ppmonth[1][0]  += 5794530;
    //$ppmonth[34][0] += 275930;
    //$ppmonth[41][0] += 5518600;
    //$ppmonth[2][0]  += 17516725;  // 暫定用 圧造工具 16,918,525円 貯蔵品 ２点 598,200円（151,200円と447,000円）
    //$ppmonth[9][0]  -= 17516725;  // 暫定用
    $ppmonth[2][0]  += 18517075;    // 確定 圧造工具 17,918,875円 貯蔵品 ２点 598,200円（151,200円と447,000円）
    $ppmonth[9][0]  -= 18517075;    // 確定
}
// 2013/04/08 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
if ($p2_ym >= 201304 && $p2_ym <= 201304) {
    $ppmonth[2][0]  += 18517075;    // 確定 圧造工具 17,918,875円 貯蔵品 ２点 598,200円（151,200円と447,000円）
    $ppmonth[9][0]  -= 18517075;    // 確定
}
// 2013/05/28 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）貯蔵品１点追加(ヤマハ単軸ロボット 336,600円)
if ($p2_ym >= 201305 && $p2_ym <= 201308) {
    $ppmonth[2][0]  += 18853675;  // 確定 圧造工具 17,918,875円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $ppmonth[9][0]  -= 18853675;  // 確定
}
// 2013/10/10 追加 未払消費税[29] を 未収消費税等へ振替 未払 5,269,700 → 0 未収 9,622,964-5,269,700=4,353,264
if ($p2_ym == 201309) {
    $ppmonth[29][0] -= 5269700;
    $ppmonth[42][0] -= 5269700;
}
// 2013/10/08 追加 仮払金→棚卸資産（貯蔵品 自動倉庫保守部品及び鍛造金型）
if ($p2_ym >= 201309 && $p2_ym <= 201402) {
    $ppmonth[2][0]  += 19326300;    // 確定 圧造工具 18,391,500円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $ppmonth[9][0]  -= 19326300;    // 確定
}
// 2013/11/06 追加
if ($p2_ym == 201310) {
    $ppmonth[1][0]  += 105000;
    $ppmonth[34][0] += 5000;
    $ppmonth[41][0] += 100000;
}
// 2014/01/10 追加
if ($p2_ym == 201312) {
    $ppmonth[1][0]  += 105000;
    $ppmonth[34][0] += 5000;
    $ppmonth[41][0] += 100000;
}
// 2014/02/05 追加
if ($p2_ym == 201401) {
    $ppmonth[1][0]  += 525000;
    $ppmonth[34][0] += 25000;
    $ppmonth[41][0] += 500000;
}
// 2014/03/05 追加
if ($p2_ym == 201402) {
    $ppmonth[1][0]  += 315000;
    $ppmonth[34][0] += 15000;
    $ppmonth[41][0] += 300000;
}
// 2014/04/03 追加
if ($p2_ym == 201403) {
    //$ppmonth[2][0]  += 19326300;    // 暫定用 圧造工具 18,391,500円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    //$ppmonth[9][0]  -= 19326300;    // 暫定用
    // 直接商管の調整をASに入力するようになった為、調整を解除
    //$ppmonth[1][0]  -= 105000;
    //$ppmonth[34][0] -= 5000;
    //$ppmonth[41][0] -= 100000;
    $ppmonth[2][0]  += 21957050;    // 確定 圧造工具 21,022,250円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $ppmonth[9][0]  -= 21957050;    // 確定
    //未払消費税[29] を 未収消費税等へ振替 未払 5,269,700 → 0 未収 9,622,964-5,269,700=4,353,264
    //$month[29][0] -= 5269700;
    //$month[42][0] -= 5269700;
}
// 2014/06/12 追加 仮払金→棚卸資産
if ($p2_ym >= 201404 && $p2_ym <= 201408) {
    $ppmonth[2][0]  += 21957050;    // 確定 圧造工具 21,022,250円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $ppmonth[9][0]  -= 21957050;    // 確定
}
// 2014/06/04 追加
if ($p2_ym == 201405) {
    $ppmonth[1][0]  -= 540000;
    $ppmonth[34][0] -= 40000;
    $ppmonth[41][0] -= 500000;
}
// 2014/10/06 追加
if ($p2_ym == 201409) {
    //$ppmonth[2][0]  += 21957050;    // 暫定用 圧造工具 21,022,250円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    //$ppmonth[9][0]  -= 21957050;    // 暫定用
    
    $ppmonth[2][0]  += 21647825;    // 確定 圧造工具 20,713,025円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $ppmonth[9][0]  -= 21647825;    // 確定
}
// 2014/10/06 追加 仮払金→棚卸資産
if ($p2_ym >= 201410 && $p2_ym <= 201502) {
    $ppmonth[2][0]  += 21647825;    // 確定 圧造工具 20,713,025円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $ppmonth[9][0]  -= 21647825;    // 確定
}

// 2015/04/07 追加
if ($p2_ym == 201503) {
    //$ppmonth[2][0]  += 21647825;    // 暫定 圧造工具 20,713,025円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    //$ppmonth[9][0]  -= 21647825;    // 暫定
    
    $ppmonth[2][0]  += 22512650;    // 確定 圧造工具 21,577,850円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $ppmonth[9][0]  -= 22512650;    // 確定
}
// 2015/04/07 追加 仮払金→棚卸資産
if ($p2_ym >= 201504 && $p2_ym <= 201508) {
    $ppmonth[2][0]  += 22512650;    // 確定 圧造工具 21,577,850円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $ppmonth[9][0]  -= 22512650;    // 確定
}
// 2015/05/08 追加
if ($p2_ym == 201504) {
    $ppmonth[1][0]  -= 215000;
    $ppmonth[34][0] -= 15000;
    $ppmonth[41][0] -= 200000;
}
// 2015/09/04 追加
if ($p2_ym == 201508) {
    $ppmonth[1][0]  += 209488;
    $ppmonth[34][0] += 15518;
    $ppmonth[41][0] += 193970;
}
// 2015/10/07 追加
if ($p2_ym == 201409) {
    //$ppmonth[2][0]  += 22512650;    // 暫定 圧造工具 21,577,850円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    //$ppmonth[9][0]  -= 22512650;    // 暫定
    
    $ppmonth[2][0]  += 21948500;    // 確定 圧造工具 21,013,700円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $ppmonth[9][0]  -= 21948500;    // 確定
}
// 2015/10/07 追加 仮払金→棚卸資産
if ($p2_ym >= 201510 && $p2_ym <= 201602) {
    //$ppmonth[2][0]  += 21948500;    // 確定 圧造工具 21,013,700円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    //$ppmonth[9][0]  -= 21948500;    // 確定
    // 20151021にヤマハ単軸ロボット貯蔵品使用（336,600円）→ 貯蔵品として単軸ロボット再購入（416,700円）
    $ppmonth[2][0]  += 22028600;    // 確定 圧造工具 21,013,700円 貯蔵品 ３点 1,014,900,800円（151,200円と447,000円と416,700円）
    $ppmonth[9][0]  -= 22028600;    // 確定
}
// 2016/04/07 追加
if ($p2_ym == 201603) {
    $ppmonth[2][0]  += 22443100;    // 確定 圧造工具 21,508,300円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $ppmonth[9][0]  -= 22443100;    // 確定
}
// 2016/04/07 追加 仮払金→棚卸資産
if ($p2_ym >= 201604 && $p2_ym <= 201608) {
    $ppmonth[2][0]  += 22443100;    // 確定 圧造工具 21,508,300円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $ppmonth[9][0]  -= 22443100;    // 確定
}
// 2016/05/09 追加
if ($p2_ym == 201604) {
    $ppmonth[1][0]  -= 600000;
    //$month[34][0] -= 48000;
    $ppmonth[41][0] -= 600000;
}
// 2016/10/06 追加
if ($p2_ym == 201609) {
    $ppmonth[2][0]  += 27994100;    // 確定 圧造工具 26,979,200円 貯蔵品 ３点 1,014,800円（151,200円と447,000円と416,700円）
    $ppmonth[9][0]  -= 27994100;    // 確定
}
// 2016/10/06 追加 仮払金→棚卸資産
if ($p2_ym >= 201610 && $p2_ym <= 201610) {
    $ppmonth[2][0]  += 27994100;    // 確定 圧造工具 26,979,200円 貯蔵品 ３点 1,014,800円（151,200円と447,000円と416,700円）
    $ppmonth[9][0]  -= 27994100;    // 確定
}
// 2016/11/29 追加 仮払金→棚卸資産（11月よりACサーボモーター分 66,500円追加）
if ($p2_ym >= 201611 && $p2_ym <= 201611) {
    $ppmonth[2][0]  += 28060500;    // 確定 圧造工具 26,979,200円 貯蔵品 ４点 1,081,300円（151,200円と447,000円と416,700円と66,500円）
    $ppmonth[9][0]  -= 28060500;    // 確定
}
// 2016/12/21 追加 仮払金→棚卸資産（12月よりACサーボモーター分 58,000円追加）
if ($p2_ym >= 201612 && $p2_ym <= 201701) {
    $ppmonth[2][0]  += 28118600;    // 確定 圧造工具 26,979,200円 貯蔵品 ４点 1,139,400円（151,200円と447,000円と416,700円と66,500円と58,000円）
    $ppmonth[9][0]  -= 28118600;    // 確定
}
// 2017/03/03 追加 仮払金→棚卸資産（2月にヤマハ単軸ロボット 416,700円使用）
if ($p2_ym >= 201702 && $p2_ym <= 201702) {
    $ppmonth[2][0]  += 27701900;    // 確定 圧造工具 26,979,200円 貯蔵品 ４点 722,700円（151,200円と447,000円と66,500円と58,000円）
    $ppmonth[9][0]  -= 27701900;    // 確定
}
// 2017/04/07 追加
if ($p2_ym == 201703) {
    //$ppmonth[2][0]  += 27701900;    // 暫定 圧造工具 26,979,200円 貯蔵品 ４点 722,700円（151,200円と447,000円と66,500円と58,000円）
    //$ppmonth[9][0]  -= 27701900;    // 暫定
    
    $ppmonth[2][0]  += 27170800;    // 確定 圧造工具 26,448,100円 貯蔵品 ４点 722,700円（151,200円と447,000円と66,500円と58,000円）
    $ppmonth[9][0]  -= 27170800;    // 確定
}
// 2017/04/07 追加 仮払金→棚卸資産
if ($p2_ym >= 201704 && $p2_ym <= 201708) {
    $ppmonth[2][0]  += 27170800;    // 確定 圧造工具 26,448,100円 貯蔵品 ４点 722,700円（151,200円と447,000円と66,500円と58,000円）
    $ppmonth[9][0]  -= 27170800;    // 確定
}
// 2017/10/04 追加
if ($p2_ym == 201709) {
    //$ppmonth[2][0]  += 27170800;    // 暫定 圧造工具 26,448,100円 貯蔵品 ４点 722,700円（151,200円と447,000円と66,500円と58,000円）
    //$ppmonth[9][0]  -= 27170800;    // 暫定
    
    $ppmonth[2][0]  += 31331800;    // 確定 圧造工具 30,609,100円 貯蔵品 ４点 722,700円（151,200円と447,000円と66,500円と58,000円）
    $ppmonth[9][0]  -= 31331800;    // 確定
}
// 2017/10/04 追加 仮払金→棚卸資産
if ($p2_ym >= 201710 && $p2_ym <= 201802) {
    $ppmonth[2][0]  += 31331800;    // 確定 圧造工具 30,609,100円 貯蔵品 ４点 722,700円（151,200円と447,000円と66,500円と58,000円）
    $ppmonth[9][0]  -= 31331800;    // 確定
}
// 2018/03/29 追加
if ($p2_ym == 201803) {
    //$ppmonth[2][0]  += 31809300;    // 暫定 圧造工具 30,609,100円 貯蔵品 ５点 1,200,200円（151,200円と447,000円と66,500円と58,000円と477,500円）
    //$ppmonth[9][0]  -= 31809300;    // 暫定
    
    $ppmonth[2][0]  += 30723300;    // 確定 圧造工具 29,523,100円 貯蔵品 ５点 1,200,200円（151,200円と447,000円と66,500円と58,000円と477,500円）
    $ppmonth[9][0]  -= 30723300;    // 確定
}

// 2018/07/05 追加 仮払金→棚卸資産
if ($p2_ym >= 201804 && $p2_ym <= 201807) {
    $ppmonth[2][0]  += 30723300;    // 確定 圧造工具 29,523,100円 貯蔵品 ５点 1,200,200円（151,200円と447,000円と66,500円と58,000円と477,500円）
    $ppmonth[9][0]  -= 30723300;    // 確定
}
// 2018/09/05 追加 貯蔵品シンクロタッパ追加 348,000円
if ($p2_ym == 201808) {
    $ppmonth[2][0]  += 31071300;    // 確定 圧造工具 29,523,100円 貯蔵品 ５点 1,548,200円（151,200円と447,000円と66,500円と58,000円と477,500円と348,000円）
    $ppmonth[9][0]  -= 31071300;    // 確定
}
// 2018/10/04 追加
if ($p2_ym == 201809) {
    //$ppmonth[2][0]  += 31071300;    // 暫定 圧造工具 29,523,100円 貯蔵品 ５点 1,548,200円（151,200円と447,000円と66,500円と58,000円と477,500円と348,000円）
    //$ppmonth[9][0]  -= 31071300;    // 暫定
    
    $ppmonth[2][0]  += 31076300;    // 確定 圧造工具 29,528,100円 貯蔵品 ５点 1,548,200円（151,200円と447,000円と66,500円と58,000円と477,500円と348,000円）
    $ppmonth[9][0]  -= 31076300;    // 確定
}
// 2018/10/04 追加 仮払金→棚卸資産
if ($p2_ym >= 201810 && $p2_ym <= 201902) {
    $ppmonth[2][0]  += 31076300;    // 確定 圧造工具 29,528,100円 貯蔵品 ５点 1,548,200円（151,200円と447,000円と66,500円と58,000円と477,500円と348,000円）
    $ppmonth[9][0]  -= 31076300;    // 確定
}
// 2019/04/05 追加
if ($p2_ym == 201903) {
    //$ppmonth[2][0]  += 31208800;    // 暫定 圧造工具 29,528,100円 貯蔵品 １０点 1,680,700円（151,200円と447,000円と58,000円と477,500円と348,000円と39,800円が5点）
    //$ppmonth[9][0]  -= 31208800;    // 暫定
    
    $ppmonth[2][0]  += 29013600;    // 確定 圧造工具 27,332,900円 貯蔵品 １０点 1,680,700円（151,200円と447,000円と58,000円と477,500円と348,000円と39,800円が5点）
    $ppmonth[9][0]  -= 29013600;    // 確定
}
// 2019/04/08 追加 仮払金→棚卸資産
if ($p2_ym >= 201904 && $p2_ym <= 201908) {
    $ppmonth[2][0]  += 29013600;    // 確定 圧造工具 27,332,900円 貯蔵品 １０点 1,680,700円（151,200円と447,000円と58,000円と477,500円と348,000円と39,800円が5点）
    $ppmonth[9][0]  -= 29013600;    // 確定
}
// 2019/10/07 追加 仮払金→棚卸資産
if ($p2_ym >= 201909 && $p2_ym <= 202002) {
    $ppmonth[2][0]  += 30711100;    // 確定 圧造工具 29,030,400円 貯蔵品 １０点 1,680,700円（151,200円と447,000円と58,000円と477,500円と348,000円と39,800円が5点）
    $ppmonth[9][0]  -= 30711100;    // 確定
}
// 2020/04/06 追加
if ($p2_ym == 202003) {
    //$ppmonth[2][0]  += 30653100;    // 暫定 圧造工具 29,030,400円 貯蔵品 ９点 1,622,700円（151,200円と447,000円と477,500円と348,000円と39,800円が5点）
    //$ppmonth[9][0]  -= 30653100;    // 暫定
    
    $ppmonth[2][0]  += 31847700;    // 確定 圧造工具 30,225,000円 貯蔵品 ９点 1,622,700円（151,200円と447,000円と477,500円と348,000円と39,800円が5点）
    $ppmonth[9][0]  -= 31847700;    // 確定
}
// 2020/04/06 追加 仮払金→棚卸資産
if ($p2_ym >= 202004 && $p2_ym <= 202005) {
    $ppmonth[2][0]  += 31847700;    // 確定 圧造工具 30,225,000円 貯蔵品 ９点 1,622,700円（151,200円と447,000円と477,500円と348,000円と39,800円が5点）
    $ppmonth[9][0]  -= 31847700;    // 確定
}
// 2020/07/08 追加 仮払金→棚卸資産
if ($p2_ym >= 202006 && $p2_ym <= 202008) {
    $ppmonth[2][0]  += 34437700;    // // 確定 圧造工具 30,225,000円 貯蔵品 ９点 4,212,700円（151,200円と447,000円と477,500円と348,000円と39,800円が5点と2,590,000円）
    $ppmonth[9][0]  -= 34437700;    // 確定
}
// 2020/10/07 追加 仮払金→棚卸資産
if ($p2_ym >= 202009 && $p2_ym <= 202102) {
    $ppmonth[2][0]  += 35225500;    // 確定 圧造工具 31,012,800円 貯蔵品 ９点 4,212,700円（151,200円と447,000円と477,500円と348,000円と39,800円が5点と2,590,000円）
    $ppmonth[9][0]  -= 35225500;    // 確定
}
// 2021/04/07 追加 仮払金→棚卸資産
if ($p2_ym >= 202103 && $p2_ym <= 202105) {
    $ppmonth[2][0]  += 34201500;    // 確定 圧造工具 29,988,800円 貯蔵品 ９点 4,212,700円（151,200円と447,000円と477,500円と348,000円と39,800円が5点と2,590,000円）
    $ppmonth[9][0]  -= 34201500;    // 確定
}
// 2021/07/07 追加 仮払金→棚卸資産
if ($p2_ym >= 202106 && $p2_ym <= 202108) {
    $ppmonth[2][0]  += 34390591;    // 確定 圧造工具 29,988,800円 貯蔵品 ９点 4,401,791円（151,200円と447,000円と477,500円と348,000円と39,800円が5点と2,590,000円と189,091円）
    $ppmonth[9][0]  -= 34390591;    // 確定
}
// 2021/10/07 追加 仮払金→棚卸資産
if ($p2_ym >= 202109 && $p2_ym <= 202202) {
    $ppmonth[2][0]  += 35918291;    // 確定 圧造工具 31,516,500円 貯蔵品 ９点 4,401,791円（151,200円と447,000円と477,500円と348,000円と39,800円が5点と2,590,000円と189,091円）
    $ppmonth[9][0]  -= 35918291;    // 確定
}
// 2022/04/07 追加 仮払金→棚卸資産
if ($p2_ym >= 202203 && $p2_ym <= 202208) {
    $ppmonth[2][0]  += 33416691;    // 確定 圧造工具 29,014,900円 貯蔵品 ９点 4,401,791円（151,200円と447,000円と477,500円と348,000円と39,800円が5点と2,590,000円と189,091円）
    $ppmonth[9][0]  -= 33416691;    // 確定
}
    ///// 前々月の仮受金チェック
$ppmonth_kari = array();
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d and t_row=44 order by t_row ASC", $p2_ym);
if ((getResult2($query, $ppmonth_kari)) > 0) {
    $ppmonth[32][0] += $ppmonth_kari[0][0];         // その他流動負債に加算
}
    ///// 前々月の施設利用権チェックF45(2440)
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d and t_row=45 order by t_row ASC", $p2_ym);
if ((getUniResult($query, $ppmonth_sisetu)) <= 0) {
    $ppmonth_sisetu = 0;
}
    ///// 前々月の施設利用権チェックF46(1475) 商法科目であることに注意 社内科目は1518
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d and t_row=46 order by t_row ASC", $p2_ym);
if ((getUniResult($query, $ppmonth_mihojin)) <= 0) {
    $ppmonth_mihojin = 0;
}
    ///// 期首 (前期末の決算データ)
$kisyu_month = array();
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d order by t_row ASC", $pre_end_ym);
$kisyu_rows = getResult2($query, $kisyu_month);

// 2010/10/06 追加
if ($pre_end_ym == 201103) {
    $kisyu_month[1][0]  += 6562097;
    $kisyu_month[29][0] += 312481;
    $kisyu_month[41][0] += 6249616;
}
// 2010/11/05 追加
if ($pre_end_ym == 201103) {
    $kisyu_month[1][0]  += 796423;
    $kisyu_month[34][0] += 37925;
    $kisyu_month[41][0] += 758498;
}
// 2010/12/03 追加
if ($pre_end_ym == 201103) {
    $kisyu_month[1][0]  += 1817925;
    $kisyu_month[34][0] += 86568;
    $kisyu_month[41][0] += 1731357;
}
// 2011/04/06 追加
if ($pre_end_ym == 201103) {
    $kisyu_month[1][0]  -= 6562097;
    $kisyu_month[29][0] -= 312481;
    $kisyu_month[41][0] -= 6249616;
    $kisyu_month[1][0]  -= 796423;
    $kisyu_month[34][0] -= 37925;
    $kisyu_month[41][0] -= 758498;
    $kisyu_month[1][0]  -= 1817925;
    $kisyu_month[34][0] -= 86568;
    $kisyu_month[41][0] -= 1731357;
    // 2011/04/20 追加 仮払金→棚卸資産（原材料及び貯蔵品）
    $kisyu_month[2][0]  += 15278200;
    $kisyu_month[9][0]  -= 15278200;
}
// 2012/04/04 追加
if ($pre_end_ym == 201203) {
    $kisyu_month[1][0]  += 105000;
    $kisyu_month[34][0] += 5000;
    $kisyu_month[41][0] += 100000;
    //$kisyu_month[1][0]  -= 2562709;
    //$kisyu_month[34][0] -= 122034;
    //$kisyu_month[41][0] -= 2440675;
    // 2012/04/04 追加 仮払金→棚卸資産（原材料及び貯蔵品）
    $kisyu_month[2][0]  += 19777150;
    $kisyu_month[9][0]  -= 19777150;
}
// 2013/04/08 追加
if ($pre_end_ym == 201303) {
    // 2013/04/08 追加 仮払金→棚卸資産（原材料及び貯蔵品）
    $kisyu_month[2][0]  += 18517075;    // 確定 圧造工具 17,918,875円 貯蔵品 ２点 598,200円（151,200円と447,000円）
    $kisyu_month[9][0]  -= 18517075;    // 確定
}
// 2014/04/04 追加
if ($pre_end_ym == 201403) {
    $kisyu_month[2][0]  += 21957050;    // 確定 圧造工具 21,022,250円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $kisyu_month[9][0]  -= 21957050;    // 確定
    // 直接商管の調整をASに入力するようになった為、調整を解除
    //$kisyu_month[1][0]  -= 105000;
    //$kisyu_month[34][0] -= 5000;
    //$kisyu_month[41][0] -= 100000;
}
// 2015/04/07 追加
if ($pre_end_ym == 201503) {
    $kisyu_month[2][0]  += 22512650;    // 確定 圧造工具 21,577,850円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $kisyu_month[9][0]  -= 22512650;    // 確定
}
// 2016/04/07 追加
if ($pre_end_ym == 201603) {
    $kisyu_month[2][0]  += 22443100;    // 確定 圧造工具 21,508,300円 貯蔵品 ３点 934,800円（151,200円と447,000円と336,600円）
    $kisyu_month[9][0]  -= 22443100;    // 確定
}
// 2017/04/07 追加 仮払金→棚卸資産
if ($pre_end_ym == 201703) {
    $kisyu_month[2][0]  += 27170800;    // 確定 圧造工具 26,448,100円 貯蔵品 ４点 722,700円（151,200円と447,000円と66,500円と58,000円）
    $kisyu_month[9][0]  -= 27170800;    // 確定
}
// 2018/04/06 追加 仮払金→棚卸資産
if ($pre_end_ym == 201803) {
    $kisyu_month[2][0]  += 30723300;    // 確定 圧造工具 29,523,100円 貯蔵品 ５点 1,200,200円（151,200円と447,000円と66,500円と58,000円と477,500円）
    $kisyu_month[9][0]  -= 30723300;    // 確定
}
// 2019/04/08 追加 仮払金→棚卸資産
if ($pre_end_ym == 201903) {
    $kisyu_month[2][0]  += 29013600;    // 確定 圧造工具 27,332,900円 貯蔵品 １０点 1,680,700円（151,200円と447,000円と58,000円と477,500円と348,000円と39,800円が5点）
    $kisyu_month[9][0]  -= 29013600;    // 確定
}
// 2020/04/06 追加 仮払金→棚卸資産
if ($pre_end_ym == 202003) {
    $kisyu_month[2][0]  += 31847700;    // 確定 圧造工具 30,225,000円 貯蔵品 ９点 1,622,700円（151,200円と447,000円と477,500円と348,000円と39,800円が5点）
    $kisyu_month[9][0]  -= 31847700;    // 確定
}
// 2021/04/07 追加 仮払金→棚卸資産
if ($pre_end_ym == 202103) {
    $kisyu_month[2][0]  += 34201500;    // 確定 圧造工具 29,988,800円 貯蔵品 ９点 4,212,700円（151,200円と447,000円と477,500円と348,000円と39,800円が5点と2,590,000円）
    $kisyu_month[9][0]  -= 34201500;    // 確定
}
// 2022/04/07 追加 仮払金→棚卸資産
if ($pre_end_ym == 202203) {
    $kisyu_month[2][0]  += 33416691;    // 確定 圧造工具 29,014,900円 貯蔵品 ９点 4,401,791円（151,200円と447,000円と477,500円と348,000円と39,800円が5点と2,590,000円と189,091円）
    $kisyu_month[9][0]  -= 33416691;    // 確定
}
    ///// 期首の施設利用権チェックF45(2440)
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d and t_row=45 order by t_row ASC", $pre_end_ym);
if ((getUniResult($query, $premonth_sisetu)) <= 0) {
    $premonth_sisetu = 0;
}
    ///// 期首の施設利用権チェックF46(1475) 商法科目であることに注意 社内科目は1518
$query = sprintf("select kin1 from pl_bs_summary where t_id='F' and pl_bs_ym=%d and t_row=46 order by t_row ASC", $pre_end_ym);
if ((getUniResult($query, $premonth_mihojin)) <= 0) {
    $premonth_mihojin = 0;
}

///// 配列データを表形式に整形する
$data      = array();   // 計算用データ配列
$view_data = array();   // 表示用データ配列
for ($r = 1; $r < $rows; $r++) {            // 当月の行数でカウント開始 スタートが１からに注意
    for ($c = 1; $c <= 6; $c++) {           // カラム数 (期首 前々月 前月 当月 前月増減 期間増減)
        if ($c == 1) {                // 期首の決算データ
            if ($r == 3) {                  // 棚卸資産をまとめる F3 原材料及び貯蔵品(1250)
                if (isset($kisyu_month[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $kisyu_month[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                } else {
                    $data[3][$c]      =  0 ;     // データがセットされていない場合は０で初期化
                    $view_data[3][$c] = '0';     // データがセットされていない場合は０で初期化
                }
            } elseif ($r == 4) {   // 棚卸資産をまとめる 2009/07/08追加 F4 仕掛品(1240)
                if (isset($kisyu_month[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $kisyu_month[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                }
            } elseif ($r == 47) {   // 棚卸資産をまとめる F47 貯蔵品(1270)
                if (isset($kisyu_month[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $kisyu_month[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                }
            } elseif ($r == 53) {   // 棚卸資産をまとめる F53 商品及び製品(1230)
                if (isset($kisyu_month[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $kisyu_month[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                }
            } elseif (($r >= 13) && ($r <= 16)) {   // 有形固定資産をまとめる
                if (isset($kisyu_month[$r-1][0])) {
                    $data[12][$c]      = ($data[12][$c] + $kisyu_month[$r-1][0]);
                    $view_data[12][$c] = number_format(($data[12][$c] / $tani), $keta);
                } else {
                    $data[12][$c]      =  0 ;    // データがセットされていない場合は０で初期化
                    $view_data[12][$c] = '0';    // データがセットされていない場合は０で初期化
                }
            } elseif ($r == 48) {   // 有形固定資産をまとめる F48 リース資産(2211)
                if (isset($kisyu_month[$r-1][0])) {
                    $data[12][$c]      = ($data[12][$c] + $kisyu_month[$r-1][0]);
                    $view_data[12][$c] = number_format(($data[12][$c] / $tani), $keta);
                }
            } else {                        // 科目が１対１に対応している物
                if (isset($kisyu_month[$r-1][0])) {
                    $data[$r][$c]      = $kisyu_month[$r-1][0];
                    $view_data[$r][$c] = number_format(($kisyu_month[$r-1][0] / $tani), $keta);
                } else {
                    $data[$r][$c]      =  0 ;    // データがセットされていない場合は０で初期化
                    $view_data[$r][$c] = '0';    // データがセットされていない場合は０で初期化
                }
            }
        } elseif ($c == 2) {                // 前々月
            if ($r == 3) {                  // 棚卸資産をまとめる F3 原材料及び貯蔵品(1250)
                if (isset($ppmonth[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $ppmonth[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                } else {
                    $data[3][$c]      =  0 ;     // データがセットされていない場合は０で初期化
                    $view_data[3][$c] = '0';     // データがセットされていない場合は０で初期化
                }
            } elseif ($r == 4) {   // 棚卸資産をまとめる 2009/07/08追加 F4 仕掛品(1240)
                if (isset($ppmonth[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $ppmonth[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                }
            } elseif ($r == 47) {   // 棚卸資産をまとめる F47 貯蔵品(1270)
                if (isset($ppmonth[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $ppmonth[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                }
            } elseif ($r == 53) {   // 棚卸資産をまとめる F53 商品及び製品(1230)
                if (isset($ppmonth[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $ppmonth[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                }
            } elseif (($r >= 13) && ($r <= 16)) {   // 有形固定資産をまとめる
                if (isset($ppmonth[$r-1][0])) {
                    $data[12][$c]      = ($data[12][$c] + $ppmonth[$r-1][0]);
                    $view_data[12][$c] = number_format(($data[12][$c] / $tani), $keta);
                } else {
                    $data[12][$c]      =  0 ;    // データがセットされていない場合は０で初期化
                    $view_data[12][$c] = '0';    // データがセットされていない場合は０で初期化
                }
            } elseif ($r == 48) {   // 有形固定資産をまとめる F48 リース資産(2211)
                if (isset($ppmonth[$r-1][0])) {
                    $data[12][$c]      = ($data[12][$c] + $ppmonth[$r-1][0]);
                    $view_data[12][$c] = number_format(($data[12][$c] / $tani), $keta);
                }
            } else {                        // 科目が１対１に対応している物
                if (isset($ppmonth[$r-1][0])) {
                    $data[$r][$c]      = $ppmonth[$r-1][0];
                    $view_data[$r][$c] = number_format(($ppmonth[$r-1][0] / $tani), $keta);
                } else {
                    $data[$r][$c]      =  0 ;    // データがセットされていない場合は０で初期化
                    $view_data[$r][$c] = '0';    // データがセットされていない場合は０で初期化
                }
            }
        } elseif ($c == 3) {                // 前月
            if ($r == 3) {                  // 棚卸資産をまとめる F3 原材料及び貯蔵品(1250)
                if (isset($pmonth[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $pmonth[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                } else {
                    $data[3][$c]      =  0 ;     // データがセットされていない場合は０で初期化
                    $view_data[3][$c] = '0';     // データがセットされていない場合は０で初期化
                }
            } elseif ($r == 4) {   // 棚卸資産をまとめる 2009/07/08追加 F4 仕掛品(1240)
                if (isset($pmonth[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $pmonth[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                }
            } elseif ($r == 47) {   // 棚卸資産をまとめる F47 貯蔵品(1270)
                if (isset($pmonth[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $pmonth[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                }
            } elseif ($r == 53) {   // 棚卸資産をまとめる F53 商品及び製品(1230)
                if (isset($pmonth[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $pmonth[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                }
            } elseif (($r >= 13) && ($r <= 16)) {   // 有形固定資産をまとめる
                if (isset($pmonth[$r-1][0])) {
                    $data[12][$c]      = ($data[12][$c] + $pmonth[$r-1][0]);
                    $view_data[12][$c] = number_format(($data[12][$c] / $tani), $keta);
                } else {
                    $data[12][$c]      =  0 ;    // データがセットされていない場合は０で初期化
                    $view_data[12][$c] = '0';    // データがセットされていない場合は０で初期化
                }
            } elseif ($r == 48) {   // 有形固定資産をまとめる F48 リース資産(2211)
                if (isset($pmonth[$r-1][0])) {
                    $data[12][$c]      = ($data[12][$c] + $pmonth[$r-1][0]);
                    $view_data[12][$c] = number_format(($data[12][$c] / $tani), $keta);
                }
            } else {                        // 科目が１対１に対応している物
                if (isset($pmonth[$r-1][0])) {
                    $data[$r][$c]      = $pmonth[$r-1][0];
                    $view_data[$r][$c] = number_format(($pmonth[$r-1][0] / $tani), $keta);
                } else {
                    $data[$r][$c]      =  0 ;    // データがセットされていない場合は０で初期化
                    $view_data[$r][$c] = '0';    // データがセットされていない場合は０で初期化
                }
            }
        } elseif ($c == 4) {                // 当月
            if ($r == 3) {                  // 棚卸資産をまとめる F3 原材料及び貯蔵品(1250)
                if (isset($month[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $month[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                } else {
                    $data[3][$c]      =  0 ;     // データがセットされていない場合は０で初期化
                    $view_data[3][$c] = '0';     // データがセットされていない場合は０で初期化
                }
            } elseif ($r == 4) {   // 棚卸資産をまとめる 2009/07/08追加 F4 仕掛品(1240)
                if (isset($month[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $month[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                }
            } elseif ($r == 47) {   // 棚卸資産をまとめる F47 貯蔵品(1270)
                if (isset($month[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $month[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                }
            } elseif ($r == 53) {   // 棚卸資産をまとめる F53 商品及び製品(1230)
                if (isset($month[$r-1][0])) {
                    $data[3][$c]      = ($data[3][$c] + $month[$r-1][0]);
                    $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
                }
            } elseif (($r >= 13) && ($r <= 16)) {   // 有形固定資産をまとめる
                if (isset($month[$r-1][0])) {
                    $data[12][$c]      = ($data[12][$c] + $month[$r-1][0]);
                    $view_data[12][$c] = number_format(($data[12][$c] / $tani), $keta);
                } else {
                    $data[12][$c]      =  0 ;    // データがセットされていない場合は０で初期化
                    $view_data[12][$c] = '0';    // データがセットされていない場合は０で初期化
                }
            } elseif ($r == 48) {   // 有形固定資産をまとめる F48 リース資産(2211)
                if (isset($month[$r-1][0])) {
                    $data[12][$c]      = ($data[12][$c] + $month[$r-1][0]);
                    $view_data[12][$c] = number_format(($data[12][$c] / $tani), $keta);
                }
            } else {                        // 科目が１対１に対応している物
                if (isset($month[$r-1][0])) {
                    $data[$r][$c]      = $month[$r-1][0];
                    $view_data[$r][$c] = number_format(($month[$r-1][0] / $tani), $keta);
                } else {
                    $data[$r][$c]      =  0 ;    // データがセットされていない場合は０で初期化
                    $view_data[$r][$c] = '0';    // データがセットされていない場合は０で初期化
                }
            }
        } elseif ($c == 5) {                // 対前月増減  ＝ (当月 － 前月)
            if ($r == 3) {                  // 棚卸資産をまとめる F3 原材料及び貯蔵品(1250)
                $data[3][$c]      = ($data[3][4] - $data[3][3]);
                $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
            } elseif ($r == 4) {    // 棚卸資産をまとめる 2009/07/08追加 F4 仕掛品(1240)
                $data[3][$c]      = ($data[3][4] - $data[3][3]);
                $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
            } elseif ($r == 47) {   // 棚卸資産をまとめる F47 貯蔵品(1270)
                $data[3][$c]      = ($data[3][4] - $data[3][3]);
                $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
            } elseif ($r == 53) {   // 棚卸資産をまとめる F53 商品及び製品(1230)
                $data[3][$c]      = ($data[3][4] - $data[3][3]);
                $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
            } elseif (($r >= 13) && ($r <= 16)) {   // 有形固定資産をまとめる
                $data[12][$c]      = ($data[12][4] - $data[12][3]);
                $view_data[12][$c] = number_format(($data[12][$c] / $tani), $keta);
            } elseif ($r == 48) {   // 有形固定資産をまとめる F48 リース資産(2211)
                $data[12][$c]      = ($data[12][4] - $data[12][3]);
                $view_data[12][$c] = number_format(($data[12][$c] / $tani), $keta);
            } else {                // 科目が１対１に対応している物
                $data[$r][$c]      = ($data[$r][4] - $data[$r][3]);
                $view_data[$r][$c] = number_format(($data[$r][$c] / $tani), $keta);
            }
        } elseif ($c == 6) {                // 期間増減  ＝  (当月 － 期首)
            if ($r == 3) {                  // 棚卸資産をまとめる F3 原材料及び貯蔵品(1250)
                $data[3][$c]      = ($data[3][4] - $data[3][1]);
                $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
            } elseif ($r == 4) {    // 棚卸資産をまとめる 2009/07/08追加 F4 仕掛品(1240)
                $data[3][$c]      = ($data[3][4] - $data[3][1]);
                $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
            } elseif ($r == 47) {   // 棚卸資産をまとめる F47 貯蔵品(1270)
                $data[3][$c]      = ($data[3][4] - $data[3][1]);
                $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
            } elseif ($r == 53) {   // 棚卸資産をまとめる F53 商品及び製品(1230)
                $data[3][$c]      = ($data[3][4] - $data[3][1]);
                $view_data[3][$c] = number_format(($data[3][$c] / $tani), $keta);
            } elseif (($r >= 13) && ($r <= 16)) {   // 有形固定資産をまとめる
                $data[12][$c]      = ($data[12][4] - $data[12][1]);
                $view_data[12][$c] = number_format(($data[12][$c] / $tani), $keta);
            } elseif ($r == 48) {   // 有形固定資産をまとめる F48 リース資産(2211)
                $data[12][$c]      = ($data[12][4] - $data[12][1]);
                $view_data[12][$c] = number_format(($data[12][$c] / $tani), $keta);
            } else {                // 科目が１対１に対応している物
                $data[$r][$c]      = ($data[$r][4] - $data[$r][1]);
                $view_data[$r][$c] = number_format(($data[$r][$c] / $tani), $keta);
            }
        }
    }
}
///// 小計・合計・総合計の計算
/********** 資産の部 流動資産の計 **********/
$rasset_sum      = array(1=>0, 2=>0, 3=>0, 4=>0, 5=>0, 6=>0);           // 初期化
$rasset_sum_view = array(1=>'', 2=>'', 3=>'', 4=>'', 5=>'', 6=>'');     // 初期化
for ($r = 1; $r <= 11; $r++) {            // スタートが１からに注意
    if ($r == 4) {
        continue;
    } else {
        for ($c = 1; $c <= 6; $c++) {           // カラム数 (期首 前々月 前月 当月 前月増減 期間増減)
            $rasset_sum[$c] += $data[$r][$c];
            $rasset_sum_view[$c] = number_format($rasset_sum[$c] / $tani, $keta);
        }
    }
}
///// このタイミングで追加になった未収法人等F46(1475)の処理追加 2005/04/14
    // 期首
$premonth_mihojin_view = number_format($premonth_mihojin / $tani, $keta);
$rasset_sum[1] += $premonth_mihojin;
$rasset_sum_view[1] = number_format($rasset_sum[1] / $tani, $keta);
    // 前々月
$ppmonth_mihojin_view = number_format($ppmonth_mihojin / $tani, $keta);
$rasset_sum[2] += $ppmonth_mihojin;
$rasset_sum_view[2] = number_format($rasset_sum[2] / $tani, $keta);
    // 前月
$pmonth_mihojin_view = number_format($pmonth_mihojin / $tani, $keta);
$rasset_sum[3] += $pmonth_mihojin;
$rasset_sum_view[3] = number_format($rasset_sum[3] / $tani, $keta);
    // 当月
$month_mihojin_view = number_format($month_mihojin / $tani, $keta);
$rasset_sum[4] += $month_mihojin;
$rasset_sum_view[4] = number_format($rasset_sum[4] / $tani, $keta);
    // 対前月増減  ＝ (当月 － 前月)
$mihojin_taizen_view = number_format(($month_mihojin - $pmonth_mihojin) / $tani, $keta);
$rasset_sum[5] += ($month_mihojin - $pmonth_mihojin);
$rasset_sum_view[5] = number_format($rasset_sum[5] / $tani, $keta);
    // 対期間増減  ＝ (当月 － 期首)
$mihojin_taikikan_view = number_format(($month_mihojin - $premonth_mihojin) / $tani, $keta);
$rasset_sum[6] += ($month_mihojin - $premonth_mihojin);
$rasset_sum_view[6] = number_format($rasset_sum[6] / $tani, $keta);

///// このタイミングで追加になった未収収益F56(1430)の処理追加 2017/04/06
    // 期首
$premonth_mishu_shueki_view = number_format($kisyu_month[55][0] / $tani, $keta);
$rasset_sum[1] += $kisyu_month[55][0];
$rasset_sum_view[1] = number_format($rasset_sum[1] / $tani, $keta);
    // 前々月
$ppmonth_mishu_shueki_view = number_format($ppmonth[55][0] / $tani, $keta);
$rasset_sum[2] += $ppmonth[55][0];
$rasset_sum_view[2] = number_format($rasset_sum[2] / $tani, $keta);
    // 前月
$pmonth_mishu_shueki_view = number_format($pmonth[55][0] / $tani, $keta);
$rasset_sum[3] += $pmonth[55][0];
$rasset_sum_view[3] = number_format($rasset_sum[3] / $tani, $keta);
    // 当月
$month_mishu_shueki_view = number_format($month[55][0] / $tani, $keta);
$rasset_sum[4] += $month[55][0];
$rasset_sum_view[4] = number_format($rasset_sum[4] / $tani, $keta);
    // 対前月増減  ＝ (当月 － 前月)
$mishu_shueki_taizen_view = number_format(($month[55][0] - $pmonth[55][0]) / $tani, $keta);
$rasset_sum[5] += ($month[55][0] - $pmonth[55][0]);
$rasset_sum_view[5] = number_format($rasset_sum[5] / $tani, $keta);
    // 対期間増減  ＝ (当月 － 期首)
$mishu_shueki_taikikan_view = number_format(($month[55][0] - $kisyu_month[55][0]) / $tani, $keta);
$rasset_sum[6] += ($month[55][0] - $kisyu_month[55][0]);
$rasset_sum_view[6] = number_format($rasset_sum[6] / $tani, $keta);

///// このタイミングで追加になった前払消費税F57(1495)の処理追加 2017/04/06
    // 期首
$premonth_mae_syohi_view = number_format($kisyu_month[56][0] / $tani, $keta);
$rasset_sum[1] += $kisyu_month[56][0];
$rasset_sum_view[1] = number_format($rasset_sum[1] / $tani, $keta);
    // 前々月
$ppmonth_mae_syohi_view = number_format($ppmonth[56][0] / $tani, $keta);
$rasset_sum[2] += $ppmonth[56][0];
$rasset_sum_view[2] = number_format($rasset_sum[2] / $tani, $keta);
    // 前月
$pmonth_mae_syohi_view = number_format($pmonth[56][0] / $tani, $keta);
$rasset_sum[3] += $pmonth[56][0];
$rasset_sum_view[3] = number_format($rasset_sum[3] / $tani, $keta);
    // 当月
$month_mae_syohi_view = number_format($month[56][0] / $tani, $keta);
$rasset_sum[4] += $month[56][0];
$rasset_sum_view[4] = number_format($rasset_sum[4] / $tani, $keta);
    // 対前月増減  ＝ (当月 － 前月)
$mae_syohi_taizen_view = number_format(($month[56][0] - $pmonth[56][0]) / $tani, $keta);
$rasset_sum[5] += ($month[56][0] - $pmonth[56][0]);
$rasset_sum_view[5] = number_format($rasset_sum[5] / $tani, $keta);
    // 対期間増減  ＝ (当月 － 期首)
$mae_syohi_taikikan_view = number_format(($month[56][0] - $kisyu_month[56][0]) / $tani, $keta);
$rasset_sum[6] += ($month[56][0] - $kisyu_month[56][0]);
$rasset_sum_view[6] = number_format($rasset_sum[6] / $tani, $keta);

    //////////// 2003/06/03 未収消費税追加のため
for ($c = 1; $c <= 6; $c++) {           // カラム数 (期首 前々月 前月 当月 前月増減 期間増減)
    if ($yyyymm < 200303) {
        $data[43][$c] = 0;
        $view_data[43][$c] = '0';       // 2003/02 以前は未対応のためリテラルで対応
    }
    $rasset_sum[$c] += $data[43][$c];   // t_row = 43 に未収消費税を追加 2003/06/03
    $rasset_sum_view[$c] = number_format($rasset_sum[$c] / $tani, $keta);
}
/********** 資産の部 固定資産の有形固定資産 計 **********/
$yasset_sum      = array(1=>0, 2=>0, 3=>0, 4=>0, 5=>0, 6=>0);           // 初期化
$yasset_sum_view = array(1=>'', 2=>'', 3=>'', 4=>'', 5=>'', 6=>'');     // 初期化
for ($r = 12; $r <= 18; $r++) {            // スタートが１からに注意 12 17 18
    if (($r >= 13) && ($r <=16)) {
        continue;
    } else {
        for ($c = 1; $c <= 6; $c++) {           // カラム数 (期首 前々月 前月 当月 前月増減 期間増減)
            $yasset_sum[$c] += $data[$r][$c];
            $yasset_sum_view[$c] = number_format($yasset_sum[$c] / $tani, $keta);
        }
    }
}
/********** 資産の部 固定資産の無形固定資産 計 **********/
$masset_sum      = array(1=>0, 2=>0, 3=>0, 4=>0, 5=>0, 6=>0);           // 初期化
$masset_sum_view = array(1=>'', 2=>'', 3=>'', 4=>'', 5=>'', 6=>'');     // 初期化
for ($r = 19; $r <= 20; $r++) {            // スタートが１からに注意 12 17 18
    for ($c = 1; $c <= 6; $c++) {           // カラム数 (期首 前々月 前月 当月 前月増減 期間増減)
        $masset_sum[$c] += $data[$r][$c];
        $masset_sum_view[$c] = number_format($masset_sum[$c] / $tani, $keta);
    }
}
///// このタイミングで追加になった施設利用権F45(2440)の処理追加
    // 期首
$premonth_sisetu_view = number_format($premonth_sisetu / $tani, $keta);
$masset_sum[1] += $premonth_sisetu;
$masset_sum_view[1] = number_format($masset_sum[1] / $tani, $keta);
    // 前々月
$ppmonth_sisetu_view = number_format($ppmonth_sisetu / $tani, $keta);
$masset_sum[2] += $ppmonth_sisetu;
$masset_sum_view[2] = number_format($masset_sum[2] / $tani, $keta);
    // 前月
$pmonth_sisetu_view = number_format($pmonth_sisetu / $tani, $keta);
$masset_sum[3] += $pmonth_sisetu;
$masset_sum_view[3] = number_format($masset_sum[3] / $tani, $keta);
    // 当月
$month_sisetu_view = number_format($month_sisetu / $tani, $keta);
$masset_sum[4] += $month_sisetu;
$masset_sum_view[4] = number_format($masset_sum[4] / $tani, $keta);
    // 対前月増減  ＝ (当月 － 前月)
$sisetu_taizen_view = number_format(($month_sisetu - $pmonth_sisetu) / $tani, $keta);
$masset_sum[5] += ($month_sisetu - $pmonth_sisetu);
$masset_sum_view[5] = number_format($masset_sum[5] / $tani, $keta);
    // 対期間増減  ＝ (当月 － 期首)
$sisetu_taikikan_view = number_format(($month_sisetu - $premonth_sisetu) / $tani, $keta);
$masset_sum[6] += ($month_sisetu - $premonth_sisetu);
$masset_sum_view[6] = number_format($masset_sum[6] / $tani, $keta);

/********** 資産の部 固定資産の計 **********/
for ($c = 1; $c <= 6; $c++) {           // カラム数 (期首 前々月 前月 当月 前月増減 期間増減)
    $kasset_sum[$c]      = ($yasset_sum[$c] + $masset_sum[$c]);
    $kasset_sum_view[$c] = number_format($kasset_sum[$c] / $tani, $keta);
}
/********** 資産の部 投資その他の資産の計 **********/
$tasset_sum      = array(1=>0, 2=>0, 3=>0, 4=>0, 5=>0, 6=>0);           // 初期化
$tasset_sum_view = array(1=>'', 2=>'', 3=>'', 4=>'', 5=>'', 6=>'');     // 初期化
for ($r = 21; $r <= 25; $r++) {            // スタートが１からに注意 12 17 18
    for ($c = 1; $c <= 6; $c++) {           // カラム数 (期首 前々月 前月 当月 前月増減 期間増減)
        $tasset_sum[$c] += $data[$r][$c];
        $tasset_sum_view[$c] = number_format($tasset_sum[$c] / $tani, $keta);
    }
}
/********** 資産の部 合計 **********/
for ($c = 1; $c <= 6; $c++) {           // カラム数 (期首 前々月 前月 当月 前月増減 期間増減)
    $all_asset_sum[$c]      = ($rasset_sum[$c] + $kasset_sum[$c] + $tasset_sum[$c]);
    $all_asset_sum_view[$c] = number_format($all_asset_sum[$c] / $tani, $keta);
}
/********** 負債の部 流動負債の計 **********/
$rdebt_sum      = array(1=>0, 2=>0, 3=>0, 4=>0, 5=>0, 6=>0);           // 初期化
$rdebt_sum_view = array(1=>'', 2=>'', 3=>'', 4=>'', 5=>'', 6=>'');     // 初期化
for ($r = 26; $r <= 36; $r++) {            // スタートが１からに注意 12 17 18
    for ($c = 1; $c <= 6; $c++) {           // カラム数 (期首 前々月 前月 当月 前月増減 期間増減)
        $rdebt_sum[$c] += $data[$r][$c];
        $rdebt_sum_view[$c] = number_format($rdebt_sum[$c] / $tani, $keta);
    }
}
///// このタイミングで追加になったリース債務(短期)F49(4161)の処理追加 2009/04/14
    // 期首
$premonth_lease_short_view = number_format($kisyu_month[48][0] / $tani, $keta);
$rdebt_sum[1] += $kisyu_month[48][0];
$rdebt_sum_view[1] = number_format($rdebt_sum[1] / $tani, $keta);
    // 前々月
$ppmonth_lease_short_view = number_format($ppmonth[48][0] / $tani, $keta);
$rdebt_sum[2] += $ppmonth[48][0];
$rdebt_sum_view[2] = number_format($rdebt_sum[2] / $tani, $keta);
    // 前月
$pmonth_lease_short_view = number_format($pmonth[48][0] / $tani, $keta);
$rdebt_sum[3] += $pmonth[48][0];
$rdebt_sum_view[3] = number_format($rdebt_sum[3] / $tani, $keta);
    // 当月
$month_lease_short_view = number_format($month[48][0] / $tani, $keta);
$rdebt_sum[4] += $month[48][0];
$rdebt_sum_view[4] = number_format($rdebt_sum[4] / $tani, $keta);
    // 対前月増減  ＝ (当月 － 前月)
$lease_short_taizen_view = number_format(($month[48][0] - $pmonth[48][0]) / $tani, $keta);
$rdebt_sum[5] += ($month[48][0] - $pmonth[48][0]);
$rdebt_sum_view[5] = number_format($rdebt_sum[5] / $tani, $keta);
    // 対期間増減  ＝ (当月 － 期首)
$lease_short_taikikan_view = number_format(($month[48][0] - $kisyu_month[48][0]) / $tani, $keta);
$rdebt_sum[6] += ($month[48][0] - $kisyu_month[48][0]);
$rdebt_sum_view[6] = number_format($rdebt_sum[6] / $tani, $keta);

/********** 負債の部 固定負債の計 **********/
$kdebt_sum      = array(1=>0, 2=>0, 3=>0, 4=>0, 5=>0, 6=>0);           // 初期化
$kdebt_sum_view = array(1=>'', 2=>'', 3=>'', 4=>'', 5=>'', 6=>'');     // 初期化
for ($r = 37; $r <= 38; $r++) {            // スタートが１からに注意 12 17 18
    for ($c = 1; $c <= 6; $c++) {           // カラム数 (期首 前々月 前月 当月 前月増減 期間増減)
        $kdebt_sum[$c] += $data[$r][$c];
        $kdebt_sum_view[$c] = number_format($kdebt_sum[$c] / $tani, $keta);
    }
}

///// このタイミングで追加になったリース債務(長期)F50(5180)の処理追加 2009/04/14
    // 期首
$premonth_lease_long_view = number_format($kisyu_month[49][0] / $tani, $keta);
$kdebt_sum[1] += $kisyu_month[49][0];
$kdebt_sum_view[1] = number_format($kdebt_sum[1] / $tani, $keta);
    // 前々月
$ppmonth_lease_long_view = number_format($ppmonth[49][0] / $tani, $keta);
$kdebt_sum[2] += $ppmonth[49][0];
$kdebt_sum_view[2] = number_format($kdebt_sum[2] / $tani, $keta);
    // 前月
$pmonth_lease_long_view = number_format($pmonth[49][0] / $tani, $keta);
$kdebt_sum[3] += $pmonth[49][0];
$kdebt_sum_view[3] = number_format($kdebt_sum[3] / $tani, $keta);
    // 当月
$month_lease_long_view = number_format($month[49][0] / $tani, $keta);
$kdebt_sum[4] += $month[49][0];
$kdebt_sum_view[4] = number_format($kdebt_sum[4] / $tani, $keta);
    // 対前月増減  ＝ (当月 － 前月)
$lease_long_taizen_view = number_format(($month[49][0] - $pmonth[49][0]) / $tani, $keta);
$kdebt_sum[5] += ($month[49][0] - $pmonth[49][0]);
$kdebt_sum_view[5] = number_format($kdebt_sum[5] / $tani, $keta);
    // 対期間増減  ＝ (当月 － 期首)
$lease_long_taikikan_view = number_format(($month[49][0] - $kisyu_month[49][0]) / $tani, $keta);
$kdebt_sum[6] += ($month[49][0] - $kisyu_month[49][0]);
$kdebt_sum_view[6] = number_format($kdebt_sum[6] / $tani, $keta);

///// このタイミングで追加になった長期未払金F51(5190)の処理追加 2009/04/14
///// dataの場合はF51だったら$data[51]でいいが$～monthの場合は-1しないとダメ
    // 期首
$premonth_mihalong_view = number_format($kisyu_month[50][0] / $tani, $keta);
$kdebt_sum[1] += $kisyu_month[50][0];
$kdebt_sum_view[1] = number_format($kdebt_sum[1] / $tani, $keta);
    // 前々月
$ppmonth_mihalong_view = number_format($ppmonth[50][0] / $tani, $keta);
$kdebt_sum[2] += $ppmonth[50][0];
$kdebt_sum_view[2] = number_format($kdebt_sum[2] / $tani, $keta);
    // 前月
$pmonth_mihalong_view = number_format($pmonth[50][0] / $tani, $keta);
$kdebt_sum[3] += $pmonth[50][0];
$kdebt_sum_view[3] = number_format($kdebt_sum[3] / $tani, $keta);
    // 当月
$month_mihalong_view = number_format($month[50][0] / $tani, $keta);
$kdebt_sum[4] += $month[50][0];
$kdebt_sum_view[4] = number_format($kdebt_sum[4] / $tani, $keta);
    // 対前月増減  ＝ (当月 － 前月)
$mihalong_taizen_view = number_format(($month[50][0] - $pmonth[50][0]) / $tani, $keta);
$kdebt_sum[5] += ($month[50][0] - $pmonth[50][0]);
$kdebt_sum_view[5] = number_format($kdebt_sum[5] / $tani, $keta);
    // 対期間増減  ＝ (当月 － 期首)
$mihalong_taikikan_view = number_format(($month[50][0] - $kisyu_month[50][0]) / $tani, $keta);
$kdebt_sum[6] += ($month[50][0] - $kisyu_month[50][0]);
$kdebt_sum_view[6] = number_format($kdebt_sum[6] / $tani, $keta);

/********** 負債の部 合計 **********/
for ($c = 1; $c <= 6; $c++) {           // カラム数 (期首 前々月 前月 当月 前月増減 期間増減)
    $all_debt_sum[$c]      = ($rdebt_sum[$c] + $kdebt_sum[$c]);
    $all_debt_sum_view[$c] = number_format($all_debt_sum[$c] / $tani, $keta);
}

/********** 純資産の部 資本金の計 **********/
    ///// 資本金と同じ(一つしかない)
for ($c = 1; $c <= 6; $c++) {           // カラム数 (期首 前々月 前月 当月 前月増減 期間増減)
    $capital_sum[$c] = $data[39][$c];
}

///// このタイミングで追加になった資本準備金F52(7210)の処理追加 2009/04/14
///// dataの場合はF52だったら$data[52]でいいが$～monthの場合は-1しないとダメ
    // 期首
$premonth_sjyunbi_view = number_format($kisyu_month[51][0] / $tani, $keta);
$hdebt_sum[1] += $kisyu_month[51][0];
$hdebt_sum_view[1] = number_format($hdebt_sum[1] / $tani, $keta);
    // 前々月
$ppmonth_sjyunbi_view = number_format($ppmonth[51][0] / $tani, $keta);
$hdebt_sum[2] += $ppmonth[51][0];
$hdebt_sum_view[2] = number_format($hdebt_sum[2] / $tani, $keta);
    // 前月
$pmonth_sjyunbi_view = number_format($pmonth[51][0] / $tani, $keta);
$hdebt_sum[3] += $pmonth[51][0];
$hdebt_sum_view[3] = number_format($hdebt_sum[3] / $tani, $keta);
    // 当月
$month_sjyunbi_view = number_format($month[51][0] / $tani, $keta);
$hdebt_sum[4] += $month[51][0];
$hdebt_sum_view[4] = number_format($hdebt_sum[4] / $tani, $keta);
    // 対前月増減  ＝ (当月 － 前月)
$sjyunbi_taizen_view = number_format(($month[51][0] - $pmonth[51][0]) / $tani, $keta);
$hdebt_sum[5] += ($month[51][0] - $pmonth[51][0]);
$hdebt_sum_view[5] = number_format($hdebt_sum[5] / $tani, $keta);
    // 対期間増減  ＝ (当月 － 期首)
$sjyunbi_taikikan_view = number_format(($month[51][0] - $kisyu_month[51][0]) / $tani, $keta);
$hdebt_sum[6] += ($month[51][0] - $kisyu_month[51][0]);
$hdebt_sum_view[6] = number_format($hdebt_sum[6] / $tani, $keta);

///// このタイミングで追加になったその他資本剰余金F54(？？？？)の処理追加 2009/08/20
///// dataの場合はF54だったら$data[54]でいいが$～monthの場合は-1しないとダメ
    // 期首
$premonth_s_sjyunbi_view = number_format($kisyu_month[53][0] / $tani, $keta);
$hdebt_sum[1] += $kisyu_month[53][0];
$hdebt_sum_view[1] = number_format($hdebt_sum[1] / $tani, $keta);
    // 前々月
$ppmonth_s_sjyunbi_view = number_format($ppmonth[53][0] / $tani, $keta);
$hdebt_sum[2] += $ppmonth[53][0];
$hdebt_sum_view[2] = number_format($hdebt_sum[2] / $tani, $keta);
    // 前月
$pmonth_s_sjyunbi_view = number_format($pmonth[53][0] / $tani, $keta);
$hdebt_sum[3] += $pmonth[53][0];
$hdebt_sum_view[3] = number_format($hdebt_sum[3] / $tani, $keta);
    // 当月
$month_s_sjyunbi_view = number_format($month[53][0] / $tani, $keta);
$hdebt_sum[4] += $month[53][0];
$hdebt_sum_view[4] = number_format($hdebt_sum[4] / $tani, $keta);
    // 対前月増減  ＝ (当月 － 前月)
$s_sjyunbi_taizen_view = number_format(($month[53][0] - $pmonth[53][0]) / $tani, $keta);
$hdebt_sum[5] += ($month[53][0] - $pmonth[53][0]);
$hdebt_sum_view[5] = number_format($hdebt_sum[5] / $tani, $keta);
    // 対期間増減  ＝ (当月 － 期首)
$s_sjyunbi_taikikan_view = number_format(($month[53][0] - $kisyu_month[53][0]) / $tani, $keta);
$hdebt_sum[6] += ($month[53][0] - $kisyu_month[53][0]);
$hdebt_sum_view[6] = number_format($hdebt_sum[6] / $tani, $keta);

/********** 純資産の部 資本剰余金の計 **********/
    ///// 資本準備金とその他資本剰余金の計
for ($c = 1; $c <= 6; $c++) {           // カラム数 (期首 前々月 前月 当月 前月増減 期間増減)
    $hcapital_sum[$c] = $hdebt_sum[$c];
    $hcapital_sum_view[$c] = number_format($hcapital_sum[$c] / $tani, $keta);
}

///// このタイミングで追加になったその他利益剰余金F55(？？？？)の処理追加 2009/08/20
///// dataの場合はF55だったら$data[55]でいいが$～monthの場合は-1しないとダメ
    // 期首
$premonth_s_rjyunbi_view = number_format($kisyu_month[54][0] / $tani, $keta);
$rjyunbi_sum[1] += $kisyu_month[54][0];
$rjyunbi_sum_view[1] = number_format($rjyunbi_sum[1] / $tani, $keta);
    // 前々月
$ppmonth_s_rjyunbi_view = number_format($ppmonth[54][0] / $tani, $keta);
$rjyunbi_sum[2] += $ppmonth[54][0];
$rjyunbi_sum_view[2] = number_format($rjyunbi_sum[2] / $tani, $keta);
    // 前月
$pmonth_s_rjyunbi_view = number_format($pmonth[54][0] / $tani, $keta);
$rjyunbi_sum[3] += $pmonth[54][0];
$rjyunbi_sum_view[3] = number_format($rjyunbi_sum[3] / $tani, $keta);
    // 当月
$month_s_rjyunbi_view = number_format($month[54][0] / $tani, $keta);
$rjyunbi_sum[4] += $month[54][0];
$rjyunbi_sum_view[4] = number_format($rjyunbi_sum[4] / $tani, $keta);
    // 対前月増減  ＝ (当月 － 前月)
$s_rjyunbi_taizen_view = number_format(($month[54][0] - $pmonth[54][0]) / $tani, $keta);
$rjyunbi_sum[5] += ($month[54][0] - $pmonth[54][0]);
$rjyunbi_sum_view[5] = number_format($rjyunbi_sum[5] / $tani, $keta);
    // 対期間増減  ＝ (当月 － 期首)
$s_rjyunbi_taikikan_view = number_format(($month[54][0] - $kisyu_month[54][0]) / $tani, $keta);
$rjyunbi_sum[6] += ($month[54][0] - $kisyu_month[54][0]);
$rjyunbi_sum_view[6] = number_format($rjyunbi_sum[6] / $tani, $keta);

/********** 純資産の部の部 利益剰余金の計 **********/
$jcapital_sum      = array(1=>0, 2=>0, 3=>0, 4=>0, 5=>0, 6=>0);           // 初期化
$jcapital_sum_view = array(1=>'', 2=>'', 3=>'', 4=>'', 5=>'', 6=>'');     // 初期化
for ($c = 1; $c <= 6; $c++) {           // カラム数 (期首 前々月 前月 当月 前月増減 期間増減)
    $jcapital_sum[$c] = $rjyunbi_sum[$c];
    $jcapital_sum_view[$c] = number_format($jcapital_sum[$c] / $tani, $keta);
}
for ($r = 40; $r <= 41; $r++) {            // スタートが１からに注意 12 17 18
    for ($c = 1; $c <= 6; $c++) {           // カラム数 (期首 前々月 前月 当月 前月増減 期間増減)
        $jcapital_sum[$c] += $data[$r][$c];
        $jcapital_sum_view[$c] = number_format($jcapital_sum[$c] / $tani, $keta);
    }
}
/********** 純資産の部 当期純利益 **********/
for ($c = 1; $c <= 6; $c++) {           // カラム数 (期首 前々月 前月 当月 前月増減 期間増減)
    $profit_sum[$c] = $data[42][$c];
}
/********** 純資産の部 合計 **********/
for ($c = 1; $c <= 6; $c++) {           // カラム数 (期首 前々月 前月 当月 前月増減 期間増減)
    $all_capital_sum[$c]      = ($capital_sum[$c] + $hcapital_sum[$c] + $jcapital_sum[$c] + $profit_sum[$c]);
    $all_capital_sum_view[$c] = number_format($all_capital_sum[$c] / $tani, $keta);
}

/********** 負債及び純資産の部 **********/
for ($c = 1; $c <= 6; $c++) {           // カラム数 (期首 前々月 前月 当月 前月増減 期間増減)
    $all_dcapital_sum[$c]      = ($all_debt_sum[$c] + $all_capital_sum[$c]);
    $all_dcapital_sum_view[$c] = number_format($all_dcapital_sum[$c] / $tani, $keta);
}


/********** 資産の部 流動資産の現金及び預金 **********/
/********** 資産の部 流動資産の売掛金 **********/
/********** 資産の部 流動資産の棚卸資産 **********/
/********** 資産の部 流動資産の前払費用 **********/
/********** 資産の部 流動資産の繰延税金資産 **********/
/********** 資産の部 流動資産の短期貸付金 **********/
/********** 資産の部 流動資産の未収入金 **********/
/********** 資産の部 流動資産の未収消費税等 **********/
/********** 資産の部 流動資産の立替金 **********/
/********** 資産の部 流動資産の仮払消費税等 **********/
/********** 資産の部 流動資産の仮払金 **********/
/********** 資産の部 流動資産のその他流動資産 **********/
/********** 資産の部 流動資産の貸倒引当金 **********/
    ///// これは現在は無い
/********** 資産の部 流動資産の計 **********/

/********** 資産の部 固定資産の有形固定資産 **********/
/********** 資産の部 固定資産の建設仮勘定 **********/
/********** 資産の部 固定資産の減価償却累計額 **********/
/********** 資産の部 固定資産の有形固定資産合計 **********/
/********** 資産の部 固定資産のソフトウェア **********/
/********** 資産の部 固定資産の電話加入権 **********/
/********** 資産の部 固定資産の無形固定資産合計 **********/
/********** 資産の部 固定資産の計 **********/

/********** 資産の部 投資その他の資産の長期貸付金 **********/
/********** 資産の部 投資その他の資産の長期前払費用 **********/
/********** 資産の部 投資その他の資産の繰延税金資産 **********/
/********** 資産の部 投資その他の資産の差入敷金保証金 **********/
/********** 資産の部 投資その他の資産のその他の投資等 **********/
/********** 資産の部 投資その他の資産の貸倒引当金 **********/
    ///// これは現在は無い
/********** 資産の部 投資その他の資産の計 **********/

/********** 資産の部 合計 **********/

/********** 負債の部 流動負債の支払手形 **********/
/********** 負債の部 流動負債の買掛金 **********/
/********** 負債の部 流動負債の短期借入金 **********/
/********** 負債の部 流動負債の未払金 **********/
/********** 負債の部 流動負債の未払消費税 **********/
/********** 負債の部 流動負債の未払法人税等 **********/
/********** 負債の部 流動負債の未払費用 **********/
/********** 負債の部 流動負債の預り金 **********/
/********** 負債の部 流動負債の仮払消費税等 **********/
/********** 負債の部 流動負債のその他の流動負債 **********/
/********** 負債の部 流動負債の賞与引当金 **********/
/********** 負債の部 流動負債の計 **********/

/********** 負債の部 固定負債の長期借入金 **********/
/********** 負債の部 固定負債の退職給付引当金 **********/
/********** 負債の部 固定負債の長期借入金 **********/
/********** 負債の部 固定負債のその他の固定負債 **********/
/********** 負債の部 固定負債の計 **********/

/********** 負債の部 負債の部合計 **********/


/********** 純資産の部 資本金の資本金 **********/
/********** 純資産の部 資本金の計 **********/

/********** 純資産の部 資本剰余金の資本準備金 **********/
/********** 純資産の部 資本剰余金のその他資本剰余金 **********/
/********** 純資産の部 資本剰余金の計 **********/

/********** 純資産の部 利益剰余金の利益準備金 **********/
/********** 純資産の部 利益剰余金のその他利益剰余金 **********/
/********** 純資産の部 利益剰余金の中間配当積立金 **********/
/********** 純資産の部 利益剰余金の特別償却積立金 **********/
/********** 純資産の部 利益剰余金の繰延利益剰余金 **********/
/********** 純資産の部 利益剰余金の計 **********/
/********** 純資産の部 当期純利益 **********/

/********** 純資産の部 純資産の部合計 **********/

/********** 負債及び純資産の部 **********/


    //// 当月データの登録
if (isset($_POST['input_data'])) {
    ///////// 項目とインデックスの関連付け
    $item = array();
    $item[0]   = "現金及び預金";
    $item[1]   = "売掛金";
    $item[2]   = "棚卸資産";
    $item[3]   = "前払費用";
    $item[4]   = "流動繰延税金資産";
    $item[5]   = "未収収益";
    $item[6]   = "短期貸付金";
    $item[7]   = "未収入金";
    $item[8]   = "未収消費税等";
    $item[9]   = "未収法人税等";
    $item[10]   = "立替金";
    $item[11]  = "仮払消費税等";
    $item[12]  = "前払消費税";
    $item[13]  = "仮払金";
    $item[14]  = "その他流動資産";
    $item[15]  = "流動貸倒引当金";
    $item[16]  = "流動資産計";
    $item[17]  = "有形固定資産";
    $item[18]  = "建設仮勘定";
    $item[19]  = "減価償却累計額";
    $item[20]  = "有形固定資産計";
    $item[21]  = "ソフトウェア";
    $item[22]  = "電話加入権";
    $item[23]  = "施設利用権";
    $item[24]  = "無形固定資産計";
    $item[25]  = "固定資産計";
    $item[26]  = "長期貸付金";
    $item[27]  = "長期前払費用";
    $item[28]  = "固定繰延税金資産";
    $item[29]  = "差入敷金保証金";
    $item[30]  = "その他の投資等";
    $item[31]  = "固定貸倒引当金";
    $item[32]  = "投資その他の資産計";
    $item[33]  = "資産の部合計";
    $item[34]  = "支払手形";
    $item[35]  = "買掛金";
    $item[36]  = "短期借入金";
    $item[37]  = "リース債務(短期)";
    $item[38]  = "未払金";
    $item[39]  = "未払消費税";
    $item[40]  = "未払法人税等";
    $item[41]  = "未払費用";
    $item[42]  = "預り金";
    $item[43]  = "仮受消費税等";
    $item[44]  = "その他の流動負債";
    $item[45]  = "賞与引当金";
    $item[46]  = "流動負債計";
    $item[47]  = "長期借入金";
    $item[48]  = "リース債務(長期)";
    $item[49]  = "長期未払金";
    $item[50]  = "退職給付引当金";
    $item[51]  = "その他の固定負債";
    $item[52]  = "固定負債計";
    $item[53]  = "負債の部合計";
    $item[54]  = "資本金";
    $item[55]  = "資本金計";
    $item[56]  = "資本準備金";
    $item[57]  = "その他資本剰余金";
    $item[58]  = "資本剰余金計";
    $item[59]  = "利益準備金";
    $item[60]  = "その他利益剰余金";
    $item[61]  = "繰越利益剰余金";
    $item[62]  = "利益剰余金計";
    $item[63]  = "当期純利益";
    $item[64]  = "純資産の部合計";
    $item[65]  = "負債及び純資産の部";
    ///////// 各データの保管
    ///// 表示データからカンマを削除する
    ///// $number = str_replace(',','',$english_format_number);
    $input_data = array();
    $input_data[0]   = str_replace(',','',$view_data[1][4]);   // 現金及び預金
    $input_data[1]   = str_replace(',','',$view_data[2][4]);   // 売掛金
    $input_data[2]   = str_replace(',','',$view_data[3][4]);   // 棚卸資産
    $input_data[3]   = str_replace(',','',$view_data[5][4]);   // 前払費用
    $input_data[4]   = str_replace(',','',$view_data[6][4]);   // 流動繰延税金資産
    $input_data[5]   = str_replace(',','',$month_mishu_shueki_view);  // 未収収益
    $input_data[6]   = "";   // 短期貸付金
    $input_data[7]   = str_replace(',','',$view_data[7][4]);   // 未収入金
    $input_data[8]   = str_replace(',','',$view_data[43][4]);   // 未収消費税等
    $input_data[9]   = str_replace(',','',$month_mihojin_view);   // 未収法人税等
    $input_data[10]  = str_replace(',','',$view_data[8][4]);   // 立替金
    $input_data[11]  = str_replace(',','',$view_data[9][4]);   // 仮払消費税等
    $input_data[12]   = str_replace(',','',$month_mae_syohi_view);  // 前払消費税
    $input_data[13]  = str_replace(',','',$view_data[10][4]);   // 仮払金
    $input_data[14]  = str_replace(',','',$view_data[11][4]);   // その他流動資産
    $input_data[15]  = "";   // 貸倒引当金
    $input_data[16]  = str_replace(',','',$rasset_sum_view[4]);   // 流動資産計
    $input_data[17]  = str_replace(',','',$view_data[12][4]);   // 有形固定資産
    $input_data[18]  = str_replace(',','',$view_data[17][4]);   // 建設仮勘定
    $input_data[19]  = str_replace(',','',$view_data[18][4]);   // 減価償却累計額
    $input_data[20]  = str_replace(',','',$yasset_sum_view[4]);   // 有形固定資産計
    $input_data[21]  = str_replace(',','',$view_data[20][4]);   // ソフトウェア
    $input_data[22]  = str_replace(',','',$view_data[19][4]);   // 電話加入権
    $input_data[23]  = str_replace(',','',$month_sisetu_view);   // 施設利用権
    $input_data[24]  = str_replace(',','',$masset_sum_view[4]);   // 無形固定資産計
    $input_data[25]  = str_replace(',','',$kasset_sum_view[4]);   // 固定資産計
    $input_data[26]  = str_replace(',','',$view_data[22][4]);   // 長期貸付金
    $input_data[27]  = str_replace(',','',$view_data[23][4]);   // 長期前払費用
    $input_data[28]  = str_replace(',','',$view_data[24][4]);   // 繰延税金資産
    $input_data[29]  = str_replace(',','',$view_data[25][4]);   // 差入敷金保証金
    $input_data[30]  = str_replace(',','',$view_data[21][4]);   // その他の投資等
    $input_data[31]  = "";   // 貸倒引当金
    $input_data[32]  = str_replace(',','',$tasset_sum_view[4]);   // 投資その他の資産計
    $input_data[33]  = str_replace(',','',$all_asset_sum_view[4]);   // 資産の部合計
    $input_data[34]  = str_replace(',','',$view_data[26][4]);   // 支払手形
    $input_data[35]  = str_replace(',','',$view_data[27][4]);   // 買掛金
    $input_data[36]  = str_replace(',','',$view_data[28][4]);   // 短期借入金
    $input_data[37]  = str_replace(',','',$month_lease_short_view);   // リース債務(短期)
    $input_data[38]  = str_replace(',','',$view_data[29][4]);   // 未払金
    $input_data[39]  = str_replace(',','',$view_data[30][4]);   // 未払消費税
    $input_data[40]  = str_replace(',','',$view_data[31][4]);   // 未払法人税等
    $input_data[41]  = str_replace(',','',$view_data[32][4]);   // 未払費用
    $input_data[42]  = str_replace(',','',$view_data[34][4]);   // 預り金
    $input_data[43]  = str_replace(',','',$view_data[35][4]);   // 仮受消費税等
    $input_data[44]  = str_replace(',','',$view_data[33][4]);   // その他の流動負債
    $input_data[45]  = str_replace(',','',$view_data[36][4]);   // 賞与引当金
    $input_data[46]  = str_replace(',','',$rdebt_sum_view[4]);   // 流動負債計
    $input_data[47]  = str_replace(',','',$view_data[37][4]);   // 長期借入金
    $input_data[48]  = str_replace(',','',$month_lease_long_view);   // リース債務(長期)
    $input_data[49]  = str_replace(',','',$month_mihalong_view);   // 長期未払金
    $input_data[50]  = str_replace(',','',$view_data[38][4]);   // 退職給付引当金
    $input_data[51]  = "";   // その他の固定負債
    $input_data[52]  = str_replace(',','',$kdebt_sum_view[4]);   // 固定負債計
    $input_data[53]  = str_replace(',','',$all_debt_sum_view[4]);   // 負債の部合計
    $input_data[54]  = str_replace(',','',$view_data[39][4]);   // 資本金
    $input_data[55]  = str_replace(',','',$view_data[39][4]);   // 資本金計
    $input_data[56]  = str_replace(',','',$month_sjyunbi_view);   // 資本準備金
    $input_data[57]  = str_replace(',','',$month_s_sjyunbi_view);   // その他資本剰余金
    $input_data[58]  = str_replace(',','',$hcapital_sum_view[4]);   // 資本剰余金計
    $input_data[59]  = "";   // 利益準備金
    $input_data[60]  = str_replace(',','',$month_s_rjyunbi_view);   // その他利益剰余金
    $input_data[61]  = str_replace(',','',$view_data[41][4]);   // 繰越利益剰余金
    $input_data[62]  = str_replace(',','',$jcapital_sum_view[4]);   // 利益剰余金計
    $input_data[63]  = str_replace(',','',$view_data[42][4]);   // 当期純利益
    $input_data[64]  = str_replace(',','',$all_capital_sum_view[4]);   // 純資産の部合計
    $input_data[65]  = str_replace(',','',$all_dcapital_sum_view[4]);   // 負債及び純資産の部
    
    insert_date($item,$yyyymm,$input_data);
}
function insert_date($item,$yyyymm,$input_data) 
{
    for ($i = 0; $i < 66; $i++) {
        //$item_in     = array();
        //$item_in[$i] = $item[$i];
        //$input_data[$i][$sec] = str_replace(',','',$input_data[$i][$sec]);
        $query = sprintf("select kin from profit_loss_bs_history where pl_bs_ym=%d and note='%s'", $yyyymm, $item[$i]);
        $res_in = array();
        if (getResult2($query,$res_in) <= 0) {
            /////////// begin トランザクション開始
            if ($con = db_connect()) {
                query_affected_trans($con, "begin");
            } else {
                $_SESSION["s_sysmsg"] .= "データベースに接続できません";
                exit();
            }
            ////////// Insert Start
            $query = sprintf("insert into profit_loss_bs_history (pl_bs_ym, kin, note, last_date, last_user) values (%d, %d, '%s', CURRENT_TIMESTAMP, '%s')", $yyyymm, $input_data[$i], $item[$i], $_SESSION['User_ID']);
            if (query_affected_trans($con, $query) <= 0) {
                $_SESSION["s_sysmsg"] .= sprintf("%sの新規登録に失敗<br> %d", $item[$i], $yyyymm);
                query_affected_trans($con, "rollback");     // transaction rollback
                exit();
            }
            /////////// commit トランザクション終了
            query_affected_trans($con, "commit");
            $_SESSION["s_sysmsg"] = sprintf("<font color='yellow'>%d 貸借対照表データ 新規 登録完了</font>",$yyyymm);
        } else {
            /////////// begin トランザクション開始
            if ($con = db_connect()) {
                query_affected_trans($con, "begin");
            } else {
                $_SESSION["s_sysmsg"] .= "データベースに接続できません";
                exit();
            }
            ////////// UPDATE Start
            $query = sprintf("update profit_loss_bs_history set kin=%d, last_date=CURRENT_TIMESTAMP, last_user='%s' where pl_bs_ym=%d and note='%s'", $input_data[$i], $_SESSION['User_ID'], $yyyymm, $item[$i]);
            if (query_affected_trans($con, $query) <= 0) {
                $_SESSION["s_sysmsg"] .= sprintf("%sのUPDATEに失敗<br> %d", $item[$i], $yyyymm);
                query_affected_trans($con, "rollback");     // transaction rollback
                exit();
            }
            /////////// commit トランザクション終了
            query_affected_trans($con, "commit");
            $_SESSION["s_sysmsg"] = sprintf("<font color='yellow'>%d 貸借対照表データ 変更 完了</font>",$yyyymm);
        }
    }
    $_SESSION["s_sysmsg"] .= "当月のデータを登録しました。";
}
/////////// HTML Header を出力してキャッシュを制御
$menu->out_html_header();
?>
<!DOCTYPE html>
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta http-equiv="Content-Style-Type" content="text/css">
<title><?= $menu->out_title() ?></title>
<?= $menu->out_site_java() ?>
<?= $menu->out_css() ?>
<?= $menu->out_jsBaseClass() ?>

<style type='text/css'>
<!--
select {
    background-color:teal;
    color:white;
}
textarea {
    background-color:black;
    color:white;
}
input.sousin {
    background-color:red;
}
input.text {
    background-color:black;
    color:white;
}
.pt8 {
    font:normal 8pt;
    font-family: monospace;
}
.pt10 {
    font:normal 10pt;
    font-family: monospace;
}
.pt10b {
    font:bold 10pt;
    font-family: monospace;
}
.pt12b {
    font:bold 12pt;
    font-family: monospace;
}
.title_font {
    font:bold 13.5pt;
    font-family: monospace;
}
.today_font {
    font-size: 10.5pt;
    font-family: monospace;
}
.corporate_name {
    font:bold 10pt;
    font-family: monospace;
}
.margin0 {
    margin:0%;
}
.OnOff_font {
    font-size:     8.5pt;
    font-family:   monospace;
}
-->
</style>
</head>
<body>
    <center>
<?= $menu->out_title_border() ?>
        <table width='100%' border='1' cellspacing='1' cellpadding='1'>
            <tr>
                <td colspan='3' bgcolor='#d6d3ce' align='center' class='corporate_name'>
                    <?=$menu->out_caption(), "\n"?>
                </td>
                <form method='post' action='<?php echo $menu->out_self() ?>'>
                    <td colspan='15' bgcolor='#d6d3ce' align='right' class='pt10'>
                        単位
                        <select name='taisyaku_tani' class='pt10'>
                        <?php
                            if ($tani == 1000)
                                echo "<option value='1000' selected>　千円</option>\n";
                            else
                                echo "<option value='1000'>　千円</option>\n";
                            if ($tani == 1)
                                echo "<option value='1' selected>　　円</option>\n";
                            else
                                echo "<option value='1'>　　円</option>\n";
                            if ($tani == 1000000)
                                echo "<option value='1000000' selected>百万円</option>\n";
                            else
                                echo "<option value='1000000'>百万円</option>\n";
                            if ($tani == 10000)
                                echo "<option value='10000' selected>　万円</option>\n";
                            else
                                echo "<option value='10000'>　万円</option>\n";
                            if($tani == 100000)
                                echo "<option value='100000' selected>十万円</option>\n";
                            else
                                echo "<option value='100000'>十万円</option>\n";
                        ?>
                        </select>
                        少数桁
                        <select name='keihi_keta' class='pt10'>
                        <?php
                            if ($keta == 0)
                                echo "<option value='0' selected>０桁</option>\n";
                            else
                                echo "<option value='0'>０桁</option>\n";
                            if ($keta == 3)
                                echo "<option value='3' selected>３桁</option>\n";
                            else
                                echo "<option value='3'>３桁</option>\n";
                            if ($keta == 6)
                                echo "<option value='6' selected>６桁</option>\n";
                            else
                                echo "<option value='6'>６桁</option>\n";
                            if ($keta == 1)
                                echo "<option value='1' selected>１桁</option>\n";
                            else
                                echo "<option value='1'>１桁</option>\n";
                            if ($keta == 2)
                                echo "<option value='2' selected>２桁</option>\n";
                            else
                                echo "<option value='2'>２桁</option>\n";
                            if ($keta == 4)
                                echo "<option value='4' selected>４桁</option>\n";
                            else
                                echo "<option value='4'>４桁</option>\n";
                            if ($keta == 5)
                                echo "<option value='5' selected>５桁</option>\n";
                            else
                                echo "<option value='5'>５桁</option>\n";
                        ?>
                        </select>
                        <input class='pt10b' type='submit' name='return' value='単位変更'>
                        <?php
                        if ($_SESSION['User_ID'] == '300144') {
                            if ($keta == 0 && $tani == 1) {
                        ?>
                            &nbsp;
                            <input class='pt10b' type='submit' name='input_data' value='当月データ登録'>
                        <?php
                            } else {
                        ?>
                            <input class='pt10b' type='submit' name='input_data' value='当月データ登録' disabled>
                        <?php
                            }
                        }
                        ?>
                    </td>
                </form>
            </tr>
        </table>
        <?php
            //  bgcolor='#ceffce' 黄緑
            //  bgcolor='#ffffc6' 薄い黄色
            //  bgcolor='#d6d3ce' Win グレイ
        ?>
    <table width='100%' bgcolor='#d6d3ce' align='left' cellspacing="0" cellpadding="3" border='1'>
        <tr>
        <td>
        <table width='50%' bgcolor='#d6d3ce' align='left' cellspacing="0" cellpadding="3" border='1'>
            <TBODY>
                <tr>
                    <td colspan='3' width='200' align='center' class='pt10b' bgcolor='#ceffce'>科　　　目</td>
                    <td nowrap align='center' class='pt10b' bgcolor='#ceffce'>期　　首</td>
                    <td nowrap align='center' class='pt10b' bgcolor='#ceffce'><?php echo $p2_ym ?></td>
                    <td nowrap align='center' class='pt10b' bgcolor='#ceffce'><?php echo $p1_ym ?></td>
                    <td nowrap align='center' class='pt10b' bgcolor='#ceffce'><?php echo $yyyymm ?></td>
                    <td nowrap align='center' class='pt8'   bgcolor='#ceffce'>対前月増減</td>
                    <td nowrap align='center' class='pt10' bgcolor='#ceffce'>期間増減</td>
                </tr>
                <tr>
                    <td rowspan='35' width='10' align='center' valign='middle' class='pt10b' bgcolor='#ceffce'>資産の部</td>
                    <td rowspan='18' width='10' align='center' valign='middle' class='pt10b' bgcolor='#ffffc6'>流動資産</td>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　現金及び預金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[1][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[1][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[1][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[1][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[1][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[1][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　売　 掛 　金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[2][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[2][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[2][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[2][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[2][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[2][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　棚 卸 資 産</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[3][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[3][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[3][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[3][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[3][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[3][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　前 払 費 用</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[5][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[5][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[5][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[5][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[5][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[5][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　繰延税金資産</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[6][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[6][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[6][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[6][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[6][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[6][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　未 収 収 益</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $premonth_mishu_shueki_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $ppmonth_mishu_shueki_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $pmonth_mishu_shueki_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $month_mishu_shueki_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $mishu_shueki_taizen_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $mishu_shueki_taikikan_view ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　短期貸付金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td> <!-- 余白 -->
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　未 収 入 金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[7][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[7][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[7][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[7][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[7][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[7][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　未収消費税等</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[43][1] ?></td> <!-- 余白 -->
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[43][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[43][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[43][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[43][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[43][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　未収法人税等</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $premonth_mihojin_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $ppmonth_mihojin_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $pmonth_mihojin_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $month_mihojin_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $mihojin_taizen_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $mihojin_taikikan_view ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　立　 替 　金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[8][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[8][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[8][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[8][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[8][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[8][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　仮払消費税等</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[9][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[9][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[9][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[9][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[9][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[9][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　前払消費税</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $premonth_mae_syohi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $ppmonth_mae_syohi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $pmonth_mae_syohi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $month_mae_syohi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $mae_syohi_taizen_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $mae_syohi_taikikan_view ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　仮 　払　 金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[10][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[10][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[10][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[10][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[10][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[10][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　その他流動資産</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[11][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[11][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[11][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[11][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[11][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[11][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　貸倒引当金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td> <!-- 余白 -->
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td> <!-- 余白 -->
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='#ffffc6'>計</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $rasset_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $rasset_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $rasset_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $rasset_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $rasset_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $rasset_sum_view[6] ?></td>
                </tr>
                <tr>
                    <td rowspan='9' width='10' align='center' valign='middle' class='pt10b' bgcolor='#ffffc6'>固定資産</td>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　有形固定資産</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[12][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[12][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[12][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[12][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[12][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[12][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　建設仮勘定</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[17][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[17][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[17][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[17][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[17][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[17][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　減価償却累計額</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[18][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[18][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[18][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[18][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[18][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[18][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='#ffffc6'>有形固定資産 計</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $yasset_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $yasset_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $yasset_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $yasset_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $yasset_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $yasset_sum_view[6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　ソフトウェア</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[20][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[20][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[20][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[20][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[20][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[20][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　電話加入権</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[19][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[19][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[19][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[19][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[19][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[19][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　施設利用権</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $premonth_sisetu_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $ppmonth_sisetu_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $pmonth_sisetu_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $month_sisetu_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $sisetu_taizen_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $sisetu_taikikan_view ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='#ffffc6'>無形固定資産 計</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $masset_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $masset_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $masset_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $masset_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $masset_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $masset_sum_view[6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='#ffffc6'>計</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $kasset_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $kasset_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $kasset_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $kasset_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $kasset_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $kasset_sum_view[6] ?></td>
                </tr>
                <tr>
                    <td rowspan='7' width='10' align='center' valign='middle' class='pt10b' bgcolor='#ffffc6'>投資その他の資産</td>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　長期貸付金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[22][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[22][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[22][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[22][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[22][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[22][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　長期前払費用</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[23][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[23][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[23][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[23][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[23][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[23][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　繰延税金資産</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[24][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[24][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[24][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[24][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[24][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[24][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　差入敷金保証金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[25][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[25][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[25][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[25][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[25][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[25][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　その他の投資等</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[21][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[21][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[21][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[21][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[21][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[21][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='left' class='pt10b' bgcolor='white'>　貸倒引当金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td> <!-- 余白 -->
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='#ffffc6'>計</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $tasset_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $tasset_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $tasset_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $tasset_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $tasset_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $tasset_sum_view[6] ?></td>
                </tr>
                <tr>
                    <td colspan='2' align='center' class='pt10b' bgcolor='#ceffce'>資産の部 合計</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_asset_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_asset_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_asset_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_asset_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_asset_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_asset_sum_view[6] ?></td>
                </tr>
            </TBODY>
        </table>
        </td>
        <td>
        <table width='50%' bgcolor='#d6d3ce' align='right' cellspacing="0" cellpadding="3" border='1'>
            <TBODY>
                <tr>
                    <td colspan='3' width='200' align='center' class='pt10b' bgcolor='#ceffce'>科　　　目</td>
                    <td nowrap align='center' class='pt10b' bgcolor='#ceffce'>期　　首</td>
                    <td nowrap align='center' class='pt10b' bgcolor='#ceffce'><?php echo $p2_ym ?></td>
                    <td nowrap align='center' class='pt10b' bgcolor='#ceffce'><?php echo $p1_ym ?></td>
                    <td nowrap align='center' class='pt10b' bgcolor='#ceffce'><?php echo $yyyymm ?></td>
                    <td nowrap align='center' class='pt8'   bgcolor='#ceffce'>対前月増減</td>
                    <td nowrap align='center' class='pt10'  bgcolor='#ceffce'>期間増減</td>
                </tr>
                <tr>
                    <td rowspan='21' width='10' align='center' valign='middle' class='pt10b' bgcolor='#ceffce'>負債の部</td>
                    <td rowspan='14' width='10' align='center' valign='middle' class='pt10b' bgcolor='#ffffc6'>流動負債</td>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>支　払　手　形</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[26][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[26][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[26][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[26][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[26][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[26][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>買　　掛　　金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[27][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[27][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[27][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[27][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[27][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[27][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>短 期 借 入 金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[28][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[28][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[28][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[28][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[28][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[28][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>リース債務(短期)</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $premonth_lease_short_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $ppmonth_lease_short_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $pmonth_lease_short_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $month_lease_short_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $lease_short_taizen_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $lease_short_taikikan_view ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>未　　払　　金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[29][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[29][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[29][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[29][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[29][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[29][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>未 払 消 費 税</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[30][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[30][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[30][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[30][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[30][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[30][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>未払法人税等</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[31][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[31][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[31][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[31][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[31][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[31][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>未　払　費　用</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[32][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[32][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[32][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[32][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[32][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[32][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>預　　り　　金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[34][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[34][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[34][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[34][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[34][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[34][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>仮受消費税等</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[35][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[35][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[35][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[35][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[35][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[35][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>その他の流動負債</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[33][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[33][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[33][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[33][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[33][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[33][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>賞 与 引 当 金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[36][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[36][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[36][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[36][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[36][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[36][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='#ffffc6'>計</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $rdebt_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $rdebt_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $rdebt_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $rdebt_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $rdebt_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $rdebt_sum_view[6] ?></td>
                </tr>
                <tr>
                    <td rowspan='6' width='10' align='center' valign='middle' class='pt10b' bgcolor='#ffffc6'>固定負債</td>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>長 期 借 入 金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[37][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[37][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[37][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[37][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[37][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[37][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>リース債務(長期)</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $premonth_lease_long_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $ppmonth_lease_long_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $pmonth_lease_long_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $month_lease_long_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $lease_long_taizen_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $lease_long_taikikan_view ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>長 期 未 払 金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $premonth_mihalong_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $ppmonth_mihalong_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $pmonth_mihalong_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $month_mihalong_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $mihalong_taizen_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $mihalong_taikikan_view ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>退職給付引当金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[38][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[38][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[38][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[38][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[38][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[38][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>その他の固定負債</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td> <!-- 余白 -->
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='#ffffc6'>計</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $kdebt_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $kdebt_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $kdebt_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $kdebt_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $kdebt_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $kdebt_sum_view[6] ?></td>
                </tr>
                <tr>
                    <td colspan='2' align='center' class='pt10b' bgcolor='#ceffce'>負債の部 合計</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_debt_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_debt_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_debt_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_debt_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_debt_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_debt_sum_view[6] ?></td>
                </tr>
                <tr>
                    <td rowspan='13' width='10' align='center' valign='middle' class='pt10b' bgcolor='#ceffce'>純資産の部</td><!--資本の部-->
                    <td rowspan='3'  width='10' align='center' valign='middle' class='pt10b' bgcolor='#ffffc6'>資本金</td>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>資　　本　　金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[39][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[39][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[39][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[39][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[39][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[39][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>　</td> <!-- 余白 -->
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='#ffffc6'>資本金 計</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $view_data[39][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $view_data[39][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $view_data[39][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $view_data[39][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $view_data[39][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $view_data[39][6] ?></td>
                </tr>
                <tr>
                    <td rowspan='4' width='10' align='center' valign='middle' class='pt10b' bgcolor='#ffffc6'>資本剰余金</td>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>資 本 準 備 金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $premonth_sjyunbi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $ppmonth_sjyunbi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $pmonth_sjyunbi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $month_sjyunbi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $sjyunbi_taizen_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $sjyunbi_taikikan_view ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>その他資本剰余金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $premonth_s_sjyunbi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $ppmonth_s_sjyunbi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $pmonth_s_sjyunbi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $month_s_sjyunbi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $s_sjyunbi_taizen_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $s_sjyunbi_taikikan_view ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>　</td> <!-- 余白 -->
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='#ffffc6'>資本剰余金 計</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $hcapital_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $hcapital_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $hcapital_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $hcapital_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $hcapital_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $hcapital_sum_view[6] ?></td>
                </tr>
                <tr>
                    <td rowspan='4' width='10' align='center' valign='middle' class='pt10b' bgcolor='#ffffc6'>利益剰余金</td>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>利 益 準 備 金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td> <!-- 余白 -->
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                </tr>
                <!--
                <tr>
                    <td rowspan='4' width='10' align='center' valign='middle' class='pt10b' bgcolor='#ffffc6'>利益剰余金</td>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>中間配当積立金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'>　</td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>特別償却積立金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[40][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[40][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[40][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[40][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[40][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[40][6] ?></td>
                </tr>
                -->
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>その他利益剰余金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $premonth_s_rjyunbi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $ppmonth_s_rjyunbi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $pmonth_s_rjyunbi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $month_s_rjyunbi_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $s_rjyunbi_taizen_view ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $s_rjyunbi_taikikan_view ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='white'>繰越利益剰余金</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[41][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[41][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[41][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[41][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[41][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='white'><?php echo $view_data[41][6] ?></td>
                </tr>
                <tr>
                    <td nowrap align='center' class='pt10b' bgcolor='#ffffc6'>利益剰余金 計</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $jcapital_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $jcapital_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $jcapital_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $jcapital_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $jcapital_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $jcapital_sum_view[6] ?></td>
                </tr>
                <tr>
                    <td colspan='2' nowrap align='center' class='pt10b' bgcolor='#ffffc6'>当 期 純 利 益</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $view_data[42][1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $view_data[42][2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $view_data[42][3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $view_data[42][4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $view_data[42][5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ffffc6'><?php echo $view_data[42][6] ?></td>
                </tr>
                <tr>
                    <td colspan='2' align='center' class='pt10b' bgcolor='#ceffce'>純資産の部 合計</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_capital_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_capital_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_capital_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_capital_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_capital_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_capital_sum_view[6] ?></td>
                </tr>
                <tr>
                    <td colspan='3' align='center' class='pt10b' bgcolor='#ceffce'>負債及び純資産の部</td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_dcapital_sum_view[1] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_dcapital_sum_view[2] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_dcapital_sum_view[3] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_dcapital_sum_view[4] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_dcapital_sum_view[5] ?></td>
                    <td nowrap align='right'  class='pt10b' bgcolor='#ceffce'><?php echo $all_dcapital_sum_view[6] ?></td>
                </tr>
            </TBODY>
        </table>
        </td>
        </tr>
    </table>
    </center>
</body>
</html>
